{
    "scene_name":"FloorPlan403",
    "trials":{
        "train/pick_and_place_simple-DishSponge-None-Toilet-403/trial_T20190907_192753_899150/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_39PAAFCODPH6SDQJP4IMOVPK55ZVT4",
                    "high_descs":[
                        "Turn around and walk over to the toilet, then turn right and walk over to the rightmost sink.",
                        "Pick up the sponge out of the rightmost sink basin.",
                        "Turn right and walk over to the wall, then turn right again and walk over to the wall, then turn right to face the toilet.",
                        "Place the sponge vertically on top of the toilet tank to the right of the closest white rag."
                    ],
                    "task_desc":"Move a sponge onto the toilet tank.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3K3R2QNK8EKNVJS5M83019MPXS79UF",
                    "high_descs":[
                        "Turn around and walk to the sink on the right.",
                        "Pick up the sponge out of the sink basin.",
                        "Turn around and walk to the toilet.",
                        "Put the sponge on the top of the toilet, to the right of the closest cloth rag."
                    ],
                    "task_desc":"Move a sponge from a sink basin to the top of a toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A32W24TWSWXW_3L4D84MIL297W9ZU8LNE7OB2ZOVHJT",
                    "high_descs":[
                        "Turn around and walk to the toilet, turn right for two steps, turn left for two steps, turn right and walk to the sink.",
                        "Pick up the green sponge in the sink.",
                        "Turn right for 2 steps, turn right again and walk to the wall, turn right and walk toward the toilet. ",
                        "On the top of the toilet tank, set the sponge down standing vertically with the green side facing away from the wall."
                    ],
                    "task_desc":"Pick up a scrub sponge and set it vertically on the top of the toilet tank.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "DishSponge",
                "Plunger",
                "PaperTowelRoll",
                "ScrubBrush",
                "SoapBar",
                "SoapBottle",
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-DishSponge-None-Toilet-403/trial_T20190907_192722_315071/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3CN4LGXD5053FM6YFE4YNMHM7PP4YZ",
                    "high_descs":[
                        "Turn around and cross the room to face the tub near the faucet.",
                        "Pick the green sponge up from the side of the tub.",
                        "Go to the left and face the toilet.",
                        "Put the sponge on the back of the toilet."
                    ],
                    "task_desc":"Put a sponge on the back of the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3FIUS151DYJJ5BEIG9KTPB7LSYIGGA",
                    "high_descs":[
                        "turn around, walk forward, stop to face the bath tub on the left",
                        "pick up the sponge that is on the bath tub",
                        "turn left, walk forward to door, turn right, turn right to face toilet",
                        "put the sponge on the back of the toilet"
                    ],
                    "task_desc":"move sponge from bath tub to back of toilet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OCHAWUVGR1ZTJ5RVA5CBPZ925GXK7",
                    "high_descs":[
                        "Turn around and begin walking across the room, then turn left to face the tub.",
                        "Pick up the sponge off of the tub.",
                        "Turn left and walk towards the door, then hang a right and walk over to the wall, turn right to face the toilet.",
                        "Put the sponge on top of the toilet tank standing up."
                    ],
                    "task_desc":"Move a sponge to the toilet tank.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-SprayBottle-None-Toilet-403/trial_T20190908_042208_991561/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2TBXASXZIRNNW_31LVTDXBLARQGT1X7BBL17Q0QVCLRS",
                    "high_descs":[
                        "Turn around. Turn left.",
                        "Grab the spray bottle by the sink.",
                        "Turn around and go to the toilet.",
                        "Place the spray bottle on the toilet."
                    ],
                    "task_desc":"Put the spray bottle on the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A11LSO6D7BMY99_33PPUNGG3BMALII1MC2U9M1Y55FRZE",
                    "high_descs":[
                        "turn around to the sink , go the the right end",
                        "pick up the spray bottle that is on the sink",
                        "take the spray bottle to the toilet",
                        "set the spray bottle on the toilet tank on the far side closest to the tub"
                    ],
                    "task_desc":"place a spray bottle on the toilet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A11IIS435RPN2O_3Z3ZLGNNSLB9OOW8OQIL0VMEUOAQ3B",
                    "high_descs":[
                        "Turn around go to the door and then turn left and walk to the wash basin.",
                        "Pick up the grey color Spray bottle from the counter.",
                        "Turn around and go to the toilet seat.",
                        "Place the Spray bottle on the Water tank of the toilet seat."
                    ],
                    "task_desc":"Place the Spray bottle on the Toilet tank.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Toilet",
                "SprayBottle"
            ]
        },
        "train/pick_and_place_simple-SprayBottle-None-Toilet-403/trial_T20190908_042148_900573/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3TE3O85733PKF7FPX5TGMBRRKXMR2E",
                    "high_descs":[
                        "Move to the opposite corner of the room to the left side of the bathroom counter top",
                        "Pick up the grey spray bottle on top of the counter top to the left",
                        "Carry the spray bottle to the toilet",
                        "Place the spray bottle on top of the toilet tank in front of the lotion bottle"
                    ],
                    "task_desc":"Move a spray bottle to the top of the toilet tank",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3YT88D1N0BFNDLYDBLYO49A5VJTK3Q",
                    "high_descs":[
                        "walk over to the front of the counter between the sinks",
                        "pick up the spray bottle from the counter top",
                        "bring the spray bottle over to the side of the toilet",
                        "place the bottle on the back of the toilet on the tank"
                    ],
                    "task_desc":"get the spray bottle from the counter and put it on the back of the toilet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3R2UR8A0IDXIJAQ6T2X5I6GIMJ5OXF",
                    "high_descs":[
                        "Turn around and go to the bathroom counter, between the two sinks. ",
                        "Pick up the grey spray bottle, on the counter, between the two sinks. ",
                        "Turn around and go across the bathroom, to the toilet. ",
                        "Place the grey spray bottle on the back of the toilet. "
                    ],
                    "task_desc":"Put a spray bottle on the toilet tank. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-Plunger-None-Cabinet-403/trial_T20190909_054730_826329/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_3FFJ6VRIL4F8BNVQO3KAQHHNUS4I0D",
                    "high_descs":[
                        "Turn around, walk forwards, and hang a right to reach the toilet.",
                        "Pick up the plunger from next to the toilet.",
                        "Turn around and walk towards the sink at the far wall.",
                        "Open the furthest cabinet to the right under the sink and put the plunger in it."
                    ],
                    "task_desc":"Move the plunger to the cabinet under the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MP3NYIS55VQP_3HVVDCPGTHJVHW7MQNUNWGDGHMTTY0",
                    "high_descs":[
                        "Turn right and walk to the toilet roll holder. ",
                        "Pick up the plunger below the toilet roll holder. ",
                        "Turn around and walk to the cupboard under the sink. ",
                        "Open the right door and put the plunger inside the cupboard. "
                    ],
                    "task_desc":"Put the plunger inside the cupboard. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3ND9UOO81NT39E4H2DA8PSIJC1BLWU",
                    "high_descs":[
                        "Turn right and walk towards the door, then turn right and walk up to the wall and look down.",
                        "Pick up the plunger off of the ground to the left of the toilet.",
                        "Walk over to the right side of the sink counter behind you.",
                        "Open the rightmost cabinet door below the counter and put the plunger inside, then close the cabinet."
                    ],
                    "task_desc":"Move a plunger into a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Plunger"
            ]
        },
        "train/pick_and_place_simple-Plunger-None-Cabinet-403/trial_T20190909_054745_555153/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_37Q970SNZHZXCQJ4PYIO8O6K8JXS15",
                    "high_descs":[
                        "Turn around and walk to the left side of the toilet ahead.",
                        "Pick up the plunger with the wooden handle from the floor to the left side of the toilet.",
                        "Turn around, turn left at the toilet and walk to the cabinets under the right sink of the vanity to the right.",
                        "Open the lower right cabinet, put the plunger inside and close the door."
                    ],
                    "task_desc":"Place a plunger in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3L4D84MIL2JFHYLS4TCV8AV4TPOJHN",
                    "high_descs":[
                        "Turn around and cross the room to face the left of the toilet.",
                        "Pick the black and brown plunger up from the floor to the left of the toilet.",
                        "Turn around and cross the room to face the cabinets below the sink.",
                        "Put the plunger in the cabinet on the right, below the sink on the right, and shut the door."
                    ],
                    "task_desc":"Put a plunger in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3SEPORI8WQQQ7QIIG95PFIWQZSAAZN",
                    "high_descs":[
                        "Turn around and move forward to go to the wall ahead of you.",
                        "Pick up the plunger next to the toilet.",
                        "Turn around and approach the sink in front of you, then look down at the cabinets beneath the sink.",
                        "Open the cabinet on the left, put the plunger inside, and close it."
                    ],
                    "task_desc":"Put a plunger in the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Plunger"
            ]
        },
        "train/pick_two_obj_and_place-Candle-None-Cabinet-403/trial_T20190909_065841_838469/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_3IUZPWIU1RYSP8MZHDY7AS54N21KWN",
                    "high_descs":[
                        "walk straight towards the sink",
                        "pick up the candle off of the sink counter",
                        "turn around and walk straight then turn left then turn left again and look down",
                        "open the cabinet door and put the candle inside and close the door",
                        "turn left and walk straight then turn right and walk straight towards the sink",
                        "pick up the candle on the sink counter",
                        "turn around and walk straight then turn left and walk straight then turn left towards the sink cabinets ",
                        "open the cabinet door and put the candle next to the other candle and close the door"
                    ],
                    "task_desc":"put candle's into the cabinet below the sink",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Candle"
            ]
        },
        "train/pick_two_obj_and_place-Candle-None-Cabinet-403/trial_T20190909_065744_416414/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6SR4BU227GUH_3C5W7UE9CIH24WRSCU79ROBFL9ZXMV",
                    "high_descs":[
                        "turn right to face the bath tub",
                        "pick up the bottle behind the grey bottle on the bath tub",
                        "turn around and face the sink",
                        "open the far left cabinet door below the sink and place the bottle inside",
                        "turn around to face the bath again",
                        "pick up the bottle to the left of the grey bottle on the bath ",
                        "turn around and face the sink again to open the far left cabinet door",
                        "place the bottle to the left of the one you just placed there."
                    ],
                    "task_desc":"Move bottles from the bath tub to the cabinet for storage",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "Candle"
            ]
        },
        "train/pick_two_obj_and_place-SprayBottle-None-Cabinet-403/trial_T20190907_123359_561127/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3T9K2RY06UO14_3IUZPWIU1ROK4J01L59Q96L2TXEKWT",
                    "high_descs":[
                        "Turn and go to the counter between the sinks.",
                        "Pick up a spray bottle on the counter. ",
                        "Turn and go to the cupboards under the sinks. ",
                        "Put the spray bottle in the cupboard.",
                        "Turn and go to the counter between the sinks.",
                        "Pick up a spray bottle on the counter. ",
                        "Turn and go to the cupboards under the sinks. ",
                        "Put the spray bottle in the cupboard."
                    ],
                    "task_desc":"Move the spray bottles from the counter to the cupboards under the sinks. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_39ZSFO5CABDC1V5E8KUDQ30ST0XJU4",
                    "high_descs":[
                        "Turn left, move to the counter between the sinks.",
                        "Pick up the left hand spray bottle from the counter.",
                        "Turn right, move to the counter near the right hand sink.",
                        "Put the spray bottle into the cabinet of the right hand sink.",
                        "Turn right, move to the counter between the sinks.",
                        "Pick up the spray bottle from the counter.",
                        "Turn left, move to the counter near the right hand sink.",
                        "Put the spray bottle into the cabinet of the right hand sink."
                    ],
                    "task_desc":"Place spray bottles into the cabinet below a sink.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_two_obj_and_place-SprayBottle-None-Cabinet-403/trial_T20190907_123331_293578/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_36ZN444YTUFLTF1BUGX4FWT3YS7ION",
                    "high_descs":[
                        "Turn left and head to the trash can that is to the right of the sink",
                        "Pick up the spray bottle that is inside the trash can",
                        "Turn around and take a step then turn to your right and head to the vanity with the two sinks",
                        "Open the left cabinet that is under the right hand sink and place the spray bottle into the cabinet then close the door",
                        "Step closer to the sink ",
                        "Pick up the spray bottle that is sitting on the counter between the sinks",
                        "Turn around and take a step, and then turn around to face the sinks",
                        "Open the left cabinet that is under the right hand sink and place the spray bottle into the cabinet  to the right of the spray bottle that is already there, then close the door"
                    ],
                    "task_desc":"Place spray bottles in a cabinet",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2JBNDG0U9IA6I_3K4J6M3CXHAIVK1FU9SJTPWIUWVGAA",
                    "high_descs":[
                        "Turn around and walk straight then turn left and face the green trash bin",
                        "Pick up the bottle from the trash bin",
                        "Turn around and walk to the right and face the sinks",
                        "Open the cabinet below and place the bottle inside",
                        "Face the counter next to the sink",
                        "Pick up the bottle on the counter",
                        "Turn to the left and open the cabinet door below ",
                        "Place the bottle inside the cabinet"
                    ],
                    "task_desc":"Put away bottles in the bathroom",
                    "votes":[
                        1,
                        0,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3HMVI3QICM9MNN9FSWLWPOAJV7L1YT",
                    "high_descs":[
                        "Turn to the left and walk forward to face the trash can on the ground.",
                        "Pick up the black spray bottle in the trash can.",
                        "Turn to the left and face the cabinet on the right side of the sink.",
                        "Place the black spray bottle in the cabinet under the right side of the sink.",
                        "Look up to face the black spray bottle on top of the counter between the two sinks.",
                        "Pick up the black spray bottle on counter between the sink.",
                        "Look down to face the cabinet on the right below the sink.",
                        "Put the black spray bottle in the cabinet under the sink beside the other black spray bottles."
                    ],
                    "task_desc":"To collect black spray bottles, as well as store them under the right side of the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-CounterTop-403/trial_T20190908_144317_008888/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_32M8BPYGAWD5MR6B259DB94312GIGP",
                    "high_descs":[
                        "Move to the tub on your right.",
                        "Pick up the green sponge in the tub. ",
                        "Turn around, bring the sponge to the left sink.",
                        "Wash the sponge in the sink with water. ",
                        "Bring the washed sponge to counter in the middle, right of the left sink. ",
                        "Put the sponge on the counter. "
                    ],
                    "task_desc":"Put a washed sponge on the counter. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3C5W7UE9CIH24WRSCU79ROBFL12MX7",
                    "high_descs":[
                        "Turn around and face the tub.",
                        "Pick the green sponge up out of the tub.",
                        "Turn around and face the sink.",
                        "Put the sponge in the sink and turn the water on and then off and then pick the sponge up again.",
                        "Move to the left and face the counter in between the sinks.",
                        "Put the sponge on the sink."
                    ],
                    "task_desc":"Put a clean sponge on the counter.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-CounterTop-403/trial_T20190908_144337_493760/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3AZHRG4CU7BTLKD730DNMBFYB3103B",
                    "high_descs":[
                        "Turn left then face the left side of the sink",
                        "Pick up the sponge on the left side of the sink",
                        "Move backwards a little and face the sink",
                        "Put the sponge in the sink and rinse it",
                        "Turn right then move few steps then face the counter in between the sinks",
                        "Put the sponge on the counter beside the container"
                    ],
                    "task_desc":"Put the clean sponge on the counter",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3XCC1ODXDO29SF38VO8YJF9WULIQR6",
                    "high_descs":[
                        "Turn left and walk to the left side of the sink. ",
                        "Pick up the sponge to the left of the sink. ",
                        "Look down at the sink. ",
                        "Put the sponge inside of the sink, use water to rinse the sponge off, take the sponge out of the sink. ",
                        "Move to the right side of the left sink. ",
                        "Put the sponge down on the counter in between the two sinks. "
                    ],
                    "task_desc":"To rinse a sponge and put it down on the counter. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_33NF62TLXMT6JOM0AEFSL2BWLYBJKU",
                    "high_descs":[
                        "Move to the left sink on your left.",
                        "Pick up the sponge left of the sink. ",
                        "Bring the sponge to the left sink.",
                        "Wash the sponge in the left sink. ",
                        "Bring the cleaned sponge to the counter between the two sinks.",
                        "Put the cleaned sponge on the counter, left of the soap. "
                    ],
                    "task_desc":"Put a cleaned sponge on the counter. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "DishSponge",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-SprayBottle-None-Cabinet-403/trial_T20190908_221042_476220/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFU00NU09CFXE_3EJPLAJKEP7PKO6FQWODZDU435HZ6B",
                    "high_descs":[
                        "Turn right to go to the shower, then head right again to stand in front of the two sinks.",
                        "Pick up the spray bottle from the counter between the two sinks.",
                        "Take a step back from the vanity while carrying the spray bottle so you have room to open a cupboard.",
                        "Open the second rightmost cupboard and place the spray bottle inside."
                    ],
                    "task_desc":"Put a spray bottle away under the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1M682B2WUSYJP_3FIUS151DYTRQ00GCH9AQXRNMTQGG5",
                    "high_descs":[
                        "Turn right, walk to the wall, turn right, and walk to the counter.",
                        "Pick up the spray bottle between the two sinks.",
                        "Turn around, walk to the  tub, then turn around again.",
                        "Open the rightmost cabinet, place the bottle inside, then close the cabinet door."
                    ],
                    "task_desc":"Move the spray bottle to the cabinet beneath the right sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3OLF68YTNCSK29RIFXBICQG8NJBFAR",
                    "high_descs":[
                        "Turn right and go forward then turn right and walk up to the sink",
                        "Pick up the spray bottle from the counter between the sinks",
                        "Walk slightly away from the counter then turn back to face it",
                        "Open the left cabinet below the right sink and put the spray bottle in it"
                    ],
                    "task_desc":"Put the spray bottle in the bathroom cabinet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_and_place_simple-SprayBottle-None-Cabinet-403/trial_T20190908_220946_946277/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3TPZPLC3M33W91HRKLSD1CG6JFG3PW",
                    "high_descs":[
                        "Turn around completely, walk to the door, turn left and walk up to the green trash bin. ",
                        "Pick up the spray bottle that is in the trash bin. ",
                        "Move over to the lower cabinet that is to the left of the trash bin.",
                        "Place the spray bottle inside the cabinet, to the left of the soap, and close the door. "
                    ],
                    "task_desc":"Place a spray bottle inside a lower cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3TVSS0C0E4RRSRCMBMCZBJS06BYTW0",
                    "high_descs":[
                        "Turn around and go towards the door, then turn left to go to the trash bin.",
                        "Pick up a spray bottle from inside the trash bin.",
                        "Go to the sink to your left and look down at the cabinets under it.",
                        "Open the right most cabinet, put the spray bottle inside, and close the cabinet."
                    ],
                    "task_desc":"Put a spray bottle in the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3UJ1CZ6IZKGW08KNQLK0BEJ1KVD5S3",
                    "high_descs":[
                        "Turn around and take a few steps then turn left and walk to the green garbage can that's on the floor.",
                        "Pick up the spray bottle that's in front of you.",
                        "Turn around and take a step then turn right and take a step then turn right.",
                        "Open the cabinet door under the sink that's farthest to the right and put the spray bottle on the left bar of soap before closing the door again."
                    ],
                    "task_desc":"Put a spray bottle in the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_and_place_simple-SprayBottle-None-Cabinet-403/trial_T20190908_221024_103153/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A22ON3MIIG0IJA_3A1PQ49WVK88MH5OE46P4AZIZ4BH1W",
                    "high_descs":[
                        "Turn around and walk to the left side of the toilet.",
                        "Pick up the spray bottle from the toilet",
                        "Turn around and walk to the sink on the right hand side.",
                        "Put the spray bottle in the far right cupboard."
                    ],
                    "task_desc":"Put a spray bottle in the cupboard under the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3BEFOD78W9KB6U3ISJ54UDEHSAK4M5",
                    "high_descs":[
                        "walk to face left side of toilet",
                        "pick up spray bottle from toilet tank top",
                        "walk to face cabinets under right hand sink",
                        "put spray bottle inside cabinet"
                    ],
                    "task_desc":"put spray bottle inside cabinet under sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3WOKGM4L747I796TMYXFAED96YK0O1",
                    "high_descs":[
                        "Turn around and go to the toilet across from you. ",
                        "Pick up the grey spray bottle on the back of the toilet. ",
                        "Turn around and go to the cabinets underneath the right sink. ",
                        "Place the grey spray bottle in the right cabinet, under the right sink. "
                    ],
                    "task_desc":"Put the spray bottle under the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Candle",
                "ToiletPaper",
                "HandTowel",
                "DishSponge",
                "Plunger",
                "PaperTowelRoll",
                "ScrubBrush",
                "SoapBar",
                "SoapBottle",
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-DishSponge-None-Toilet-403/trial_T20190908_025001_182302/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ACSS93E03ZUGX_354P56DE9NK32NC8I6AG8CDVHGY7S7",
                    "high_descs":[
                        "Turn around and go to the right to face the tub.",
                        "Pick up the green sponge on the left.",
                        "Move to the left and walk around to the other side of the toilet.",
                        "Place the green sponge on top of the toilet.",
                        "Turn to the right then to left to face the tub again.",
                        "Pick up the other green sponge in the tub.",
                        "Move to the left and walk around to the other side of the toilet.",
                        "Place the green sponge on top of the toilet next to the other one."
                    ],
                    "task_desc":"Place both green sponges on top of the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_two_obj_and_place-DishSponge-None-Toilet-403/trial_T20190908_024658_735745/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3OLQQLKKNV6VCZ8SIKF8MLEP7LWEJT",
                    "high_descs":[
                        "Go to the sink on the right side. ",
                        "Open the cabinet under the sink and pick up the green sponge.",
                        "Turn around and go to the left side of the toilet.",
                        "Place the sponge next to the hand soap on the top of the water tank on the toilet.",
                        "Go back to the sink on the right. ",
                        "Pick up the green sponge on the top of the sink.",
                        "Go back to the left side of the toilet. ",
                        "Place the sponge standing up to the right of the first sponge. "
                    ],
                    "task_desc":"Gather the sponges and put them on the toilet water tank.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-BathtubBasin-403/trial_T20190908_033323_791635/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1AKL5YH9NLD2V_39JEC7537XIP6WO83INWZLPGHUMVCU",
                    "high_descs":[
                        "Turn left and walk to the sponge behind the faucet of the tub.",
                        "Pick up the sponge behind the faucet of the tub.",
                        "Turn around and walk to the sink closest to the shower.",
                        "Rinse the sponge in the sink and then pick the clean sponge up.",
                        "Turn around and walk to the tub.",
                        "Place the sponge in the middle of the tub."
                    ],
                    "task_desc":"Place a rinsed sponge inside the tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3KOPY89HMBJS21SVT0YC3UASGUC3JT",
                    "high_descs":[
                        "Move left to face the tub on the left. ",
                        "Pick up the sponge on the tub. ",
                        "Turn around, bring the the sponge to the left sink.",
                        "Wash the sponge in the sink. ",
                        "Turn around with the cleaned sponge and head to the tub. ",
                        "Put the cleaned sponge in the tub. "
                    ],
                    "task_desc":"Put a cleaned sponge in the tub. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3WAKVUDHUZXJH04C7B5GNDVJ2BCU7Z",
                    "high_descs":[
                        "Turn left, walk to tub, turn left.",
                        "Pick up green sponge from far end of tub ledge.",
                        "Turn around, go to sink across room.",
                        "Put sponge in left side of sink, turn water on, turn water off, drain water.  Pick up sponge.",
                        "Turn around, go to center of tub.",
                        "Put sponge in tub, behind and slightly to right of candlestick."
                    ],
                    "task_desc":"Wash sponge and place in tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-BathtubBasin-403/trial_T20190908_033349_122378/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_388U7OUMFAIDJXCBIIP23NYCNY5R0V",
                    "high_descs":[
                        "Turn to the left and walk across the room to face the sink.",
                        "Pick up the sponge on the sink.",
                        "Take a step to the left to face the left side sink.",
                        "Wash the sponge in the sink and pick it back up.",
                        "Turn around and walk forward to face the bath tub.",
                        "Place the sponge in the bath tub."
                    ],
                    "task_desc":"To wash a sponge in the sink as well as place the sponge in the bath tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3MB8LZR5BIA4TPO2HR2O0V4MV4HLK0",
                    "high_descs":[
                        "Turn left and walk to the sponge on the counter between the two sinks.",
                        "Pick up the sponge from the counter.",
                        "Walk to the sink on the left.",
                        "Put the sponge in the sink, rinse it off, and take it out of the sink.",
                        "Turn around and walk forward to the bath tub.",
                        "Put the sponge in the bath tub basin."
                    ],
                    "task_desc":"Put a cleaned sponge in a bath tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3VD82FOHKT5UGCFB261I4TV8L1KCO4",
                    "high_descs":[
                        "Turn around, move to the sink on the right.",
                        "Pick up the sponge from the counter, next to the sink. ",
                        "Bring the sponge to the left sink. ",
                        "Wash the sponge in the left sink. ",
                        "Turn around with the washed sponge, move forward to the tub. ",
                        "Put the sponge in the tub. "
                    ],
                    "task_desc":"Put a cleaned sponge in the tub. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Candle",
                "HandTowel",
                "DishSponge",
                "PaperTowelRoll",
                "ScrubBrush",
                "SoapBar",
                "SoapBottle",
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-GarbageCan-403/trial_T20190907_034554_937587/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_39ASUFLU60OW7JDHZOU9DUM4IY9XES",
                    "high_descs":[
                        "GO right and stand in front of the toilet paper holder next to the toilet.",
                        "Take the toilet paper from the holder on the wall.",
                        "Turn around and walk to the green waste basket in the corner.",
                        "Put the toilet paper in the waste basket in the corner."
                    ],
                    "task_desc":"Put toilet paper in the waste basket.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3IO1LGZLKCE2F3JULYZJL7DYAN086Q",
                    "high_descs":[
                        "turn right and walk to the end of the room, then turn right to face the toilet",
                        "grab the toilet paper roll off of the toilet paper holder",
                        "turn right and walk to the end of the room",
                        "throw the toilet paper roll the green garbage bin on the floor"
                    ],
                    "task_desc":"throw away the toilet paper roll",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3MD9PLUKKLVP6KQ9T5LD02WO4NCNZ2",
                    "high_descs":[
                        "Move to the left side of the toilet next to the plunger",
                        "Remove the roll of toilet paper from the toilet paper holder",
                        "Carry the toilet paper to the green trash bin to the right of the sink",
                        "Throw the toilet paper into the green trash bin"
                    ],
                    "task_desc":"Place a roll of toilet paper into the green trash bin",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper",
                "PaperTowelRoll"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-GarbageCan-403/trial_T20190907_034528_884833/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A17TKHT8FEVH0R_31T4R4OBOVXNV6NCLKKGT79DVX87CD",
                    "high_descs":[
                        "Turn to your left and head to the toilet",
                        "Grab the cardboard tube that is on top of the toilet",
                        "Turn right and head to the trash can",
                        "Throw the cardboard tube in the trash can"
                    ],
                    "task_desc":"Throwing the cardboard tube in the trash",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_36WLNQG782RPUGAGUS2ROXVCZZVBEF",
                    "high_descs":[
                        "Look at the back of the toilet.",
                        "Pick up the empty toilet paper tube from the front corner of the tank.",
                        "Turn to your right and cross the room to the green wastebasket on the other side.",
                        "Throw the toilet paper tube into the wastebasket."
                    ],
                    "task_desc":"Discard an empty toilet paper tube in a bathroom wastebasket.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3A0EX8ZRNB5N0LR7UTELV0NSHBDYBU",
                    "high_descs":[
                        "Walk to the toilet.",
                        "Pick up the tube on the back of the toilet.",
                        "Walk to the trash can.",
                        "Throw away the tube."
                    ],
                    "task_desc":"Throw away the tube on back of the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_34J10VATJIFOERER9TP841O3DXDIQR",
                    "high_descs":[
                        "Turn to the left, and then the right to face the side of the toilet.",
                        "Pick up the paper roll from the back of the toilet.",
                        "Carry the paper roll and turn around, then left, and go straight back to find the trash can.",
                        "Place the paper roll in the trash can."
                    ],
                    "task_desc":"Throw away a toilet paper roll.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3CFVK00FWO2XUA3DFN8NQCZ4U0IL6Y",
                    "high_descs":[
                        "turn to the left, walk forward, turn to the right, face the side of the toilet",
                        "pick up the empty toilet paper roll that is on the back of the toilet",
                        "turn to the right, walk forward towards the green trash can",
                        "put the empty toilet paper roll in the green trash can"
                    ],
                    "task_desc":"throw away an empty toilet paper roll",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3H8DHMCCWCSLVD0A4A40HIWHMMQDK5",
                    "high_descs":[
                        "Move to face the left side of the toilet against the wall",
                        "Pick up the brown tube on the back of the left side of the toilet",
                        "Carry the brown tube to the green trash can",
                        "Place the brown tube in the green bin"
                    ],
                    "task_desc":"Move a brown tube from the toilet to the trash",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-GarbageCan-403/trial_T20190907_034648_807245/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AWEPZMK7825JQ_3CTOC39K3A7A3KTIVC12GBM8LF7J7P",
                    "high_descs":[
                        "Turn left and walk toward the door, then turn right and walk towards the toilet dispenser and turn to face the toilet.",
                        "Take the roll of toilet paper off the dispenser. ",
                        "Turn left and walk towards the trash bin.",
                        "Put the toilet paper inside the trash bin."
                    ],
                    "task_desc":"Throw away the roll of toilet paper.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3HVVDCPGTH9NW7LOUF56VUTENH8YTD",
                    "high_descs":[
                        "Go to the left and stand in front of the toilet paper holder.",
                        "Take the toilet paper from the holder.",
                        "Turn around and go to the green trash can on the floor behind.",
                        "Put the toilet paper in the trash can."
                    ],
                    "task_desc":"Put a roll of toilet paper in the trash can.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3X4MXAO0BJ56RNDWBPINAI7GONHWR3",
                    "high_descs":[
                        "Turn left towards the door, turn right towards the wall, and then turn left to face the toilet paper roll.",
                        "Take the toilet paper roll out of the holder.",
                        "Turn right and walk towards the green bin on the floor.",
                        "Place the toilet paper in the bin."
                    ],
                    "task_desc":"Place the toilet paper from the holder into the green bin.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper",
                "PaperTowelRoll"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-Toilet-403/trial_T20190908_060039_542379/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A16184N1RO5OJV_3A4NIXBJ79GZJDO523F4F8WQKKFLMU",
                    "high_descs":[
                        "Walk 1 step to the front, turn left and turn right near the shower to go the sink",
                        "Open the drawer under the sink, pick up a gray bottle in the cabinet and close the drawer. ",
                        "Go to your right, walk straight and turn right to go to the toilet and face the water tank. ",
                        "Put the bottle on top of the water tank. ",
                        "Walk slightly to the right, turn left and go to the bath tub with a bottle on it. ",
                        "Pick up the bottle next to the faucet. ",
                        "Go back to the toilet which is beside the bat tub. ",
                        "Put the bottle next to the previous bottle on the water tank. "
                    ],
                    "task_desc":"Put 2 gray bottles on the water tank of the toilet. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-Toilet-403/trial_T20190908_060213_777780/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3OXV7EAXLH7GE6DO9H4NUQ5NUY436J",
                    "high_descs":[
                        "Turn right and walk up to the right side of the bathroom counter",
                        "Pick up the pump bottle from the right edge of the counter",
                        "Turn around and walk over to the left side of the toilet",
                        "Put the bottle down on the top of the back of the toilet",
                        "Walk around the toilet and over to face the side of the bathtub",
                        "Pick up the pump bottle from the side of the bathtub",
                        "Turn left and walk back over to the left side of the toilet",
                        "Put the bottle down on the top of the back of the toilet"
                    ],
                    "task_desc":"Put the pump bottles on top of the toilet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SprayBottle"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-Cabinet-403/trial_T20190906_161856_202281/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_37FMASSAYF81ALC2QBSI9CT3OWPBIE",
                    "high_descs":[
                        "Turn right and face the right side sink.",
                        "Take the pink soap out of the right cabinet.",
                        "Take a step left and face the sink.",
                        "Wash the soap in the sink and pick it back up.",
                        "Step to the right where you first got the soap.",
                        "Place the soap back in the right cabinet."
                    ],
                    "task_desc":"Put a washed bar of soap in a cabinet.",
                    "votes":[
                        0,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3JZLYQ606HJJR_3D3VGR7TA3W90PB8157L5LWIN3IR30",
                    "high_descs":[
                        "Turn and go to the sink. ",
                        "Open the right side cabinet under the sink.  Pick up the pink sponge that is on the bottom of the cabinet.",
                        "Close the cabinet, and place the sponge in the sink. ",
                        "Turn on the water faucet.  Turn off the water faucet.  Pick up the sponge.",
                        "Open the cabinet on the right side under the sink.",
                        "Put the sponge inside the cabinet and close the door."
                    ],
                    "task_desc":"Using a sponge & returning it to where it belongs. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3IFS6Q0HJL00R7T41XEDZ134VWCSIQ",
                    "high_descs":[
                        "Turn to the second sink on your right. ",
                        "Pull out the bar of soap from the bottom right cabinet under the right sink. ",
                        "Move closer to the sink in front of you. ",
                        "Put the bar of soap in the sink and turn the water on, clean the sink, then turn the water off and remove the soap from the sink.",
                        "Step back from the sink.",
                        "Put the bar of soap back in the bottom, right cabinet, under the sink."
                    ],
                    "task_desc":"Put a wet bar of soap under the cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3QAVNHZ3EPLYHCFG50PZ6H1QQTHLAH",
                    "high_descs":[
                        "Turn around, move to the sink. turn left to face the sink on the right.",
                        "Open the right cabinet under the sink and pick up the soap in there. ",
                        "Bring the soap to the right sink.",
                        "Wet the soap in the sink with water. ",
                        "Bring the wet soap to the right cabinet under the right sink.",
                        "Put the soap in the right cabinet under the sink. "
                    ],
                    "task_desc":"Put wet soap in the right cabinet under the right sink. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3T111IHZ5H7VFR0OIE8VWYZ5Q3VR95",
                    "high_descs":[
                        "Turn to the right and look down to face the cabinet below the right side of the sink.",
                        "Pick up the bar of soap in the right side cabinet under the right side of the sink.",
                        "Step to the left to face the sink.",
                        "Wash the soap in the sink and then pick it back up.",
                        "Step to the right and face the cabinet below the sink.",
                        "Place the bar of soap in it's original spot in the cabinet on the right."
                    ],
                    "task_desc":"To wash a bar of soap and return it to the spot it came from.",
                    "votes":[
                        1,
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3ITXP059PZ0WMIDAJFZDB2I3531SJH",
                    "high_descs":[
                        "Turn to the right and walk to the sink to the right of the sponge and face it.",
                        "Open the bottom right cupboard to take out the towel, then close the cupboard door.",
                        "Face the sink in front of you.",
                        "Put the towel in the sink and wash it with water, then take it out of the sink.",
                        "Turn around and step towards the toilet, then turn around again and face the sink.",
                        "Put the towel in the bottom right cupboard and close the cupboard door."
                    ],
                    "task_desc":"Replace the dirty towel in the cupboard with a clean one.",
                    "votes":[
                        1,
                        1,
                        0,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "DishSponge",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-Cabinet-403/trial_T20190906_161837_412072/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A22ON3MIIG0IJA_3ATTHHXXWD58NOF3V7K0Y9KV74CXII",
                    "high_descs":[
                        "Take a step forward and turn left to face the counter.",
                        "Pick up the bar of soap from between the two sinks.",
                        "Go to the front of the sink on the right.",
                        "Put the soap in the sink, rinse it off, and then pick it up.",
                        "Turn around and take a step towards the toilet. Turn back around.",
                        "Open the bottom right cupboard and put the soap inside. Close the cupboard."
                    ],
                    "task_desc":"Put a clean bar of soap in the bottom right cupboard.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3LYA37P8IT4SGG2QQEDUMS8GG16KBS",
                    "high_descs":[
                        "Walk to the bathroom counter on your left",
                        "Pick up the pink soap bar from the counter",
                        "Turn and approach the right most sink",
                        "Wet the soap bar in the sink with water",
                        "Look down at the lower right cabinet",
                        "Open the lower right cabinet and put the soap bar into it"
                    ],
                    "task_desc":"Put the wet soap bar into the lower right cabinet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3QRYMNZ7F1YTK8HANDWVEEV7JC6NT8",
                    "high_descs":[
                        "turn to face the bathroom sinks",
                        "pick up the pink soap bar on the counter between the two sinks",
                        "walk to face the right most sink",
                        "put soap into sink basin, wash soap, pick up soap",
                        "back up slightly to face the cabinets underneath the right most sink",
                        "open the right cabinet door under the sink, put soap to the left of the other soap there, close the door"
                    ],
                    "task_desc":"put a washed soap bar in a cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3M68NM076KO8X8YQK75JCO82XQJR6X",
                    "high_descs":[
                        "Turn left and walk to the sinks.",
                        "Pick up the soap of f the counter.",
                        "Go to the sink on the right.",
                        "Wash the soap in the sink.",
                        "Open the rightmost cabinet under the sink.",
                        "Place the soap next to the other bar of soap."
                    ],
                    "task_desc":"Place a washed bar of soap in a cabinet.",
                    "votes":[
                        1,
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"ADXRJFEHIDXRE_3I3WADAZ9TL9HR6WNWEAQNPYTJK5O9",
                    "high_descs":[
                        "Walk two steps forward and turn left towards the counter with the sinks.",
                        "Pick up the pink bar of soap on the counter.",
                        "Turn to the right, walk two steps forward and face the sink.",
                        "Put the soap in the sink, turn the water on then turn it off and pick the soap back up.",
                        "Turn around, walk two steps forward and turn around again.",
                        "Open the drawer on the right and put the soap next to the left of the other soap."
                    ],
                    "task_desc":"Wash the pink bar of soap in the sink and put it in the drawer.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ACSS93E03ZUGX_3X08E93BHYZFBP06SJ2L1TH74E6666",
                    "high_descs":[
                        "Turn to the left to face the counter in between the sinks.",
                        "Pick up the pink soap from the counter.",
                        "Move to the right to face the sink to the right.",
                        "Place the soap in the sink, turn on the water, turn off the water and pick up the soap.",
                        "Look slightly lower to the cabinet below the sink.",
                        "Open the right cabinet door, place the soap inside, and close the cabinet door."
                    ],
                    "task_desc":"Move the soap from in between the sink to the cabinet under the sink to the right.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-Cabinet-403/trial_T20190906_161918_796066/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_31Z0PCVWUNW4HNPN76F6IH9HJYE7TW",
                    "high_descs":[
                        "Turn to face the counter to your left.",
                        "Grab the soap bar from between the sinks.",
                        "Take the soap to the sink on the right.",
                        "Rinse the soap off in the sink.",
                        "Look at the under-sink cabinets.",
                        "Put the soap bar into the lower right cabinet."
                    ],
                    "task_desc":"Put a rinsed bar of soap away in a bathroom cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_33C7UALJVOF78HIXFSN2QBMH2YK810",
                    "high_descs":[
                        "Turn to the left and move to the counter area between the two sinks.",
                        "Take the pink bar of soap to the rear of the dirty cloth and in front of the mirror.",
                        "Turn right and move to and face the sink closest to the bathroom door.",
                        "Place the bar of soap in the sink, rinse it with water from the faucet, then pick up the bar of soap.",
                        "Turn around move towards the toilet, then turn around and face the vanity cabinet underneath the right sink.",
                        "Open the right cabinet door and place the bar of soap in the vanity."
                    ],
                    "task_desc":"Place a rinsed bar of soap in the vanity.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3QECW5O0KKIPUJB4JD09KXVLSSR5TN",
                    "high_descs":[
                        "Turn left to face the sink counter.",
                        "Pick up the bar soap on the the counter.",
                        "Take a step to the right to face the right sink.",
                        "Place the bar soap in the sink, wash it, and pick it back up.",
                        "Take a step back to find the cabinets below the sink.",
                        "Open the right cabinet and place the soap inside."
                    ],
                    "task_desc":"Place the washed bar soap from the sink counter into the cabinet below the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3300DTYQT5YCYMC5DAZHJMQAI3YQEB",
                    "high_descs":[
                        "Walk forward a small amount and then turn left to face the sink.",
                        "Pick up the pink bar of soap to the left of the right hand sink.",
                        "Move to the center of the right hand sink and face it.",
                        "Put the soap in the sink and fill the sink with water then empty the water and retrieve the soap.",
                        "Back up a little so you can open the cabinet all the way to the right of the sink cabinet.",
                        "Open the cabinet and place the soap in it before closing it again."
                    ],
                    "task_desc":"Wet a bar of soap and put it in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARL7HOWLEHNOP_3LYA37P8IT4SGG2QQEDUMS8GG0EKBY",
                    "high_descs":[
                        "Walk forward and turn left to face the counter.",
                        "Grab the bar of soap.",
                        "Turn right, walk forward, and turn left to face the second sink.",
                        "Place the soap in the sink, rinse it off, and pick it back up.",
                        "Take a step back and open the cabinet underneath the sink.",
                        "Place the soap in the cabinet."
                    ],
                    "task_desc":"Place clean soap in the cabinet under the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3PW9OPU9PT1WM2G8ZBE1GK9DDO421E",
                    "high_descs":[
                        "Take a step forward, turn left, and face the rightmost sink.",
                        "Pick up the pink soap to the left of the sink.",
                        "Take a step to the right and face the sink.",
                        "Wash the soap in the sink.",
                        "Take a step right.",
                        "Put the soap in the right cabinet."
                    ],
                    "task_desc":"Put washed soap in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-403/trial_T20190909_050123_862374/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_32Z9ZLUT1OBTI9CPK640G6CQSIAHOE",
                    "high_descs":[
                        "Turn around and move forward, then turn left to go toward the shower, then turn left to face the tub.",
                        "Pick up the rag inside of the tub.",
                        "Turn around and go straight ahead to the sink.",
                        "Clean the rag inside of the sink.",
                        "Turn around and go forward to the tub.",
                        "Put the rag in the tub."
                    ],
                    "task_desc":"Put a clean rag in the tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3RKNTXVS3PPA4TUTVGFZLMJHYWFA4H",
                    "high_descs":[
                        "Turn right and walk to the tub, turning left to face it.",
                        "Pick up the dirty white rag in the tub.",
                        "Turn around and walk to the sink.",
                        "Rinse the rag in the sink.",
                        "Turn around and walk back to the tub.",
                        "Place the rag in the tub."
                    ],
                    "task_desc":"Place a clean rag in a tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3JWH6J9I9V419B9RJZURF69N7VYBNB",
                    "high_descs":[
                        "Turn right, walk forward across the room to the shower, then turn left towards the bath tub.",
                        "Pick up the white cloth from the bath tub basin.",
                        "Turn around and walk to the sink on the left.",
                        "Put the cloth in the sink, rinse it off, and take it back out.",
                        "Turn around and walk back to the bath tub.",
                        "Put the cloth back in the bath tub basin."
                    ],
                    "task_desc":"Put a cleaned cloth in a bath tub.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-403/trial_T20190909_050218_727238/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3CP1TO84PWS3V93PW65UKW6XM4I257",
                    "high_descs":[
                        "Turn left, walk forward to the shower, then turn left towards the bath tub.",
                        "Pick up the cloth on the right from the bath tub basin.",
                        "Turn around and walk forward to the sink on the left.",
                        "Put the cloth in the sink, rinse it off, and take it back out of the sink.",
                        "Turn around and walk back to the bath tub.",
                        "Put the cloth back in the bath tub, in the center of the basin."
                    ],
                    "task_desc":"Put a cleaned cloth in a bath tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3QFUFYSY91650KB16W1RZNU8VCSF4Z",
                    "high_descs":[
                        "Turn left and walk to the tub.",
                        "Pick up the dirty white rag that's on the right side.",
                        "Turn around and walk to the sink.",
                        "Rinse the rag in the sink.",
                        "Turn around and walk back to the tub.",
                        "Place the rag in the tub, situated behind the sponge."
                    ],
                    "task_desc":"Place a clean rag in a tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3V0Z7YWSI1RKT3I42XN7OU0WZSH2VB",
                    "high_descs":[
                        "walk to face bath tub basin",
                        "pick up dirty rag on right side of tub basin",
                        "walk to face sink",
                        "wash rag in sink, pick up rag from sink",
                        "turn to face tub basin",
                        "put rag in tub basin"
                    ],
                    "task_desc":"put washed rag in bath tub basin",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-403/trial_T20190909_050152_741959/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_34S6N1K2ZYALCO9S7EO8OP8WXDDLH9",
                    "high_descs":[
                        "Turn right and veer right to the bath tub.",
                        "Pick up the dirty white rag in the tub.",
                        "Turn around and walk to the sink.",
                        "Wash the rag in the sink.",
                        "Turn around and walk back to the tub.",
                        "Place the rag back in the tub."
                    ],
                    "task_desc":"Place a clean rag in a tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3TY7ZAOG5IBZHILEO65M3XW0MW90KM",
                    "high_descs":[
                        "Turn around and go to the shower ahead, then turn left to face the tub.",
                        "Pick up the rag from in the tub.",
                        "Turn around and go to the sink ahead.",
                        "Clean the rag in the sink.",
                        "Turn around and go forward to the tub.",
                        "Put the rag in the tub."
                    ],
                    "task_desc":"Put a clean rag in the tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3VELCLL3GNAO8LEIJEIP1PN5JSL1FB",
                    "high_descs":[
                        "Turn around and then turn left to face the bath tub.",
                        "Pick up cloth from inside the bath tub.",
                        "Carry the cloth and turn around. Move forward to the sink.",
                        "Place the cloth in the sink and turn on the water. Turn off the water and pick up the cloth.",
                        "Carry the cloth and turn around to the bath tub.",
                        "Place the cloth inside the bath tub."
                    ],
                    "task_desc":"Clean a cloth and place it in the bath tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-403/trial_T20190909_080111_999655/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_354P56DE9NUBNCY6EEZX9YXXB4N7S5",
                    "high_descs":[
                        "Turn left and walk up to the shower, then turn left again and walk over to the tub.",
                        "Pick up the bar of soap out of the tub.",
                        "Turn left and walk towards the door, then hang a left and walk over to the rightmost sink.",
                        "Wash the bar of soap in the sink and then pick it back up.",
                        "Walk over to the small green bin on the ground to the right of the counter in front of you.",
                        "Put the clean bar of soap in the small green bin."
                    ],
                    "task_desc":"Put a clean bar of soap in a small green bin.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3SNLUL3WO7EQHAFC7DV774XMRLALU5",
                    "high_descs":[
                        "Turn left and walk to the shower then turn left and walk to the tub.",
                        "Pick up the bar of soap that's in front of you on the edge of the tub. ",
                        "Turn around and walk to the right sink.",
                        "Get the soap wet in the sink and then pick it back up and shut off the water.",
                        "Take a step to your right to face the green garbage to the right of the sink.",
                        "Put the soap in the garbage."
                    ],
                    "task_desc":"Put a wet bar of soap in the garbage.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3Z4AIRP3C9458753J8OB7WNCNXQX17",
                    "high_descs":[
                        "Turn and walk to the tub. ",
                        "Pick up the bar of soap on the edge of the tub. ",
                        "Turn and walk to the sink on the right side. ",
                        "Put the bar of soap inside of the sink, rinse off the soap, pick up the soap. ",
                        "Walk to the green bin on the right side of the counter with the sinks. ",
                        "Put the soap in the green bin. "
                    ],
                    "task_desc":"To rinse off a bar of soap and put it in the green bin. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "DishSponge",
                "SoapBar",
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-403/trial_T20190909_080140_320296/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3FTYUGLFSXCQYJ15TVPBGFX1JWY5DC",
                    "high_descs":[
                        "move forwards to the right side of the bath tub up ahead",
                        "grab a bar of soap off of the ledge of the bath tub there",
                        "turn around and walk over to the right side bathroom sink",
                        "place the soap inside of the sink, rinse it off, and then pick it back up",
                        "move to the right side end of the bathroom sink cabinet, and turn to face the garbage bin at the end there",
                        "place the bar of soap down inside of the garbage bin"
                    ],
                    "task_desc":"place a cleaned bar of soap inside of the garbage bin",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3GM6G9ZBKQOVNFI87K6C2LQ98DGTMD",
                    "high_descs":[
                        "Walk ahead and around they toilet to the side of the tub.",
                        "Pick up the soap on the left.",
                        "Turn around and walk to the rightmost sink.",
                        "Wash the soap in the sink.",
                        "Take a step right.",
                        "Place the soap in the green bin."
                    ],
                    "task_desc":"Place a rinsed bar of soap in a bin.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3VNXK88KKF9VTN33N62MYH8A5ZO9V9",
                    "high_descs":[
                        "Take a step to your right then walk to the shower then turn left.",
                        "Pick up the bar of pink soap that's in front of you to the left of another bar of soap.",
                        "Turn around and walk to the sink that's on the right.",
                        "Get the soap wet in the sink and then pick it back up and shut off the water.",
                        "Take a step to your right to face the green garbage.",
                        "Put the bar of soap in the garbage."
                    ],
                    "task_desc":"Put a wet bar of soap in the garbage.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cloth",
                "SprayBottle",
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-403/trial_T20190909_080201_693388/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_323Q6SJS8L7ZCWZWL3LATC3C0HAFHH",
                    "high_descs":[
                        "walk to face bath tub",
                        "pick up pink bar soap from tub ledge",
                        "turn around to face right sink",
                        "wash soap in sink, pick up soap from sink",
                        "move to the right to face garbage can next to sink",
                        "put soap in garbage can"
                    ],
                    "task_desc":"put washed soap bar into garbage can",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3MTMREQS4Y9MDVDD5MLIGE28IPEWAP",
                    "high_descs":[
                        "Turn around and walk to the shower then turn left and walk to the tub.",
                        "Pick up the soap that's in front of you.",
                        "Turn around and walk to the right sink.",
                        "Get the soap wet in the sink and then pick it back up and shut off the water.",
                        "Take a step to your right to face the green garbage.",
                        "Put the bar of soap in the garbage."
                    ],
                    "task_desc":"Put a wet bar of soap in the garbage.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_39KFRKBFIQMF442EU68O267TIELOYI",
                    "high_descs":[
                        "Walk over to face the tub. ",
                        "Pick up the bar of soap from the edge of the tub. ",
                        "Walk to the sink on the right side. ",
                        "Rinse the soap off with water, pick up the soap from the sink. ",
                        "Walk to the green bin to the right of the sink. ",
                        "Put the soap inside of the green bin in front of the roll of toilet paper. "
                    ],
                    "task_desc":"To rinse off a bar of soap and put it in the green bin. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge",
                "SoapBar",
                "Cloth"
            ]
        },
        "tests_seen/trial_T20190908_042226_196941/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "walk over to the front of the sink",
                        "pick up the spray bottle from the counter",
                        "take the spray bottle over to the toilet",
                        "put the bottle on the back of the toilet next to the lotion"
                    ],
                    "task_desc":"move the spray bottle from the sink to the back of the toilet"
                },
                {
                    "high_descs":[
                        "Turn left, walk a few steps before turning left again, walk past the tub, hanging a right once you reach the shower, then forward until you reach the bathroom counter. ",
                        "Pick up the spray bottle that is on the counter.",
                        "Turn right, walk forward until you reach the end of the bathroom counter, then turn right and walk forward to the toilet. ",
                        "Place the spray bottle between the lotion bottle and empty toilet paper roll on the back of the toilet."
                    ],
                    "task_desc":"Move a spray bottle from the bathroom counter to the back of the toilet. "
                },
                {
                    "high_descs":[
                        "move to the sink to the right of the shower",
                        "pick up a bottle from the counter",
                        "move to the toilet to the left of the shower",
                        "put the bottle on the toilet"
                    ],
                    "task_desc":"Put a bottle on the back of the toilet."
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "ToiletPaper"
            ]
        }
    }
}