{
    "scene_name":"FloorPlan313",
    "trials":{
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Desk-313/trial_T20190918_202154_255224/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3EG49X351X30FT60PE0S2SETV1G6XA",
                    "high_descs":[
                        "Turn to the left and walk over the the dresser to the right of the book shelf.",
                        "Pick up the pencil on the dresser.",
                        "Step to the left and look up to face the top of the book shelf.",
                        "Place the pencil in the cup on the center of the top of the book shelf.",
                        "Pick up the cup with a pencil in it on the top of the book shelf.",
                        "Turn right and walk forward to face the computer desk.",
                        "Place the cup with a pencil in it on the computer desk."
                    ],
                    "task_desc":"To put a pencil in a cup as well as move them to the computer desk.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3FDJT1UU77ZYCP7FLCBYKSSR3XN5K1",
                    "high_descs":[
                        "turn around and walk over to the book shelf on the right side of the room",
                        "grab the pencil off of the right side of the book shelf",
                        "turn left and walk over to the middle of the book shelf",
                        "place the pencil inside a cup on top of the book shelf",
                        "pick up the cup off of the top of the bookshelf",
                        "turn right and walk over to the desk",
                        "place the cup down on top of the desk"
                    ],
                    "task_desc":"place a cup with a pencil in it on top of the desk",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_37U1UTWH9YD3MB3C9URYXOOW0R18R6",
                    "high_descs":[
                        "Turn around and then turn right to locate the bookcase.",
                        "Pick up the pencil from on top of the small lower bookcase.",
                        "Carry the pencil and take a few steps left.",
                        "Place the pencil in the cup on top of the tall bookcase.",
                        "Pick up the cup from the top of the bookcase.",
                        "Hold the cup and turn to the right to face the desk.",
                        "Place the cup on the desk, in front of the chair."
                    ],
                    "task_desc":"Move a cup and pencil to a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Desk-313/trial_T20190908_115034_938560/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3K772S5NPB276IZ0QS14BUICO8QEHD",
                    "high_descs":[
                        "Turn around and face the desk on the right. ",
                        "Pick up the pencil from the center of the desk.",
                        "Carry the pencil and turn to the left.",
                        "Place the pencil in the cup on the back of the short table.",
                        "Pick up the cup from the table.",
                        "Carry the cup and turn to the right.",
                        "Place the cup and pencil on the desk, in the center."
                    ],
                    "task_desc":"Move a cup and pencil to a desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3PJUZCGDJ97XIB7QFDRC63O2UR6892",
                    "high_descs":[
                        "Walk to the back of the chair for the computer desk.",
                        "Grab the pen from the desk.",
                        "Locate the nightstand to your left.",
                        "Place the pencil in the coffee mug.",
                        "Grab the mug from the night stand.",
                        "Turn around to the computer desk on your right.",
                        "Place the mug in front of the chair on the desk."
                    ],
                    "task_desc":"Put a pencil in a mug to place on a desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1QCXSZJ3ZLCNY_3CPLWGV3MRQILIUULFGVO0EXJNGN9I",
                    "high_descs":[
                        "Turn around and cross the room. Turn to the desk on your right.",
                        "Pick up the pencil from the desk.",
                        "Turn to your left.",
                        "Place the pencil in the cup on the entertainment center in front of you.",
                        "Pick up the cup with the pencil in it.",
                        "Turn to the right towards the desk.",
                        "Place the cup holding the pencil on the desk."
                    ],
                    "task_desc":"Place a pencil into a cup and place it on the desk.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Desk-313/trial_T20190908_115056_116284/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3L4PIM1GQW7I1HUUMYPSW1CYTTEYRU",
                    "high_descs":[
                        "walk forward then turn right head to the book shelf",
                        "Pick up the pencil on top of the book shelf",
                        "Turn right walk forward then turn left on the drawer",
                        "Put the pencil in the mug beside the cd at the drawer",
                        "Pick up the mug with pencil on the drawer",
                        "Turn right and face the desk ",
                        "Put the mug with pencil on the desk"
                    ],
                    "task_desc":"Put the mug with pencil on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3LYA37P8ITE015OOMM2BNESJDR3BKY",
                    "high_descs":[
                        "Walk to the bookshelf on your right.",
                        "Grab a pencil from the bookshelf.",
                        "Walk to the dresser on the right of the bookshelf.",
                        "Place a pencil on the top right mug.",
                        "Grab the mug from the dresser.",
                        "Turn to the right facing the desk.",
                        "Place the mug on the desk."
                    ],
                    "task_desc":"Put a pencil in a mug and place it on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A12HZGOZQD5YK7_3QRYMNZ7F1815X38JLLCF0F9DUYNTX",
                    "high_descs":[
                        "Turn right and go to the bookshelf.",
                        "Pick up the pencil from on top of the bookshelf.",
                        "Turn right and then turn left to the table.",
                        "Put the pencil in the middle cup on the table.",
                        "Pick up the middle cup on the table.",
                        "Turn right to the desk.",
                        "Put the cup on the desk to the left of the pen."
                    ],
                    "task_desc":"Put a pencil inside a cup on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Desk"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-SideTable-313/trial_T20190908_122731_772005/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3E4GGUZ1TBI6DSOS3T90MLPFJN22K3",
                    "high_descs":[
                        "Turn around and walk to the chair.",
                        "Pick up the pencil that's to the right of another pencil.",
                        "Put the pencil in the coffee mug that's to the left of another mug.",
                        "Pick up the mug with the pencil in it.",
                        "Turn right and take a step then turn right and take a step then turn right.",
                        "Put the mug to the right of the credit card."
                    ],
                    "task_desc":"Put a mug with a pencil in it on the table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3RWE2M8QWK10PO6HLJX2VPD4GKK0NJ",
                    "high_descs":[
                        "Turn around and go forward and face the desk.",
                        "Pick up the pencil on the right, closest to the mug on the left.",
                        "Put the pencil in the mug on the left.",
                        "Pick the mug up from the desk.",
                        "Turn around to face the small shelves to the right of the larger shelves.",
                        "Put the mug on the top shelf of the shorter shelves."
                    ],
                    "task_desc":"Put a mug with a pencil in it on a shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3UOUJI6MTG5LH4W1LWYVIYS9YMTUXT",
                    "high_descs":[
                        "Go to the desk",
                        "Pick up a pencil",
                        "Put the pencil in a mug",
                        "Pick up the mug",
                        "Turn around to the small table",
                        "Put the mug on top of the table"
                    ],
                    "task_desc":"Put a mug with a pencil on it on a tabletop",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-SideTable-313/trial_T20190908_122701_644769/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3IOEN3P9SAASPSL7ILFL7JASQM561M",
                    "high_descs":[
                        "Turn right walk forward then face the cabinet on your left",
                        "Pickup the pencil on the cabinet",
                        "Turn right move closely then face the desk on your left ",
                        "Put the pencil in the mug",
                        "Pick up the mug on the desk",
                        " Turn left then move forward then face the cabinet on your right",
                        "Put the mug with pencil on the left side of the cabinet"
                    ],
                    "task_desc":"Put the mug with pencil on the cabinet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3ZSY5X72N02673QSGBGUUAEWFKVROU",
                    "high_descs":[
                        "Turn right and go forward, then turn left to face the shelf next to the book case.",
                        "Pick up the pencil on top of the shelf.",
                        "Turn around, go forward, then turn left at the desk.",
                        "Put the pencil in the mug, on the desk.",
                        "Pick up the mug from the desk.",
                        "Turn around, move forward, then turn right to face the shelf adjacent to the book case.",
                        "Put the mug on top of the shelf."
                    ],
                    "task_desc":"Put a mug with a pencil in it on the shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_33IZTU6J84S52R4XWR3V3XALDQWXS6",
                    "high_descs":[
                        "move to the right to face the short table to the right of the book shelf",
                        "pick up the grey pencil from the table",
                        "turn right to face the right side of the desk",
                        "put the pencil into the white mug on the desk",
                        "pick up the white mug from the desk",
                        "turn left to face the short table to the right of the book shelf",
                        "put the mug on the left side of the table"
                    ],
                    "task_desc":"put a mug and a pencil on a small table",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Shelf-313/trial_T20190908_071144_458910/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_32RIADZISVL6J0UPG8C950TLQLQ4SG",
                    "high_descs":[
                        "Turn around and go to the desk. ",
                        "Pick up the keys in front of the lamp, on the desk. ",
                        "Turn to the small, black shelf to your left. ",
                        "Place the keys on the left, inner shelf of the small, black shelf. "
                    ],
                    "task_desc":"Put the keys in the small shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A002160837SWJFPIAI7L7_3I02618YA3N8N68C3XZXNZM42E8PU9",
                    "high_descs":[
                        "Turn around and walk to the desk.",
                        "Grab the keys from the desk.",
                        "Turn right 3 times and face the small dresser.",
                        "Place the keys on the second shelf of the small dresser."
                    ],
                    "task_desc":"Place some keys on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3Z2R0DQ0JKVV63AKBZ9GN4S85GDE2L",
                    "high_descs":[
                        "Turn to the right and head to the bookshelf, at the bookshelf take a right and walk to the desk",
                        "Pick up the keys that are laying on the desk by the lamp",
                        "Turn around and take a step forward, turn to the right and face the night stand to the right of the shelf, then take a step backwards",
                        "Place the keys on the second shelf of the night stand, to the left of the white pencils"
                    ],
                    "task_desc":"Place keys on a nightstand ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Shelf-313/trial_T20190908_071031_691259/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_38JBBYETQRR59HP7FDS4GJP6PU34E1",
                    "high_descs":[
                        "Move to the right and face the small cabinet next to the book shelves.",
                        "Pick the keys up from the small cabinet.",
                        "Move back and to the left but stay in front of the small cabinet.",
                        "Put the keys on the lower shelf of the cabinet."
                    ],
                    "task_desc":"Put keys on a shelf of a cabinet.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALKQPW0O9C98N_3SEPORI8WQGIM1WKK1G8EWCO5AAAZQ",
                    "high_descs":[
                        "Turn right to the cabinet by the bookshelf",
                        "Pick up the keys closer to the edge of the cabinet",
                        "Move to the left edge of the cabinet",
                        "Place the keys on the lower shelf to the left of the tissue box"
                    ],
                    "task_desc":"Move the keys to a lower shelf of the cabinet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_36PW28KO42DKB65OOE2VTMB6H42AEL",
                    "high_descs":[
                        "turn right, take one step, turn left, walk to small table",
                        "take the keys that are on the shelf",
                        "take a couple steps to the left",
                        "put keys on bottom shelf of small table"
                    ],
                    "task_desc":"move keys to lower shelf",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Shelf-313/trial_T20190908_071051_432683/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_34S6N1K2ZY0DRZNUB6ZRN3OU3WOLHP",
                    "high_descs":[
                        "Turn to your left and go across the room, to the small, black shelf between the large book shelf and the lamp. ",
                        "Pick up the keys on the back, right corner of the small, black shelf. ",
                        "Move over to the left side of the small, black shelf. ",
                        "Place the keys on the left side of the shelf, beneath the top of the small, black shelf. "
                    ],
                    "task_desc":"Put the keys under the top of the shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_358UUM7WR2KR18CV3HABI28ZVLKR7M",
                    "high_descs":[
                        "turn around, go to small cabinet to the right of bookcase",
                        "pick up keys from behind clock on the right side of small black cabinet",
                        "go to left side of small black cabinet to the right of bookcase",
                        "place keys on shelf below red credit card on black cabinet"
                    ],
                    "task_desc":"place keys on left side of shelf of black cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALKQPW0O9C98N_37FMASSAYF81ALC2QBSI9CT4RF1IB4",
                    "high_descs":[
                        "Turn left and go to the cabinet to the right of the bookshelf",
                        "Pick up the keys on the top right of the cabinet",
                        "Move to the left edge of the cabinet",
                        "Place the keys on the lower shelf to the left of the pencils"
                    ],
                    "task_desc":"Move the keys from the top of the cabinet to a lower shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "Book",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Shelf-313/trial_T20190907_185153_487214/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_3M81GAB8A30ERJ0L3JXRIEKQI0KQB3",
                    "high_descs":[
                        "Turn around to the shelf by the book shelf",
                        "Grab the pencil in the shelf",
                        "Put the pencil in the cup on top of the shelf",
                        "Grab the cup with the pencil in it",
                        "Walk to the left a little ",
                        "put the cup with the pencil in the shelf"
                    ],
                    "task_desc":"put the pencil in the cup, put it in the shelf",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3NPI0JQDARMTNTTN3S9NI302JCDTPM",
                    "high_descs":[
                        "Turn around and walk to the short black desk across the room next to the books.",
                        "Pick up the pencil from the right edge of the shelf under the top of the desk.",
                        "Put the pencil inside the white mug on top of the desk.",
                        "Pick up the mug with the pencil inside of it from on top of the desk.",
                        "Turn around, hang a right at the edge of the black dresser, walk towards the door and turn right to face the left side of the black desk.",
                        "Place the mug with the pencil inside on the shelf under the desk to the left of the CD."
                    ],
                    "task_desc":"Place a mug with a pencil on a shelf.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3M1CVSFP63M989VTX5XVN30KZB5AQJ",
                    "high_descs":[
                        "Turn around, go straight to the stand with the mug on it.",
                        "Take the pen from the shelf below the mug.",
                        "Put the pen in the mug that is on top of the stand.",
                        "Take the mug from the stand.",
                        "Go left slightly while still facing towards the stand.",
                        "Put the mug on the shelf where the pen was to the left of the CD."
                    ],
                    "task_desc":"Put a mug on a shelf of a stand.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3L6L49WXW3E5DYWE4CZ1CPJTCKY45W",
                    "high_descs":[
                        "Turn around and walk to the small table with the coffee mug on it, to the right of the tall book shelf. ",
                        "Pick up the pencil on the edge of the shelf, under the top of the black table.",
                        "Place the pencil in the coffee mug, to the right of the keys, on the top of the black table.",
                        "Pick up the coffee mug with the pencil inside it. ",
                        "Move over to the left so that your are standing in front of the left most corner of the small, black table.",
                        "Place the coffee mug with the pencil inside, to the left of the CD, on the shelf directly under the top of the table."
                    ],
                    "task_desc":"Place a coffee cup containing a pencil on the shelf of a small table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Shelf"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Shelf-313/trial_T20190907_205839_093009/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_38BQUHLA9ZH7PYR2FVVW7P0KFTKOMM",
                    "high_descs":[
                        "Turn around and stand in front of the book shelves.",
                        "Pick a pencil up from the book shelves.",
                        "Turn and walk towards the desk with the computer and stand in front of it.",
                        "Put the pencil in the white cup.",
                        "Pick up the cup from the counter.",
                        "Turn around and stand in front of the shorter shelves on the right.",
                        "Put the cup on the middle shelf on the left."
                    ],
                    "task_desc":"Put a cup with a pencil on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3FE2ERCCZ0PDA1OF7BNOOTUFK1YOPR",
                    "high_descs":[
                        "Move forward then turn left again to face the book shelf.",
                        "Take the pencil from the top of the book shelf.",
                        "Turn around, then move forward, then turn left to go to the desk.",
                        "Place the pencil in the mug on the desk.",
                        "Pick up the mug on the desk.",
                        "Turn around, move forward, then turn right to approach the shelf to the right of the dresser.",
                        "Place the mug on the second shelf, toward the left."
                    ],
                    "task_desc":"Put a mug with a pencil in it on the shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3V5Q80FXI08SW5UNMFSK4DOBEWT23Y",
                    "high_descs":[
                        "Turn to face the bookshelf.",
                        "Take the pencil off the top of the bookshelf next to the plant.",
                        "Walk across the room to the desk.",
                        "Set the pencil down in the coffee cup.",
                        "Pick up the cup with the pencil in it.",
                        "Walk across the room to the cabinet next to the bookshelf with the tissues on it.",
                        "Set the cup with the pencil in it down next to the tissues."
                    ],
                    "task_desc":"Put a coffee cup with a pencil in it next to the tissues on the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "TissueBox"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Shelf-313/trial_T20190907_150131_101097/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3570Y55XZS0JR2ZIAF6ZWBEPXO9GYX",
                    "high_descs":[
                        "Turn left to go to the shelf, to the right of the book case.",
                        "Pick up the pencil on the lower shelf.",
                        "Turn right, to face the desk.",
                        "Put the pencil in the mug that is nearest to the chair.",
                        "Pick up the mug with the pencil in it.",
                        "Turn around to return to the shelf, to the right of the book case.",
                        "Place the mug on the bottom shelf, to the left."
                    ],
                    "task_desc":"Put a mug with a pencil in it on the shelf.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3GU1KF0O4LITR7Z636I2I9UGD69BPC",
                    "high_descs":[
                        "Turn left and go to the low cabinet to the right of the bookshelf.",
                        "Pick up the pencil from the opening in the cabinet.",
                        "Turn right to face the desk.",
                        "Drop the pencil, sharpened end up, into the mug nearest the desk chair.",
                        "Pick up the mug with the pencil in it.",
                        "Return to the low cabinet to the right of the bookshelf.",
                        "Put the mug holding the pencil into the left end of the opening in the cabinet, near the edge."
                    ],
                    "task_desc":"Put a mug holding a pencil into an open cabinet.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_34V1S5K3GVI2T824QQ5XL389U9D967",
                    "high_descs":[
                        "Turn to your left and move towards the drawer beside the book shelf",
                        "Pick up the pencil on the drawer",
                        "Turn to your right face the desk",
                        "Put the pencil in the mug closer to the lamp",
                        "Pick up the mug with pencil ",
                        "Turn around to your right and face the drawer beside the book shelf",
                        "Put the mug with pencil on drawer"
                    ],
                    "task_desc":"Put the mug with pencil on the drawer",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3NVC2EB65TGIXQNUF0ZFDHPGTSD3Y3",
                    "high_descs":[
                        "Turn to your left and walk to the small table",
                        "Pick up a pencil off of the table",
                        "Turn directly to your right",
                        "Put the pencil in the mug that is sitting on the desk",
                        "Pick up the mug with the pencil in it",
                        "Head back to the small table you originally got the pencil from",
                        "Put the mug with the pencil on it on the shelf"
                    ],
                    "task_desc":"Put a mug with the pencil on it on a shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3ZAZR5XV04Z6FGTI4FCZKR2C5ZUZCO",
                    "high_descs":[
                        "Turn to your left and walk to the small black end table that is between the tall book shelf and the desk. ",
                        "Pick up the pencil that is on the shelf, below the top of the black end table.",
                        "Turn to your right so that you are facing the desk. ",
                        "Place the pencil in the coffee cup that is directly in front of the office chair. ",
                        "Pick up the coffee cup on the desk, containing the pencil. ",
                        "Turn back to your left so that you are facing the end table again. ",
                        "Place the coffee cup containing the pencil, on the shelf of the end table, between the top and the base. "
                    ],
                    "task_desc":"Place a coffee cup containing a pencil on the shelf of the end table, to the left of the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Bed-313/trial_T20190907_092230_655414/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_34S9DKFK766P1UG4XJJUMVNMYS5YNH",
                    "high_descs":[
                        "Turn to the right and walk across the room to the desk. ",
                        "Take the cell phone that is on the desk next to the textbook. ",
                        "Turn to the right and walk across the room to the bed. ",
                        "Place the cell phone on the bed near the laptops. "
                    ],
                    "task_desc":"To place the cell phone on the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3TGOYF99103LFBG8KJYRX593A0UUUE",
                    "high_descs":[
                        "Go right and face the right side of the desk.",
                        "Pick up the phone from the desk.",
                        "Turn around and face the bed in the middle.",
                        "Put the phone down on the bed."
                    ],
                    "task_desc":"Put a phone on a bed near a computer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3XC1O3LBOV33W8EPB0GG1MRIEVLLTB",
                    "high_descs":[
                        "Walk straight to the shelf, turn right to face the table.",
                        "Grab the phone from the table.",
                        "Turn around, walk toward the door, turn left to face and walk toward the bed.",
                        "Place the phone on the bed."
                    ],
                    "task_desc":"Place a phone on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Bed"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Bed-313/trial_T20190907_092308_442494/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3C2NJ6JBKDYZ09NX4YCZDRMHJL4N2Z",
                    "high_descs":[
                        "Move to the dark wooden desk where the desk chair is",
                        "Pick up the phone that is on top of the desk closest to the chair",
                        "Carry the phone to the bed with the blue blanket on top of it",
                        "Place the phone between the two laptops on top of the bed"
                    ],
                    "task_desc":"Move a phone from the desk to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3FTF2T8WLUZ0NNHAH8I1JX7MI3J9W5",
                    "high_descs":[
                        "turn to the left and turn to the left again and go forward to the book case and turn to the right and go forward to the desk",
                        "pick up the smart phone from the desk",
                        "turn around to the opposite direction  and step forward and turn to the left and go forward to the bed",
                        "place the smart phone on the bed"
                    ],
                    "task_desc":"place a smart phone on the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2CT57W84KXX25_3JC6VJ2SAE0KFNCVDD9SPS5T4OVA52",
                    "high_descs":[
                        "Turn around, walk to the bookcase, turn right, walk to the desk. ",
                        "Pick up the phone in front of the chair. ",
                        "Walk to the bed. ",
                        "Put the phone on the bed in front of the smaller computer. "
                    ],
                    "task_desc":"Put the phone on the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3JCG6DTRV671VP2AM1UHD3FP48LQQV",
                    "high_descs":[
                        "turn around, walk towards the book shelf, turn right, walk forward to the desk",
                        "pick up the phone that is on the desk",
                        "turn around, walk towards the door, turn left, walk towards the bed",
                        "put the phone on to the bed"
                    ],
                    "task_desc":"move the phone from the desk to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AUTYWXILTACCR_3S4AW7T80EZJFNZZWZF8TEFQYAM4L8",
                    "high_descs":[
                        "Turn around and walk to the desk on your right.",
                        "Pick up the phone from the front edge of the desk.",
                        "Turn around, turn left, and walk over to the bed.",
                        "Place the phone on the middle of the bed on the edge."
                    ],
                    "task_desc":"Place a phone on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3TOK3KHVJWZO4VKFBPT7O73UKH4O7G",
                    "high_descs":[
                        "Move to the black desk facing the desk chair",
                        "Pick up the phone on the desk that is nearest to the chair",
                        "Carry the phone over to the side of the bed",
                        "Place the phone on top of the bed between the two laptops"
                    ],
                    "task_desc":"Move a phone to the bed",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-Mug-None-Desk-313/trial_T20190908_220402_027299/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_39GAF6DQWURD4I08JTNTJBQR7K1V1H",
                    "high_descs":[
                        "Turn around and face the desk next to the book shelf on your right.",
                        "Take the cup off of the table in front of you.",
                        "Turn right and face the desk in front of you.",
                        "Place the cup on top of the desk in front of you.",
                        "Turn around and face the top of the book shelf on your right.",
                        "Take the cup off the top of the book shelf in front of you. ",
                        "Turn right and face the desk chair in front of you.",
                        "Place the cup on the desk in front of you."
                    ],
                    "task_desc":"Place cup on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AS5X6GRDJKWG3_3BEFOD78W9KB6U3ISJ54UDEHSBOM4T",
                    "high_descs":[
                        "Turn around and walk forward and then to the nightstand on your right.",
                        "Pick up the cup on the nightstand.",
                        "Move to the desk on your right.",
                        "Set the cup down on the desk below the CD.",
                        "Turn around and go to the bookshelf on your right.",
                        "Pick up another cup from the top of the bookshelf.",
                        "Walk back to the desk on your right.",
                        "Set the cup down to the left of the first cup. "
                    ],
                    "task_desc":"Move the nightstand cup and the bookshelf cup over to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug"
            ]
        },
        "train/pick_two_obj_and_place-TissueBox-None-Shelf-313/trial_T20190907_041542_260231/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_39N5ACM9HH4A3EK95M46R3ZQP7Q9PM",
                    "high_descs":[
                        "turn around and walk forwards to the book shelf at the end of the room, then turn right and walk over to the desk",
                        "grab the tissue box off of the desk",
                        "turn around and walk to the small cabinet to the bottom right of the book shelf on the right",
                        "place the tissue box in the cabinet",
                        "turn right and walk back over to the desk",
                        "grab the tissue box off of the desk there",
                        "turn around and walk to the small cabinet to the bottom right of the book shelf on the right",
                        "place the tissue box in the cabinet"
                    ],
                    "task_desc":"place the tissue box in the cabinet",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox"
            ]
        },
        "train/pick_two_obj_and_place-TissueBox-None-Shelf-313/trial_T20190907_041626_531279/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3IKXWJKHW1XWC_3EF8EXOTT4CWSYEG6WKTF1VVIUG1JL",
                    "high_descs":[
                        "Turn left, turn left again, walk towards book case, turn right walk to the desk",
                        "pick up tissue form left hand corner of the desk",
                        "turn right, turn right again, turn right one more time to face the small cabinet in front of you",
                        "place the tissue on the middle shelf on the small cabinet in front of you",
                        "turn right, turn right again, face the desk in front of you",
                        "  pick up the remaining box of tissue from the desk",
                        "turn right, turn right again, turn right one more time to face the small cabinet in front of you",
                        "place the box of tissue on the middle shelf of the small cabinet in front of you next to the box of tissue already there"
                    ],
                    "task_desc":"to get both boxes of tissue off of desk putting them on the small cabinet",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Shelf-313/trial_T20190908_182711_300162/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_3PB5A5BD0YX8X7PFJE5GKKEUNQDG78",
                    "high_descs":[
                        "Turn to the left and walk to the book case. Turn to the right and walk forward to the desk. ",
                        "Pick up the pencil off of the desk. ",
                        "Turn around completely and face the small shelving unit.",
                        "Place the pencil on the shelving unit. "
                    ],
                    "task_desc":"Move a pencil to a different area. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3QFUFYSY91650KB16W1RZNU8V9MF4N",
                    "high_descs":[
                        "Turn left and walk over to the bookcase, then turn right and walk up to the desk.",
                        "Pick up the pencil off of the desk.",
                        "Turn right and walk towards the bed, then turn right and walk towards the door, turn right again to face the small end table.",
                        "Put the pencil on the shelf of the small end table."
                    ],
                    "task_desc":"Move a pencil to a small end table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3YT88D1N0BPVYAKB7TN55VU7P583KT",
                    "high_descs":[
                        "Turn left and walk to the black desk on the right.",
                        "Pick up the white pencil in the middle of the desk closest to the small lamp.",
                        "Turn around and face the small black table on the right.",
                        "Put the pencil on the left side of the shelf below the top of the table."
                    ],
                    "task_desc":"Place a pencil on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Shelf-313/trial_T20190908_182722_927182/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_3FFJ6VRIL4F8BNVQO3KAQHHNUPJ0I4",
                    "high_descs":[
                        "go to the black shelf next to the book shelf",
                        "pick up the pencil from the stand",
                        "go to the left of the stand",
                        "put the pencil on the left open shelf of the stand"
                    ],
                    "task_desc":"move the pencil from the top of the stand to the shelf on the left of the stand",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3KGTPGBS60CKGOT4X7D2S8YDLII2UQ",
                    "high_descs":[
                        "Turn left, turn left at the desk, walk to the small shelf. ",
                        "Pick up the pen to the left of the white mug. ",
                        "Move further back from the shelf. ",
                        "Put the pen down on the second shelf to the left of the tissues. "
                    ],
                    "task_desc":"To move a pen from the top shelf to the second shelf. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3OS46CRSLIQ8B415PZZAE7H8FUY6V5",
                    "high_descs":[
                        "Turn left then head to the drawer beside the book shefl",
                        "Pick up the pen on the drawer",
                        "Turn to your left and make a space, look down the drawer",
                        "Put the pencil in the second layer of the drawer"
                    ],
                    "task_desc":"Put the pencil in the second layer of the drawer",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen",
                "Book"
            ]
        },
        "train/pick_two_obj_and_place-Pencil-None-Desk-313/trial_T20190906_200931_060619/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3OS4RQUCRCWH0UACP3MX6FGCA4QBFK",
                    "high_descs":[
                        "Move to the small shelving unit by the large bookcase on the left.",
                        "Pick up the silver pencil on the top shelf. ",
                        "Turn right and move across the room to the desk. ",
                        "Put the pencil on the desk to the right of the brown pencil.",
                        "Turn around and return to the small shelving unit by the large bookcase. ",
                        "Pick up the other silver pencil that is on top of the shelf. ",
                        "Turn right and move to the desk in front of you.",
                        "Put the silver pencil on top of the other silver pencil. "
                    ],
                    "task_desc":"Put the pencils where they belong.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "train/pick_two_obj_and_place-Pencil-None-Desk-313/trial_T20190906_200948_981650/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3WEV0KO0OP9JJWDI9JD284NR2FPSDK",
                    "high_descs":[
                        "Turn to the left and move to the small shelving unit next to the bookshelf. ",
                        "Pick up the silver pencil. ",
                        "Turn to the left and move to the desk in front of you.",
                        "Place the silver pencil on the desk in between the other pencils. ",
                        "Turn around and return to the bookshelf. ",
                        "Pick up the silver pencil on top of the shelf. ",
                        "Turn left and move to the desk in front of you. ",
                        "Place the silver pencil near the other silver pencil to form a T-shape."
                    ],
                    "task_desc":"gather the pencils in the room on the desk. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Desk-313/trial_T20190909_104526_715846/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2YUCJ28XANFOX_3OONKJ5DKFAJRW93KEU4UV9SXFOOB8",
                    "high_descs":[
                        "go left and then left again to the shelf next to the book case",
                        "pick up the credit card on the left",
                        "turn to the right and move towards the desk",
                        "place the credit card on the desk",
                        "turn to the left and move back towards the shelf",
                        "pick up the other credit card on the shelf",
                        "turn to the left back towards the desk",
                        "place the credit card on the desk above the first one"
                    ],
                    "task_desc":"move both credit cards to the desk ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Desk"
            ]
        },
        "train/pick_two_obj_and_place-Book-None-Desk-313/trial_T20190908_125756_350093/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A30M9SZYJKFDS9_37U1UTWH9YD3MB3C9URYXOOW0FXR8X",
                    "high_descs":[
                        "turn around to the left go right face the bed",
                        "pick up the book that is closer to the wall",
                        "turn to the right go left turn to the right go right face the black desk  ",
                        "put the book on top of the desk",
                        "turn to the right go forward towards the bed",
                        "pick up another book that is close to the edge of the bed",
                        "turn around to the right go left and forward towards the black desk",
                        "put the book on top of the black desk"
                    ],
                    "task_desc":"move 2 books from the bed to black desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Shelf-313/trial_T20190908_123742_719248/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3DL65MZB8G6GPAOK40N303LWBGHCEY",
                    "high_descs":[
                        "Turn to the right and then right again to face the black desk.",
                        "Pick the phone up from the desk.",
                        "Turn around and face the small cabinet with discs on it to the left.",
                        "Put the phone on the shelf below the disc."
                    ],
                    "task_desc":"Put a phone on a shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Z43TA0WZ0EG0_333U7HK6IC6Y5IGQIXT5HPG61ORDJM",
                    "high_descs":[
                        "Turn around and walk to the black desk.",
                        "Pick up the white phone next to the box of tissues. ",
                        "Turn around then turn to your right towards the black nightstand next to the book shelf.",
                        "Place the phone on the nightstand underneath the CD's."
                    ],
                    "task_desc":"Take the phone from the desk and place it on the night stand underneath the CD's.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3AAJC4I4FJJ18JLMAFI28HZ9P64JZU",
                    "high_descs":[
                        "Turn around, take a step to the left",
                        "take the white cell phone from the desk",
                        "Turn around, take a step forward",
                        "Put the cell phone on the black end table"
                    ],
                    "task_desc":"Take the cell phone from the desk, put it on the end table",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Shelf-313/trial_T20190908_123725_452958/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_358010RM5HKLUJL1QM80EKUSCTPXV8",
                    "high_descs":[
                        "Walk over to the small end table in front of you.",
                        "Pick up the phone off of the end table.",
                        "Turn around and walk towards the bed, then turn right and walk towards the door, turn right again to face the end table.",
                        "Put the phone on the left side of the shelf of the end table."
                    ],
                    "task_desc":"Move a phone to the shelf of an end table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3JBT3HLQFBTXUUOK5SNM5DLLY61PZT",
                    "high_descs":[
                        "Move forward on the drawer in front of you",
                        "Pick up the cell phone on the drawer",
                        "Turn around give space and look down the drawer",
                        "Put the cell phone on the second level of the drawer"
                    ],
                    "task_desc":"Put the cell phone on the second shelf of the drawer",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3YT88D1N0BPVYAKB7TN55VU7P0F3KQ",
                    "high_descs":[
                        "Walk ahead to the night stand.",
                        "Pick up the cell phone.",
                        "Look down.",
                        "Place the cell phone on second shelf, below the CD."
                    ],
                    "task_desc":"Place a CD on a shelf.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-Book-None-Desk-313/trial_T20190909_140620_440339/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_31Q0U3WYDS6BTSZC1VKDDXAOLDT71M",
                    "high_descs":[
                        "Turn left and go forward to the bed, then go around to the end of the bed and right face it.",
                        "Pick up the book from the bed.",
                        "Turn right and go across the room, then turn right to face the desk with the lamp on it.",
                        "Place the book on the desk."
                    ],
                    "task_desc":"Move the book to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3K2755HG5VUI0GUUZ72K2ROE8YTDF0",
                    "high_descs":[
                        "Turn right and walk to the foot of the bed.",
                        "Pick up the black book on the bed.",
                        "Turn around and walk to the other end of the desk, past the chair.",
                        "Place the book on the desk, to the right of the credit card."
                    ],
                    "task_desc":"Place a book on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3WR9XG3T662SLRWVOD3FBVHRXX9745",
                    "high_descs":[
                        "Turn right and then right again to face the end of the bed.",
                        "Pick the book up from the bed.",
                        "Turn right and then right again to face the desk.",
                        "Put the book down on the desk."
                    ],
                    "task_desc":"Put a book on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Desk-313/trial_T20190909_140547_719284/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A23HZ18KTCK2DA_3I2PTA7R3WLN5BQD54Z1I3NIZ88QKR",
                    "high_descs":[
                        "Move to your right some so you are facing the center of the bed.",
                        "Pick up the book to the left of the teddy bear called Clean Code.",
                        "With the book in hand go to the desk where the black chair is",
                        "Place the book right in front of the chair and to the right of the cd."
                    ],
                    "task_desc":"Move book to the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1K5ILJMG439M5_3KIBXJ1WD8LKKZDXQR7XTYSIK7HOK8",
                    "high_descs":[
                        "take a step to the right and turn left to face the bed.",
                        "Pick up the book that's closest to the teddy bear from on the bed.",
                        "Cross the room with the book in hand and then turn to your right to face the large desk with the chair in front of it.",
                        "Put the book on the desk so that it's in front of the chair and to the right of the disc."
                    ],
                    "task_desc":"Move the book from the bed to the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3N4BPTXIOBJFX4XUMDJ6S4K72UKUK8",
                    "high_descs":[
                        "Walk to the middle of the bed.",
                        "Pick up the book closest to the teddy bear.",
                        "Turn around and walk to the small black shelf then turn right to face the desk.",
                        "Put the book on the desk in front of the chair."
                    ],
                    "task_desc":"Put a book on the desk.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Desk-313/trial_T20190909_140606_239445/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_3OCHAWUVGRB7E8RPRIUTCBJBWBPXKP",
                    "high_descs":[
                        "turn right walk straight then turn left and walk towards the bed and turn left",
                        "pick up the book on the bed",
                        "turn around and walk straight towards the bookshelf and turn right towards the desk",
                        "put the book down on the desk"
                    ],
                    "task_desc":"move the book from the bed to the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3OHYZ19UGFWE8M4BE0U8ZKPMFW4AOY",
                    "high_descs":[
                        "Move to the middle of the bed where the book is sitting",
                        "Pick up the book on top of the bed in the middle",
                        "Carry the book to the left side of the desk against the wall",
                        "Place the book on top of the desk in front of the lamp"
                    ],
                    "task_desc":"Move a book to the desk top",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3OUYGIZWRAP0S9IU1YAUZEIZGFMP01",
                    "high_descs":[
                        "Make a left around the corner of the bed to reach the books on it.",
                        "Pick up the middle book on the bed.",
                        "Turn around to walk to the desk.",
                        "Set the book down on the desk."
                    ],
                    "task_desc":"Move a book from the bed to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book"
            ]
        },
        "tests_seen/trial_T20190908_123820_715682/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and walk over to the small end table.",
                        "Pick up the phone off of the end table.",
                        "Turn around and walk forward, then turn around again to face the end table and look down.",
                        "Put the phone on the left side of the end table shelf."
                    ],
                    "task_desc":"Move a phone to a shelf."
                },
                {
                    "high_descs":[
                        "Turn left in front of the black desk. Walk to the black night stand. ",
                        "Pick up the phone on top of the black night stand. ",
                        "Turn to the left and turn back around to the black night stand. ",
                        "Put the phone on the middle shelf of the black night stand. "
                    ],
                    "task_desc":"Pick up the phone and put it on the middle shelf of the black night stand. "
                },
                {
                    "high_descs":[
                        "Turn left and walk to the nightstand to the right of the book shelves.",
                        "Pick up the cell phone on the nightstand.",
                        "Look down.",
                        "Place the cell phone on the second shelf, to the left of the clock."
                    ],
                    "task_desc":"Place a cell phone on a shelf."
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        }
    }
}