{
    "scene_name":"FloorPlan207",
    "trials":{
        "train/pick_and_place_simple-Vase-None-CoffeeTable-207/trial_T20190909_091234_276889/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3G2UL9A02G560E0971WU8T15TNQ76Z",
                    "high_descs":[
                        "Turn right and begin walking across the room, then hang a left and walk up to the black table the television is on.",
                        "Pick up the golden vase off of the black table.",
                        "Turn around to face the coffee table.",
                        "Put the golden vase on the coffee table to the left of the cardboard box."
                    ],
                    "task_desc":"Move a golden vase to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3LRLIPTPET0VIVJWG82FS38DVQMKAE",
                    "high_descs":[
                        "Turn right and move forward, then turn left and step forward, then turn left to face the entertainment center.",
                        "Pick up the vase on the entertainment center.",
                        "Turned around to face the coffee table.",
                        "Put the vase on the coffee table."
                    ],
                    "task_desc":"Move a vase to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3WT783CTPE8II7C0U9LDZVFB806BCX",
                    "high_descs":[
                        "Turn right and step forward, then take a left and then a quick left to face the tv stand",
                        "Pick up the golden vase that is sitting on the tv stand",
                        "Turn around to face the black coffee table",
                        "Place the golden vase on the coffee table to the left of the open box."
                    ],
                    "task_desc":"Place a vase on a coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-207/trial_T20190907_181750_254371/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3K2755HG5VKAFR8W3ZD3154CEPWFDQ",
                    "high_descs":[
                        "Walk forward to the chair containing a key chain and a remote control.",
                        "Pick up the key chain from the chair.",
                        "Walk around the chair to the front of the floor lamp next to the recycling bin.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a key chain by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3QAVNHZ3EPLYHCFG50PZ6H1QQISLA6",
                    "high_descs":[
                        "turn left, walk forward, turn right, walk past coffee table, stop and face chair that is on the right side",
                        "pick up the keys that are on the chair",
                        "turn right, turn left, walk towards lamp, hold keys up to lamp",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine keys with a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3YW4XOSQKT256EPAIVO7M346ZGO1U3",
                    "high_descs":[
                        "Go forward and then to the left to face the black chair on the right of another black chair.",
                        "Pick up the keys from the chair.",
                        "Go around the chair and face the lamp with the pink base.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Turn a lamp on with keys in hand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CreditCard",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-207/trial_T20190907_181734_779042/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_39N5ACM9HH4A3EK95M46R3ZQPBHP91",
                    "high_descs":[
                        "Move across the room to the left side of the TV stand",
                        "Pick up the keys sitting on top of the TV stand",
                        "Carry the keys to the floor lamp in the corner of the room",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry keys while turning on a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3L2IS5HSFDZ8KLWZNIM5JAH92HYNU2",
                    "high_descs":[
                        "Walk forward and slightly to the left to the television stand.",
                        "Pick up the keys from the television stand.",
                        "Turn left and walk to the floor lamp in the corner by the recycling bin.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3MYYFCXHJ6O3TVLYL8ISGMAI2SEG4Q",
                    "high_descs":[
                        "Go forward, and then left around the coffee table to the entertainment center on the right.",
                        "Pick up the keys from the entertainment center.",
                        "Take the keys and turn left to find the lamp.",
                        "Holding the keys, turn on the lamp."
                    ],
                    "task_desc":"Pick up a set of keys and turn on a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-207/trial_T20190908_140544_546482/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A14IPKOBOPID9H_3COPXFW7XE325ZPY5RKCIYX8UW3KPF",
                    "high_descs":[
                        "Turn left and go to the dresser, then turn right and go to the sofa then turn left then right",
                        "Pick up the remote from the right corner of the sofa, behind the cushion",
                        "Turn to the right",
                        "Put the remote on the chair"
                    ],
                    "task_desc":"Move the remote from the sofa to the chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3GNCZX450LEWTMGCT07NOKUCPKDAPU",
                    "high_descs":[
                        "Turn around, proceed to couch across room.",
                        "Pick up remote on right, above blue pillow.",
                        "Turn right to face chair closest to glass table.",
                        "Place remote on chair in front of you, to the left lower corner of the cushion."
                    ],
                    "task_desc":"Move a remote from a couch to a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3ATTHHXXWDFG8D11RF9HZV4Y4RLIXO",
                    "high_descs":[
                        "turn to the left, head to the couch",
                        "take the remote from the couch",
                        "turn to the right",
                        "put the remote on the black chair"
                    ],
                    "task_desc":"Take the remote from the couch, put it on the chair",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Pillow"
            ]
        },
        "train/pick_and_place_simple-Watch-None-CoffeeTable-207/trial_T20190907_152141_483725/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_317HQ483IA93BU1ZT1XR07TY89BINZ",
                    "high_descs":[
                        "Move so that you are facing the left side of the TV stand ",
                        "Pick up the watch that is on top of the TV stand",
                        "Carry the watch to the black coffee table",
                        "Set the watch down on the front edge of the coffee table to the right of the gold vase"
                    ],
                    "task_desc":"Move a wrist watch to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3GNCZX450L4O8XUEXSI6NYAAVG7APJ",
                    "high_descs":[
                        "Walk to the right then turn left to face the entertainment center.",
                        "Take the watch that is to the left of the television remote.",
                        "Turn around and walk to the coffee table. ",
                        "Put the watch on the coffee table to the right of the gold decoration."
                    ],
                    "task_desc":"To place the watch on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3PM8NZGV81XL4M3M8FP97BBI1YHQXB",
                    "high_descs":[
                        "Move forward to the TV.",
                        "Pick up the watch from the TV stand. ",
                        "Turn around and bring the watch to the coffee table. ",
                        "Put the watch on the coffee table. "
                    ],
                    "task_desc":"Move a watch to the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CoffeeTable",
                "Watch"
            ]
        },
        "train/pick_and_place_simple-Watch-None-CoffeeTable-207/trial_T20190907_152203_804993/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3BDCF01OG0BZDUDJL63F93JXT5DYL3",
                    "high_descs":[
                        "Turn left and go to the black desk on your left.",
                        "Pick up the wristwatch from the desk.",
                        "Turn around and go to the coffee table behind you.",
                        "Put the watch on the coffee table halfway between the red card and the cardboard box on the right."
                    ],
                    "task_desc":"Move a wristwatch to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3LRLIPTPETQNX6XYK0DYRHOB1EPKAW",
                    "high_descs":[
                        "Turn left and walk towards the tv stand on your left.",
                        "Pick up the watch from the stand.",
                        "Turn around and face the coffee table.",
                        "Place the watch to the right of the red credit card on the table."
                    ],
                    "task_desc":"Place the watch from the tv stand to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3WS1NTTKE1TGG772RNP8MYKTKWSF0U",
                    "high_descs":[
                        "Turn left and go to the TV stand.",
                        "Pick up the watch in front of the the TV.",
                        "Turn around to face the coffee table.",
                        "Put the watch down on the table."
                    ],
                    "task_desc":"Put a watch on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_37Q970SNZHPPR1X6TQT772MIEJSS13",
                    "high_descs":[
                        "Move to the left side of the black TV stand",
                        "Pick up the watch on top of the TV stand to the left of the TV",
                        "Carry the watch to the black coffee table on top of the red rug",
                        "Place the watch on top of the black coffee table to the right of the credit card"
                    ],
                    "task_desc":"Move a watch to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3MRNMEIQW8NWFJISPAG1WI9WBMMLD7",
                    "high_descs":[
                        "turn left, walk forward, stop to face the TV stand on the left",
                        "pick up the watch that is on the TV stand",
                        "turn around to face the coffee table",
                        "put the watch on the coffee table"
                    ],
                    "task_desc":"move a watch from the TV stand to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3NJM2BJS4ZNC1CRCH6EXTT0YVWWPCU",
                    "high_descs":[
                        "Walk up to the chair in front of you, then hang a left and walk over to the television.",
                        "Pick up the watch that is in front of the television on the black table.",
                        "Turn around and look down to face the coffee table.",
                        "Put the watch on the coffee table to the left of the rightmost cardboard box."
                    ],
                    "task_desc":"Move a watch to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-ArmChair-207/trial_T20190906_201623_682219/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3CPLWGV3MRGA0T8WP7RENEUVOWG9NO",
                    "high_descs":[
                        "walk over to the TV stand",
                        "grab the credit card off of the TV stand",
                        "bring the card over to the coffee table",
                        "place the card down on the chair to the left of the coffee table",
                        "turn around and walk over a bit to the card on the left side of the couch",
                        "pick up the card on the left side of the couch",
                        "walk the card over to the same chair you put the other card on",
                        "place the card down on the chair next to the other card"
                    ],
                    "task_desc":"pick up both credit cards to put them on the chair next to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Shelf-207/trial_T20190909_131800_907993/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A30M9SZYJKFDS9_3KIBXJ1WD8LKKZDXQR7XTYSIK8NOKG",
                    "high_descs":[
                        "turn to the left go forward go left towards the black sofa",
                        "pick up the set of keys from the black sofa ",
                        "turn to the left go right towards the black book shelf",
                        "put the keys on top of the book shelf",
                        "turn to the right ",
                        "pick up another set of keys from the black sofa",
                        "turn to the left go right",
                        "put the keys on top of the book shelf"
                    ],
                    "task_desc":"put 2 set of keys on top of a book shelf",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Sofa-207/trial_T20190908_050824_930889/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3JNQLM5FT739C9KCSLWK0ZISEDSL2T",
                    "high_descs":[
                        "Turn around, go to the tall black shelves. ",
                        "Pick up the credit card on the shelf. ",
                        "Bring the card to the couch to the right of the shelf.",
                        "Put the card on the couch under blue pillow. "
                    ],
                    "task_desc":"Put a credit card on a couch. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3KYQYYSHYYO4L4LP22WTOZDQ69IODI",
                    "high_descs":[
                        "turn around, walk to the shelf",
                        "grab the credit card from the shelf",
                        "turn around to the sofa",
                        "put the credit card on the sofa under the blue pillow"
                    ],
                    "task_desc":"move the credit card from the shelf to the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HXEXQTZCJ1DW_3ZSANO2JCIOGHGRE0P8SW4QCFBMSFF",
                    "high_descs":[
                        "turn around and walk to the shelf",
                        "pick up the credit card from the top shelf",
                        "lower the card and then turn right towards the couch",
                        "place the card on the couch"
                    ],
                    "task_desc":"move a credt card from a shelf to the couch",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Sofa-207/trial_T20190908_050843_342298/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_35K3O9HUAEUF7XMWZUON7NMXEK6FEU",
                    "high_descs":[
                        "Turn around and cross the room to face the television stand.",
                        "Pick the credit card up from the right side of the stand holding the television.",
                        "Cross the room and turn to face the left side of the couch.",
                        "Put the credit card on the sofa."
                    ],
                    "task_desc":"Put a credit card on a couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3QBD8R3Z240RL82W9RV0LVJKTWK4OG",
                    "high_descs":[
                        "Turn around and go around the coffee table to the front of the TV stand. ",
                        "Pick up the red credit card on the left of the blue bowl on the TV stand.",
                        "Turn around and go to the left side of the black leather sofa. ",
                        "Place the credit underneath the blue round cushion. "
                    ],
                    "task_desc":"Put the credit card on the sofa under the blue cushion.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3ZOTGHDK5LSANT47ZSRIJYZQ7CAOSU",
                    "high_descs":[
                        "Turn around and go to the entertainment stand, with the TV on it. ",
                        "Pick up the credit card to the left of the blue vase, on the entertainment stand.",
                        "Turn around and walk to the couch across from you. ",
                        "Place the credit card, under the blue pillow, on the couch. "
                    ],
                    "task_desc":"Put a credit card on the couch. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pillow"
            ]
        },
        "train/look_at_obj_in_light-CreditCard-None-FloorLamp-207/trial_T20190907_031949_058561/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3570Y55XZS0JR2ZIAF6ZWBEPWQLYGU",
                    "high_descs":[
                        "Walk forward to the side table with the plant on it",
                        "Pick up the red credit card from the table",
                        "Turn left and walk over to the floor lamp near the recycling bin",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Examine the credit card under light of the floor lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3MTMREQS4YZES6RF9EW1FSI6NOSAWH",
                    "high_descs":[
                        "Look to your left, then turn back and go to the low glass table with the potted plant on it.",
                        "Pick up the red credit card from the table.",
                        "Turn left and carry the credit card behind the black chairs to the floor lamp near the recycle bin in the corner. Face the lamp and reach under the shade with the credit card.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Turn on a floor lamp while holding a credit card.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3VE8AYVF8PEYYWC5MR2NFDQB2YCF8W",
                    "high_descs":[
                        "Move slightly left and back right again to stay at the table.",
                        "Pick up the credit card from the table.",
                        "Take the card and turn to the left and go behind the chairs to find the table.",
                        "Use the credit card up under the shade to turn the lamp on."
                    ],
                    "task_desc":"Turn the lamp on.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "FloorLamp"
            ]
        },
        "train/pick_and_place_simple-Watch-None-Shelf-207/trial_T20190908_122223_368528/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3BV8HQ2ZZZSOJGY7E48EIK3VUEY6AT",
                    "high_descs":[
                        "Turn around to the left and walk to the television. ",
                        "Pick up the watch from the television stand. ",
                        "Back away from the television stand.",
                        "Place the watch onto the top left-hand shelf under the television. "
                    ],
                    "task_desc":"Place a watch on a shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3HUTX6F6VXEP3J971L1TT26O3Q12O8",
                    "high_descs":[
                        "turn left, walk forward, turn right to face TV stand",
                        "pick up the watch that is on the TV stand",
                        "take a few steps to the left",
                        "put the watch on the second shelf of the TV stand"
                    ],
                    "task_desc":"move watch from top to second shelf of TV stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3NGMS9VZTO9FY08QQDXAQRRZKULFFR",
                    "high_descs":[
                        "Go left and then turn to the right to face the television stand.",
                        "Pick the watch up from in front of the television.",
                        "Back up and face the shelves of the television stand.",
                        "Put the watch down on the top, left shelf of the television stand."
                    ],
                    "task_desc":"Put a watch on a shelf of a television stand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_and_place_simple-Watch-None-Shelf-207/trial_T20190908_122239_644484/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3IRIK4HM3DBCCVV5YI45OFTJUILC65",
                    "high_descs":[
                        "Turn to your right and go to the right end of the entertainment stand that the TV is on. ",
                        "Pick up the watch that is near the edge of the right end of the entertainment stand. ",
                        "Turn to your left and go around to the front of the entertainment stand, so that you are now directly in front of the TV. ",
                        "Place the watch on the first shelf, on the right, on the entertainment stand. "
                    ],
                    "task_desc":"Put the watch on the shelf of the entertainment stand. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3018Q3ZVOLHH5ZWR6SBCTFURQ2DRAF",
                    "high_descs":[
                        "Turn right walk forward then face left on the side of the tv stand",
                        "Pick up the wrist watch on the tv stand",
                        "Turn left walk forward then turn left facing the tv stand",
                        "Put the wrist watch on the first layer of the shelf of the tv stand"
                    ],
                    "task_desc":"Put the wrist watch below the shelf of the tv stand",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_33C7UALJVOPFT64VB0CJRX6JWHQ815",
                    "high_descs":[
                        "Turn to your right and head to the black entertainment center with the TV on it.",
                        "Pick up the black watch on the right side of the black entertainment center.",
                        "Walk to the front of the black entertainment center facing the TV.",
                        "Put the watch on the second shelf on the far right side of the black entertainment center."
                    ],
                    "task_desc":"Pick up the black watch and put it on the shelf of the entertainment center.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_and_place_simple-Watch-None-Shelf-207/trial_T20190908_122255_167374/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_34Q075JO104XBHZSGWZ4YI01DH610Z",
                    "high_descs":[
                        "Turn to the left, and turn right around the chairs. Face the TV on the left.",
                        "Pick up the watch from the center of the table the TV is on.",
                        "Carry the watch and take a step back.",
                        "Place the watch in the center hole of the TV cabinet below the TV."
                    ],
                    "task_desc":"Move the watch from on top of the cabinet to below.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3PZDLQMM0WCOUUC4BGS2Y2C7EDSC2X",
                    "high_descs":[
                        "Walk forward to the floor lamp, then turn right and walk over and face the television stand. ",
                        "Pick up the watch that is between the two credit cards on the television stand. ",
                        "Move around so that you are a little bit away from the television stand but still facing it. ",
                        "Place the watch on the top shelf on the left hand side of the television stand. "
                    ],
                    "task_desc":"Move a watch to a shelf on the television stand.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_38YMOXR4MXQLQT1AF946090MMX0W6T",
                    "high_descs":[
                        "Walk ahead and veer right to the TV stand.",
                        "Pick up the watch near the center if the TV stand.",
                        "Look down.",
                        "Place the watch on the second shelf on the left."
                    ],
                    "task_desc":"Place a watch on a shelf.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_two_obj_and_place-RemoteControl-None-ArmChair-207/trial_T20190908_132827_840235/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_336KAV9KYTJ1XXD978ARVT4QH1O2Y9",
                    "high_descs":[
                        "Turn around and go to the front of the sofa.",
                        "Pick up the gray remote on the middle sofa seat.",
                        "Turn right and go to the front of the arm chair on the left.",
                        "Place the remote on the left front corner of the seat of the arm chair.",
                        "Go around the arm chairs to the front of the gray round table with a plant on top.",
                        "Pick up the gray remote near the front.",
                        "Go around the arm chairs back to the front of the arm chair with the remote on top.",
                        "Place the remote on the right front corner of the arm chair. "
                    ],
                    "task_desc":"Move the remotes to the arm chair seat.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2YUCJ28XANFOX_3TEM0PF1Q8OR3CF4WPJZZK1A2GC0DV",
                    "high_descs":[
                        "Turn around and cross over to the couch",
                        "Pick remote up from off of the couch",
                        "turn to the right and move towards the chair",
                        "place remote on the chair",
                        "Turn to the right and then the left going around the chairs and crossing the room to the end table.",
                        "pick the remote up that is on the table beside the plant.",
                        "turn left and cross the room turning right at the chair and go to the couch and turn around to face the chair.",
                        "Place the remote on the chair with the other remote"
                    ],
                    "task_desc":"Pick up both remotes and put them on the chair. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "tests_seen/trial_T20190907_181722_293203/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "turn to the right and go forward to the middle of the TV stand and turn to the right",
                        "pick up the set of keys from the TV stand",
                        "turn to the left and take a few steps and turn to the right and take a step and turn to the left and go to the floor lamp",
                        "turn on the floor lamp"
                    ],
                    "task_desc":"Examine a set of keys by the light of a floor lamp"
                },
                {
                    "high_descs":[
                        "Move to the black TV stand against the wall",
                        "Pick up the keys sitting on the TV stand behind the statue",
                        "Carry the keys over to the green floor lamp in the middle of the room",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry keys while turning on a lamp"
                },
                {
                    "high_descs":[
                        "Turn right and walk to the desk containing the television.",
                        "Pick up the key chain from the desk.",
                        "Turn left and walk to the floor lamp by the recycling bin.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a key chain by the light of a floor lamp."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190908_122348_520607/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to the right and take one step then turn to the left and look down.",
                        "Pick up the remote control that is in the center of the entertainment center.",
                        "Look up then turn around then look down at the coffee table.",
                        "Put the remote down in the center of the coffee table.",
                        "Look up and turn around to face the television.",
                        "Pick up the remote control that is near the television.",
                        "Look up then turn around then look down at the coffee table.",
                        "Put the remote down in the center of the coffee table, to the right of the other remote. "
                    ],
                    "task_desc":"Put the remotes on the table. "
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CoffeeTable"
            ]
        }
    }
}