{
    "scene_name":"FloorPlan330",
    "trials":{
        "train/pick_and_place_with_movable_recep-CD-Bowl-SideTable-330/trial_T20190908_002918_347755/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_358010RM5HAD9UZ3UEJJDYAQIDBXV1",
                    "high_descs":[
                        "Turn to your right then left walk forward then head to the couch ",
                        "Pick up the cd on the couch",
                        "Turn to your left then walk straight turn to you left then face the cabinet on you right",
                        "Put the cd in the bowl on the cabinet",
                        "Pick up the bowl with cd on the cabinet",
                        "Turn to your right then walk straight turn right then head to the side table of the couch",
                        "Put the bowl with cd on far right of the side table"
                    ],
                    "task_desc":"Put the bowl with cd on the side table",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3H7Z272LXAO54GLIUJ7WWCQLPGCPLY",
                    "high_descs":[
                        "Walk and face the chat that's in front of you to the right of the light in front of you.",
                        "Pick up the cd that's on the chair.",
                        "Turn left and walk to the right side of the dresser that's in front of you.",
                        "Put the cd in the clear bowl on the dresser.",
                        "Pick up the bowl with the cd in it.",
                        "Turn around and walk to the small black end table to the left of the chair that you got the cd from and face it so you're looking at the wall behind it.",
                        "Put the bowl in the corner near the phone on the small black end table."
                    ],
                    "task_desc":"Put a bowl with a cd in it on the table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1K5ILJMG439M5_3VFJCI1K42GAU1NWWKE5OFLSUN0GR9",
                    "high_descs":[
                        "Cross the room to the brown chair and look down at the seat cushion.",
                        "Pick up the disc from the left side of the seat cushion.",
                        "Bring the disc across the room and face the right end of the black dresser.",
                        "Put the disc in the gray bowl to the left of the yellow vase.",
                        "Pick up the bowl with the disc in it.",
                        "Bring the bowl over to the black table that's to the left of the brown chair.",
                        "Set the bowl down on the right side of the black table."
                    ],
                    "task_desc":"Put a bowl with a disc in it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CD"
            ]
        },
        "train/pick_and_place_with_movable_recep-CD-Bowl-SideTable-330/trial_T20190907_223831_750006/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3FIUS151DYJJ5BEIG9KTPB7LS7YGG8",
                    "high_descs":[
                        "Turn around, take a step forward, and turn right towards the other side of the dresser.",
                        "Pick up the CD on the dresser.",
                        "Turn left, walk towards the window, and then turn right to face the book case.",
                        "Place the CD on the bowl next to the alarm clock on the book case.",
                        "Pick the bowl with the CD up.",
                        "Turn right, walk past the bed, turn right towards the wall, the turn right towards the bedside table.",
                        "Place the bowl to the right of the lamp on the table."
                    ],
                    "task_desc":"Place a bowl with a CD on the bedside table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3JZLYQ606HJJR_3ZOTGHDK5LSANT47ZSRIJYZQ74GSOO",
                    "high_descs":[
                        "Turn around and move to the long, low black dresser. ",
                        "Pick up the CD that is on the far left-hand side of the dresser. ",
                        "Turn to the left and move to the tall black book shelf. ",
                        "Place the CD into the glass bowl that is on the shelf. ",
                        "Pick up the glass bowl with the CD in it. ",
                        "Move across the room to the black night stand that is on the left hand side of the bed. ",
                        "Place the bowl with the CD in it on top of the night stand."
                    ],
                    "task_desc":"Move a CD and glass bowl to the black nighstand on the left side of the bed. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AU34T9OMHN4Z4_384PI804XVIPKCCOX7P7TX3891F0SL",
                    "high_descs":[
                        "Turn around then turn right at the dresser",
                        "Pick up the CD from the dresser",
                        "Turn left and then turn right towards the cabinet",
                        "Place the CD in the bowl next to the clock",
                        "Pick up the bowl with the CD and turn right",
                        "Turn right and go towards the door before turning right again and passing by the end of the bed and turning right on the other side of the bed closest to the wall towards a nightstand",
                        "Place the Bowl with the CD on the nightstand just to the right of the lamp"
                    ],
                    "task_desc":"Delivering a CD to the nightstand beside the bed in a bowl",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CD"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-SideTable-330/trial_T20190908_132741_547490/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_378XPAWRUF44C0T8G5H3FNT0374IAE",
                    "high_descs":[
                        "Turn around and walk a step then turn left and walk to the black dresser then turn left and walk just past it and turn right so you go around it and then turn right to face the length of it.",
                        "Pick up the keys that are in front of you.",
                        "Walk back to where you started and walk to the night stand that was in front of where you started.",
                        "Put the keys on the night stand."
                    ],
                    "task_desc":"Put keys on a night stand.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3DYGAII7POZOG2NTIW49EK9HT3NQP7",
                    "high_descs":[
                        "Circle around the bed keeping it on your left until you get to the left side of a black dresser.",
                        "Pick up the keys on the black dresser.",
                        "Circle back around the bed keeping it on your right to the black nightstand.",
                        "Put the keys on the black nightstand."
                    ],
                    "task_desc":"Pick up the keys and put them on the black nightstand.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3Z2R0DQ0JK53RSWI77YXOQCAZR3E2U",
                    "high_descs":[
                        "Turn around and walk past the bed, then turn to your left and go past the foot of the bed, then turn left and go to the far left end of the dresser on your right. ",
                        "Pick up the keys, in front of the cell phone and bowl, on the dresser. ",
                        "Turn to your right and then immediately to your left to go around the dresser, go past the bed and turn right, then go to the wall and turn right again, then go to the night stand by the bed. ",
                        "Place the keys between the golden statue and the lamp, on the front of the night stand."
                    ],
                    "task_desc":"Put the keys on the night stand. ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-SideTable-330/trial_T20190908_132812_060735/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3A0EX8ZRNBFVLAD5Q132WM7UB7NBY6",
                    "high_descs":[
                        "Turn around, walk forward, turn right at the end of the bed, walk to the end of the bed, then turn left to face the brown chair. ",
                        "Pick up the keys to the left of the CD on the chair.",
                        "Move left, over to the small table that is next to chair.",
                        "Place the keys on top of the small table, to the right of the lamp."
                    ],
                    "task_desc":"Move a set of keys to a small table. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A5HOE492QK1HQ_3GM6G9ZBKQOVNFI87K6C2LQ984GMTO",
                    "high_descs":[
                        "Turn around then walk to the end of the bed and turn right, walk forward and turn left to face the arm chair at the end of the room.",
                        "Pick up the keys that are to the left of the CD. ",
                        "Head towards the nightstand to the left of the arm chair.",
                        "Put the keys on the nightstand."
                    ],
                    "task_desc":"Move the keys from the arm chair to the nightstand. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3HPZF4IVNPKEVF5B41ZX76DCTSWYC9",
                    "high_descs":[
                        "Turn around, walk around the bed to the brown armchair.",
                        "Pick up the leftmost keys from the armchair seat.",
                        "Make a left to face the dresser next to the brown armchair.",
                        "Put the keys on top of the dresser."
                    ],
                    "task_desc":"Move the leftmost keys on the armchair to the dresser.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-SideTable-330/trial_T20190908_132834_404830/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_3QJOXOW4XMITYW0BHPHH3ZQ85TEMEH",
                    "high_descs":[
                        "Head straight to the arm chair",
                        "Take the keys from the chair",
                        "Take a couple steps to the left",
                        "Put the keys on the night stand"
                    ],
                    "task_desc":"take the keys from the arm chair, put them on the night stand",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3V5Q80FXI0I0HUGLINH15Z8D80F23P",
                    "high_descs":[
                        "Walk forward to the brown chair. ",
                        "Pick up the set of keys that are on the chair. ",
                        "Move to the left, over to the small dark stand that sits next to the chair. ",
                        "Place the keys on the top of the stand, to the right of the lamp."
                    ],
                    "task_desc":"Move a set of keys to a small table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3C6FJU71TTKAH9MBQSKX1CZI0SCYUS",
                    "high_descs":[
                        "Go forward and stand in front of the brown chair.",
                        "Pick the keys up from the chair.",
                        "Go to the left and face the small table to the left of the chair with a lamp on it.",
                        "Put the keys on the table to the left of the chair."
                    ],
                    "task_desc":"Put keys on a table.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Dresser-330/trial_T20190909_071208_686774/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_32RIADZISVVE4PGNCG1Q6MDNK2G4S1",
                    "high_descs":[
                        "Walk forward then right then turn left and go to the side table.",
                        "Pick up the pencil on the side table.",
                        "Turn to the left and go around then bed then turn right to face the dresser. ",
                        "Place the pencil on the dresser next to the pen. "
                    ],
                    "task_desc":"Move a pencil to the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3EO896NRAZM5M7CN4NTKMTYS4IKTJ6",
                    "high_descs":[
                        "Turn and go to the small black dresser next to the brown chair.",
                        "Pick up the pencil that is to the right of the yellow object.",
                        "With the pencil in your hand turn and go to the big dresser with the mirror.",
                        "Place the pencil on the dresser to the left of the pen."
                    ],
                    "task_desc":"Place pencil on dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3VHP9MDGRQB8VOOGZB79IL6WNP5CF5",
                    "high_descs":[
                        "walk to face small table left of plush chair",
                        "pick up pencil from table",
                        "walk to left side of bureau",
                        "put pencil on top of bureau"
                    ],
                    "task_desc":"put pencil on top of bureau",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Dresser"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Dresser-330/trial_T20190909_071051_120393/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CY7IOJ9YH136_3IQ1VMJRYWBB1Z05CBBQ2UUXKOPA99",
                    "high_descs":[
                        "turn around, go to bedside table with lamp on the left of bed",
                        "pick up pencil from bedside table with lamp",
                        "turn around, go to brown dresser with gold dog figure",
                        "place pencil on brown dresser"
                    ],
                    "task_desc":"Place pencil on brown dresser",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Z43TA0WZ0EG0_3JWH6J9I9V419B9RJZURF69N7VWNBL",
                    "high_descs":[
                        "Turn around turn left, pass the bed and turn right to the black side table with the lamp.",
                        "Grab the pencil from in front of the lamp on the side table.",
                        "Turn around and go left toward the black dresser in front of the mirror with the dog statue.",
                        "Place the pencil onto the black dresser in front of the dog statue."
                    ],
                    "task_desc":"To place the pencil onto the black dresser in front of the statue. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3KWTYT0873U9WVPX6CNZZS56S4Y5LO",
                    "high_descs":[
                        "Turn around, head left to the wall and walk to the small nightstand on the right.",
                        "Pick up the pencil in front of the small lamp on the nightstand.",
                        "Turn around, head left at the chair and walk to the wooden dresser on the left ahead.",
                        "Put the pencil on the left side of the dresser in front of the statue."
                    ],
                    "task_desc":"Place a pencil on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Dresser"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Shelf-330/trial_T20190908_145416_946403/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_382M9COHEK6CB45KQR83U972IGXEUJ",
                    "high_descs":[
                        "Turn around and face the long dresser on the short side. ",
                        "Pick up the pen from the dresser, closer to the front.",
                        "Carry the pen and turn around to face a cabinet on the right.",
                        "Place the pen in a clear bowl in the cabinet."
                    ],
                    "task_desc":"Move a pen to a bowl in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3AMYWKA6YEDDLKS8ONDWJFN0JWK6OC",
                    "high_descs":[
                        "Turn around, walk to the boots on the floor, turn right to face the dresser. ",
                        "Pick up the pen from the dresser that's closest to the gold sculpture. ",
                        "Move to the black shelf to the left of the dresser. ",
                        "Put the pen down in the glass bowl on the shelf to the left of the yellow container. "
                    ],
                    "task_desc":"To move a pen to the black shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3G5W44VEUA9WSMWZ28UPOPJGT5CKG7",
                    "high_descs":[
                        "turn left, take a step, turn left, walk towards the wall, turn right to face the side of the dresser",
                        "pick up one of the pens that is on the dresser",
                        "turn right, take a step, turn right, walk forward, turn right to face the shelf",
                        "put the pen in to the bowl that is on the shelf"
                    ],
                    "task_desc":"move pen from dresser to a bowl on a shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-Dresser-330/trial_T20190907_035059_143638/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1AKL5YH9NLD2V_3OUYGIZWRAFS7KWW5QLDYSYXMUK0P7",
                    "high_descs":[
                        "Turn right and walk to the brown chair in the corner.",
                        "Pick up the credit card from the seat of the brown chair.",
                        "Turn left and walk to the brown dresser in the opposite corner of the room.",
                        "Place the credit card in the glass bowl on the dresser.",
                        "Pick up the glass bowl from the dresser.",
                        "Turn right and walk to the dresser with the red book on it.",
                        "Place the glass bowl to the left of the leftmost pen on the dresser."
                    ],
                    "task_desc":"Place a bowl with a credit card in it on the dresser that has a red book on it.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2WKZI3JQCE3Z6_3OXV7EAXLH7GE6DO9H4NUQ5NU1N368",
                    "high_descs":[
                        "Turn right and move all the way to the wall, turn left to face the chair, move to the chair.",
                        "Pick up the credit card on the seat of the chair.",
                        "Turn left and move past the edge of the bed, turn left and move to the end of the bed.",
                        "Turn right and move to the shelf, place the credit card in the bowl on the right side of the lower shelf.",
                        "Pick up the bowl.",
                        "Turn to the right and move forward to the dresser, turn right and move forward past the edge of the dresser, turn left and move to in front of the left side of the dresser, turn left and face the dresser.",
                        "Place the bowl on the dresser."
                    ],
                    "task_desc":"Put a bowl with the credit card from the chair onto the left side of the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3WZ36BJEV6XRJZSDKNRMNJVD10OTBA",
                    "high_descs":[
                        "Go right to the brown chair.",
                        "Pick the credit card up from the chair.",
                        "Go left all the way to the brown dresser.",
                        "Put the credit card in the gray bowl.",
                        "Pick the gray bowl with the credit card up.",
                        "Go right to the black dresser and turn to face it.",
                        "Put the bowl down on the black dresser."
                    ],
                    "task_desc":"Put a credit card in a bowl before setting it on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard",
                "Book"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-Dresser-330/trial_T20190909_192407_939684/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3A0VPWPASCO9J_3KXIR214I7XDE1DRMTX3EIGHS3U242",
                    "high_descs":[
                        "Go past the dresser on the left and hang a right to the nightstand by the bed.",
                        "Pick up the green credit card on the nightstand.",
                        "Take the credit card to the shelf by the window.",
                        "Put the card into the bowl on the shelf.",
                        "Pick up the bowl with the card in it.",
                        "Take the bowl with the card in it to the dresser. ",
                        "Set the bowl and card down on the top of the dresser."
                    ],
                    "task_desc":"Put a bowl with a credit card inside on top of the dresser.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_37M28K1J0TUSMMRG2FDMQ2OYMPKAJI",
                    "high_descs":[
                        "Walk towards the door, turn right to the bed, then turn right face the side table",
                        "Pick up the credit card on the table",
                        "Turn around to your right walk straight, then left and another left head to the furthest drawer",
                        "Put the credit card on the bowl at the drawer",
                        "Pick up the bowl on the drawer",
                        "Turn around to your right then walk towards the next drawer ",
                        "Put the bowl with credit card on the drawer"
                    ],
                    "task_desc":"Put the bowl with credit card on the large cabinet drawer",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_37ZHEEHM6Z3ZI6RTSR9F045JPLA37S",
                    "high_descs":[
                        "walk forwards to the end of the bed on the right, then take a right and walk to the night stand on the right side of the end of the room ahead",
                        "grab the credit card off of the night stand",
                        "move around to the other side of the bed, and continue walking to the end of the room where the tall cabinet is on the right",
                        "place the credit card in a bowl on the cabinet",
                        "grab the bowl off of the cabinet",
                        "move to the right to the black dresser, and turn to face it",
                        "place the bowl down on top of the dresser there"
                    ],
                    "task_desc":"place a bowl with a credit card in it on top of the dresser",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2NGMLBFZ3YQP5_3JC6VJ2SAE0KFNCVDD9SPS5T4WXA5K",
                    "high_descs":[
                        "Turn right, walk forward, turn right at the other side of the bed, walk forward, walk to the nightstand.",
                        "Pick up credit card from nightstand.",
                        "Turn right, and right again, walk to the end of the bed, turn left, walk to wall, turn right, go to the tall dresser. ",
                        "Put credit card in the bowl to the right of the keys.",
                        "Pick up the bowl from the shelf.",
                        "Walk to dresser to the right of this dresser and face it.",
                        "Put the bowl on the dresser to the right of the statues."
                    ],
                    "task_desc":"Put a bowl with credit card in it on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3ATTHHXXWD58NOF3V7K0Y9KWA05XI8",
                    "high_descs":[
                        "Walk past the bed, turning right twice until you reach the bedside table.",
                        "Pick up the credit card off of the desk",
                        "Turn around, and follow the bed, turning left twice, before turning right and walking up to the shelves.",
                        "Drop the credit card into the plastic tub",
                        "Pick up the plastic bowl with the credit card inside",
                        "Turn around and head to the chest of drawers on the left.",
                        "Place the bowl with the credit card inside on top of the chest of drawers."
                    ],
                    "task_desc":"Place a bowl containing a credit card on top of a chest of drawers",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-Dresser-330/trial_T20190909_192750_830230/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_37M28K1J0TUSMMRG2FDMQ2OYMOEAJA",
                    "high_descs":[
                        "Walk straight passed the bed, turn right towards the wall, and then turn left to face the grey sofa chair.",
                        "Pick up the left credit card on the chair.",
                        "Take a step to the left to face the night stand.",
                        "Place the credit card in the grey bowl on the night stand.",
                        "Pick up the bowl from the night stand.",
                        "Turn left, walk past the bed, turn left towards the first dresser on  your right.",
                        "Place the bowl on the dresser."
                    ],
                    "task_desc":"Place the bowl with a credit card on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3D4CH1LGEDA4Q1RA23EJXULYO7FG9J",
                    "high_descs":[
                        "walk to the end of the bed on the right, then walk across the room to the right of the bed, turn left to face the chair at the end of the room",
                        "grab a credit card off of the chair there",
                        "move to the left a bit and face the desk to the left of the chair",
                        "put the credit card in the clear bowl on the desk",
                        "grab the bowl off of the desk",
                        "turn left and walk to the door on the right, then turn left and walk over to the left side of the black dresser on the right side of the room",
                        "place the bowl on top of the dresser there"
                    ],
                    "task_desc":"place a bowl with a credit card in it on top of the dresser",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3PEIJLRY6WAQOJZ8KOOFZ0T4PZMWX9",
                    "high_descs":[
                        "Begin walking across the room, hang a right after the bed and walk over to the chair in the corner of the room.",
                        "Pick up the leftmost credit card off of the seat of the chair.",
                        "Turn left and walk around the chair to the small black dresser on its side.",
                        "Place the credit card in the glass bowl that is on the small black dresser.",
                        "Pick up the glass bowl with the credit card in it.",
                        "Turn left and begin walking across the room, then hang a left and walk over to the large black dresser that is below the mirror on the wall.",
                        "Place the glass bowl with the credit card in it onto the dresser to the left of the golden statue."
                    ],
                    "task_desc":"Put a glass bowl with a credit card in it onto the large black dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard",
                "Dresser"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Bowl-SideTable-330/trial_T20190908_140214_441167/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_326O153BMLPQU2UY4WIEK93EWH0ED9",
                    "high_descs":[
                        "Walk towards the wall, then hang a left and walk across the room, hang a right and walk up to the black dresser.",
                        "Pick up the pen off of the dresser.",
                        "Turn left and walk towards the window, then turn right to face the glass bowl on the dresser.",
                        "Put the pen in the glass bowl on the dresser.",
                        "Pick up the glass bowl with the pen in it.",
                        "Walk across the room and around the bed to the small black end table in between the bed and wall.",
                        "Put the glass bowl with the pen in it on the small black end table to the right of the lamp."
                    ],
                    "task_desc":"Put a glass bowl with a pen in it on an end table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_39ASUFLU60Y4S8ZFVWJQEG66CZ8XEQ",
                    "high_descs":[
                        "Go to the shelf on the left",
                        "Pick up the pen",
                        "Go to the left",
                        "Put the pen in the bowl",
                        "Pick up the bowl",
                        "Go to the lamp table next to the bed",
                        "Put the bowl down on the table"
                    ],
                    "task_desc":"Move a bowl with a pen next to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3NVC2EB65TQQIF9SB8OWE39INGZY3T",
                    "high_descs":[
                        "Turn left walk forward then turn left again, walk toward the end of the cabinet",
                        "Pick up the pen on the cabinet",
                        "Turn left move few step then face the cabinet ",
                        "Put the pen in the bowl",
                        "Pick up the bowl with pen",
                        "Turn right walk forward then head to the side table of the bed ",
                        "Put the bowl with pen on the side table"
                    ],
                    "task_desc":"Put the bowl with pen on the side table of the bed",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Dresser-330/trial_T20190909_064424_789194/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_33TIN5LC071CXHY8SHP65GC4NF29YS",
                    "high_descs":[
                        "Head to the chair, take a left, turn left at the end of the bed and walk to the side of the bed on the left.",
                        "Pick up the cell phone to the right of the laptop computer on the middle of the bed.",
                        "Turn around and walk to the black dresser.",
                        "Put the cell phone on the left side of the dresser in front of the gold statue."
                    ],
                    "task_desc":"Place a cell phone on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3Z3ZLGNNSLLH9DI6KY721H6GOEC3Q3",
                    "high_descs":[
                        "Go forward and then left and left again and the turn to face the bed.",
                        "Pick the phone up from the bed.",
                        "Turn to the left and face the dresser.",
                        "Put the phone down on the dresser."
                    ],
                    "task_desc":"Put a phone on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3ZPBJO59KSS2ECL0UXQK5C0RO46DHG",
                    "high_descs":[
                        "Walk past the bed then turn left and walk past the bed then turn left and walk to the head of the bed then turn left.",
                        "Pick up the phone that's in front of you to the right of the laptop.",
                        "Turn around and walk to the black dresser then take a small  step to your right.",
                        "Put the phone under the statue near the edge."
                    ],
                    "task_desc":"Put a phone on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Dresser"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Dresser-330/trial_T20190909_052323_195252/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_34X6J5FLPWPSURKVNJZPHON5KBRQJV",
                    "high_descs":[
                        "Make a left and walk around the bed, hanging a right until the brown armchair is reached in the corner of the room.",
                        "Pick up the smartphone from the brown armchair.",
                        "Make a left to walk past the bed towards the wide black dresser.",
                        "Set the smartphone on top of the wide black dresser."
                    ],
                    "task_desc":"Move a smartphone from the brown armchair to the top of the wide black dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_39L1G8WVWTITS9YPZJHN0GY8G2231Q",
                    "high_descs":[
                        "Turn left and walk around the bed, then veer left to the chair in the corner of the room on the left.",
                        "Pick up the cell phone on the chair.",
                        "Turn left and walk, veering left to the far side of the dresser.",
                        "Place the phone on the dresser, in front of the yellow object."
                    ],
                    "task_desc":"Place a cell phone on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A12HZGOZQD5YK7_3PWWM24LHVPMIRMRU4CXWGGOOU728X",
                    "high_descs":[
                        "Turn left, go across the room, turn right, go across the room and turn left toward the chair.",
                        "Pick up the phone from the chair. ",
                        "Turn left, go across the room, turn left and head to the left side of the dresser.",
                        "Put the phone on the left side of the dresser."
                    ],
                    "task_desc":"Put a phone on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book",
                "Laptop",
                "AlarmClock",
                "Pillow",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Dresser-330/trial_T20190908_132529_662268/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3V26SBZTBG5R8YQQS1LOWBNZ87GZZ0",
                    "high_descs":[
                        "Turn around and walk to the end of the bed, turn left to go around the bed, then turn left to continue going around the bed then hang right and walk to the tall black shelf",
                        "Pick up the keys that are behind the alarm clock",
                        "Turn to the right and walk to the long black dresser, stand in front of the left side of the dresser",
                        "Place the keys on the dress to the right of the golden statues",
                        "Turn right and walk to the smaller black night stand that is sitting to the left of the chair at the end of the bed",
                        "Pick up the keys that are sitting to the right of the lamp",
                        "Turn left and walk forward, then turn left to continue around the bed, take a right and stand in front of the long black dresser. Stand toward the left side of the dresser",
                        "Place the keys on the dresser to the right of the other set of keys"
                    ],
                    "task_desc":"Place keys on a dresser",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-Dresser-330/trial_T20190907_163716_768151/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1DK3FVV13STX2_32AT8R96GOQ50YO4VE3RI4RFPHMSU1",
                    "high_descs":[
                        "Turn to your right and walk to the end table next to the chair in the corner. ",
                        "Pick up the pencil on the night stand.",
                        "Put the pencil in the glass bowl on the night stand.",
                        "Pick up the glass bowl from the night stand.",
                        "Turn around and walk back to the black dresser.",
                        "Put the bowl on the dresser between the lap top and the bottle. "
                    ],
                    "task_desc":"Put a glass bowl with a pencil in it on the black dresser. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_36V4Q8R5ZNHAAA4IU8N0WUVKU7HMQX",
                    "high_descs":[
                        "Turn around and go left to stand in front of the small table next to the brown chair.",
                        "Pick up the pencil up from the table.",
                        "Put the pencil in the gray bowl on the table.",
                        "Pick the gray bowl up from the table.",
                        "Turn around and cross the room to face the black dresser.",
                        "Put the bowl down on the dresser."
                    ],
                    "task_desc":"Put a bowl with a pencil in it on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3R5F3LQFV517O5QLUKLQFRWTU9QZOQ",
                    "high_descs":[
                        "Turn  around to your left and head to the small drawer beside couch",
                        "Pick up the pencil on the drawer",
                        "Put the pencil in the bowl",
                        "Pick up the bowl with pencil",
                        "Turn to your left move straight and head to the larger drawer ",
                        "Put the bowl with pencil on the top of the larger drawer"
                    ],
                    "task_desc":"Put the bowl with pencil on the larger drawer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil",
                "Dresser"
            ]
        },
        "train/pick_and_place_simple-CD-None-Shelf-330/trial_T20190906_201328_424086/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A10AVWALIHR4UQ_308Q0PEVBBUIMSX5SREMI6YE205I96",
                    "high_descs":[
                        "Move to the area between the dresser and the bookcase and then turn right to face the dresser.",
                        "Pick up the CD from the dresser that is in front of the pen.",
                        "Turn around and move to the window then turn right and face the bookcase.",
                        "Place the CD between the bowl and the alarm clock on the middle shelf of the bookcase."
                    ],
                    "task_desc":"Place a CD on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_37UQDCYH60CJUFTCC1FLJZX2F93V7O",
                    "high_descs":[
                        "Walk towards the CD on the dresser.",
                        "Pick up the CD from the dresser.",
                        "Turn left and walk towards the dresser on your right side.",
                        "Place the CD to the left of the alarm clock."
                    ],
                    "task_desc":"Place the CD next to the alarm clock.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3NS0A6KXC7PJWS9N618IAINR2PGGZ4",
                    "high_descs":[
                        "move forward towards the self ",
                        "pick up the disk from the shelf",
                        "turn left towards the shelf",
                        "put the disk on the shelf with a clock"
                    ],
                    "task_desc":"place a disk on a shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "AlarmClock",
                "Shelf"
            ]
        },
        "train/pick_and_place_simple-CD-None-Shelf-330/trial_T20190906_201356_091911/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_39O5D9O87W95UNMPJ8HQGQXXPZV3CK",
                    "high_descs":[
                        "Turn right and walk up to the edge of the dresser where the disc lay.",
                        "Pick up the disk from under the golden statue.",
                        "Turn around over to the large black shelf with the digital alarm clock on it.",
                        "Place the disc on the shelf to the left of the digital alarm clock."
                    ],
                    "task_desc":"Place a disc on the shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3DBQWDE4Y9FRZ66KMHEXBYPT2ZU5NO",
                    "high_descs":[
                        "Turn to face the left side of the long black dresser. ",
                        "Pick up the CD from the dresser. ",
                        "Bring the CD to the black shelf with the clock.",
                        "Put the CD down on the shelf next to the clock. "
                    ],
                    "task_desc":"Put the CD down on the shelf next to the clock. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3E47SOBEYTDKKQ484BODKWZM8HECIF",
                    "high_descs":[
                        "Turn right and move toward the boots on the ground then turn right and face the dresser.",
                        "Pick up the CD that is underneath the gold toy dog on the dresser.",
                        "Turn around and move towards the window and then turn right and face the bookshelf.",
                        "Place the CD between the two pens on the bookshelf and to the left of the keys."
                    ],
                    "task_desc":"Place a CD on a bookshelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "AlarmClock",
                "Book"
            ]
        },
        "train/pick_and_place_simple-CD-None-Shelf-330/trial_T20190906_201313_428328/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_336KAV9KYT9TC8RBB0LAU7KOMDMY2T",
                    "high_descs":[
                        "Turn right and walk up to the dresser in front of the mirror",
                        "Pick up the CD from the dresser",
                        "Turn left and walk over to the shelf near the window",
                        "Put the CD on the upper shelf to the right of the clock"
                    ],
                    "task_desc":"Put the CD on the upper shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1P0XSCJ9XAV74_34T446B1C3V9DVNS0LZ7ESZQMRCC07",
                    "high_descs":[
                        "Walk straight towards the bed then turn right to face the chest of drawers.",
                        "Pick up the CD that is laying on top.",
                        "Take the CD and turn left walking towards the window. Turn right to face the shelf with the clocks. Move the CD higher up.",
                        "Place the CD on the top shelf next to the clock on the right."
                    ],
                    "task_desc":"Take the CD to place it on top of the shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3R6BYFZZPATODXDDUZEFVC74TCJFXC",
                    "high_descs":[
                        "Turn right to the dresser",
                        "Grab the disc on the dresser ",
                        "Turn left, walk to the shelf",
                        "Put the disc on the first shelf from the top"
                    ],
                    "task_desc":"Move the disc from the dresser to the top shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "tests_seen/trial_T20190908_120920_075460/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to the left and take two steps, then turn right and walk across the room.",
                        "Pick up the top pen that is on the dresser.",
                        "Turn right and take two steps, then turn right and walk across the room, then turn right and walk to the bedside table. ",
                        "Put the pen on the edge of the bedside table.",
                        "Turn around and walk across the room, then turn left and walk across the room, then turn left and take two steps, then turn right.",
                        "Pick up the pen on the dresser.",
                        "Turn right and take two steps, then turn right and walk across the room, then turn right and walk to the bedside table. ",
                        "Put the pen down on the bedside table."
                    ],
                    "task_desc":"Move the pens to the bedside table."
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "tests_seen/trial_T20190908_120823_704930/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move forward to the window and turn to the right to face the dresser.",
                        "Pick up the pen from the shelf.",
                        "Turn to the right to move past the foot of the bed and turn right again to walk to the nightstand to the left of the bed.",
                        "Place the pen on the nightstand.",
                        "Face backwards, turn left, move forward past the end of the bed and turn right to face the counter to the right of the boots.",
                        "Pick up the pen from the end of the counter.",
                        "Move to the right past the end of the bed then turn to the right and walk to the nightstand.",
                        "Place the pen on the nightstand."
                    ],
                    "task_desc":"Gather both pens from the shelf and counter and put them on the nightstand to the left of the bed."
                },
                {
                    "high_descs":[
                        "Walk forward for two steps, then turn right and walk to the shelf. ",
                        "Pick up the pen from the shelf. ",
                        "Turn around and take one step, turn left and take three steps, then turn right and walk across the room, then turn right and walk across the room.",
                        "Put the pen down on the edge of the bedside table. ",
                        "Turn around and walk to the chair, then turn left and walk to the blue trash can, then turn left and take two steps, then turn right. and take a step, then turn right to look at the table.",
                        "Pick up the pen on the table. ",
                        "Turn right and walk to the bed, then turn left and take three steps, then turn right and walk across the room, then turn right and walk to the table.",
                        "Put the pen on the table. "
                    ],
                    "task_desc":"Put the pens on the table beside the bed. "
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "tests_seen/trial_T20190907_163603_149188/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk straight then turn to the left and face the left side of the dresser",
                        "Pick up the pencil from the dresser top",
                        "Turn around and walk straight then face the right cabinet with bowls inside",
                        "Place the pencil inside the bowl",
                        "Pick up the bowl with the pencil in it",
                        "Turn to the right and walk straight then face the left dresser",
                        "Place the bowl with pencil on the dresser in front of the gold statue"
                    ],
                    "task_desc":"Putting away a pencil inside a bowl"
                },
                {
                    "high_descs":[
                        "Move to the left of the dresser to the right of the bed",
                        "Pick up a pencil from the dresser",
                        "Move to the shelf behind you",
                        "Place the pencil in a bowl on the shelf",
                        "Pick up the bowl from the shelf",
                        "Move to the dresser to the right of you",
                        "Place the bowl on the dresser"
                    ],
                    "task_desc":"Put a bowl with a pencil on the dresser."
                },
                {
                    "high_descs":[
                        "Walk to the black dresser",
                        "Take the pencil from the dresser",
                        "Turn around, head to the black shelf",
                        "Put the pencil in the bowl",
                        "Take the bowl from the shelf",
                        "Turn to the right, head to the black dresser",
                        "Put the bowl on the dresser"
                    ],
                    "task_desc":"Put the pencil in the bowl, put the bowl on the dresser"
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "tests_seen/trial_T20190908_135917_098236/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right, go forward to the wall, turn right, go forward to the night stand.",
                        "Take the pen from the night stand.",
                        "Turn around, go forward, after passing the end of the bed turn left, go forward, after passing the end of the bed turn left, go forward to the top of the bed, turn right, go to the dresser.",
                        "Put the pen in the bowl on the shelf of the dresser.",
                        "Take the bowl from the shelf of the dresser.",
                        "Turn right, go around the bed back to the night stand where the pen came from.",
                        "Put the bowl behind the CD on the night stand."
                    ],
                    "task_desc":"Put a bowl with a pen in it on a night stand."
                },
                {
                    "high_descs":[
                        "Turn right, hang a right at the wall and walk to the small side table ahead.",
                        "Pick up the white pen behind the silver disc on the table.",
                        "Turn around, hang a left at the chair, turn left at the end of the bed and head right just before the window to walk to the brown dresser ahead.",
                        "Put the pen inside the clear container on the right side of the shelf on the dresser.",
                        "Pick up the clear container with the pen inside from the shelf.",
                        "Turn around, take a left towards the door, hang a right and walk to the small side table on the right.",
                        "Put the clear container with the pen behind the silver disc on the right side of the table."
                    ],
                    "task_desc":"Place a clear container with a pen on a table."
                },
                {
                    "high_descs":[
                        "turn around, go to left bedside table with lamp",
                        "pick up pen from bedside table behind CD",
                        "turn around, go around to right side of bed, go to brown dresser to the right",
                        "place pen in gray bowl on dresser",
                        "pick up gray bowl with pen",
                        "turn around, go around bed to left bedside table with lamp",
                        "place gray bowl with pen behind CD on bedside table"
                    ],
                    "task_desc":"place gray bowl with pen on bedside table"
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen"
            ]
        }
    }
}