{
    "scene_name":"FloorPlan305",
    "trials":{
        "train/pick_and_place_simple-Pen-None-Drawer-305/trial_T20190907_224041_853486/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3H7XDTSHKF8F2X4IVEOBBET9MUPGW6",
                    "high_descs":[
                        "Walk straight towards the desk.",
                        "Pick up the pen to the right of the alarm clock.",
                        "Take a step backwards from where you are at.",
                        "Open the bottom drawer and place the pen in it."
                    ],
                    "task_desc":"Place the pen next to the alarm clock in the bottom drawer of the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3L4D84MIL297W9ZU8LNE7OB2ZYOHJ6",
                    "high_descs":[
                        "walk to the desk at front",
                        "grab the pen on the desk",
                        "turn around, turn around",
                        "open the bottom drawer, put the pen in the drawer, close the drawer"
                    ],
                    "task_desc":"move the pen on the desk to the bottom drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3OS4RQUCRCWH0UACP3MX6FGCBERFBA",
                    "high_descs":[
                        "Go forward and face the top shelf of the desk.",
                        "Pick the pen up from the desk.",
                        "Turn around and face the drawers on the left side of the desk.",
                        "Put the pen in the bottom drawer on the left and shut the drawer."
                    ],
                    "task_desc":"Put a pen in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Drawer-305/trial_T20190907_224025_871983/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_33NF62TLXMJYYZ02E6QBKGRURHOJKC",
                    "high_descs":[
                        "Turn around and go to the desk, to the left of the bed. ",
                        "Pick up the pen on the desk, directly behind a CD. ",
                        "Move back from the desk a few steps.",
                        "Place the pen in the top left drawer of the desk. "
                    ],
                    "task_desc":"Put a pen in the desk drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3AQF3RZ55BZBUITHTC5PVZUKXEF6FH",
                    "high_descs":[
                        "Move left then straight back to the large wooden desk",
                        "Pick up the black pen on top of the desk on the right side of the shelf",
                        "Carry the pen to the left side drawer of the desk",
                        "Place the pen inside of the drawer then shut the drawer"
                    ],
                    "task_desc":"Move a pen to the desk drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3C44YUNSI46M64XQH298DZIGG7RPDZ",
                    "high_descs":[
                        "turn left, go to the desk to the left",
                        "pick up pen on the right from behind CD on the desk",
                        "move to the left side of desk",
                        "open left drawer of desk, place pen on left side of desk drawer, close drawer"
                    ],
                    "task_desc":"place pen behind CD in left desk drawer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Bowl-Dresser-305/trial_T20190909_012047_412780/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3T9K2RY06UO14_317HQ483IAJBWJNXP9M81TD02HRNIX",
                    "high_descs":[
                        "Turn and go to the desk.",
                        "Pick up a pen on the desk. ",
                        "Turn left and go to the desk.",
                        "Put the pen in a bowl on the desk.",
                        "Pick up the bowl on the desk. ",
                        "Turn and go to the nightstand by the bed. ",
                        "Put the bowl on the nightstand by the bed. "
                    ],
                    "task_desc":"Move a bowl with a pen to the nightstand by the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OHYZ19UGFWE8M4BE0U8ZKPMFKPAOV",
                    "high_descs":[
                        "Turn left and walk towards the door, then turn right and walk up to the wooden desk.",
                        "Pick up the black pen off of the desk.",
                        "Turn left and walk towards the wall, then turn right to face the wooden desk.",
                        "Put the black pen in the glass bowl on the wooden desk.",
                        "Pick up the glass bowl with the pen in it off of the desk.",
                        "Turn around and walk towards the wall, then hang a left and walk up to the nightstand next to the bed.",
                        "Put the glass bowl with the pen in it on the wooden nightstand."
                    ],
                    "task_desc":"Put a glass bowl with a pen in it on a nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3UN61F00HZGKZTKABWKVL4E5YTXR54",
                    "high_descs":[
                        "Take a step to the left and face the desk.",
                        "Pick up the pencil from the right side of the desk.",
                        "Hold the pencil and take a step to the left.",
                        "Take the pencil and place it in the bowl on top of the desk.",
                        "Pick up the bowl from the top of the desk.",
                        "Carry the bowl and turn around. Then turn left to go back to the small dresser.",
                        "Place the bowl on the center of the small dresser."
                    ],
                    "task_desc":"Move a bowl and pencil to a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Bowl-Dresser-305/trial_T20190909_012128_375274/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_3300DTYQT58KJBY39IOYK8ADF0CEQ9",
                    "high_descs":[
                        "Make a right and walk across the room towards the wooden desk.",
                        "Pick up the black and white pen from the top of the desk.",
                        "Turn to face the lower part of the desk.",
                        "Put the black pen in the clear bowl on the desk.",
                        "Pick up the clear bowl with the black and white pen inside it from the desk.",
                        "Turn around, walk forward, hanging a right at the end of the bed to reach the dresser next to the bed.",
                        "Put the clear bowl with the pen down on the dresser."
                    ],
                    "task_desc":"Put a pen in a bowl next to the bed on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3IO1LGZLKCOA0S5SH6O0MTX04W3868",
                    "high_descs":[
                        "Turn right and walk forward to face the top of the desk.",
                        "Pick up the pen on the top of the desk.",
                        "Look down to face the bowl on the desk.",
                        "Put the pen in the bowl on the desk.",
                        "Pick up the bowl with a pen in it.",
                        "Turn right and walk around the bed to face the side table.",
                        "Place the bowl with a pen in it on the side table."
                    ],
                    "task_desc":"To put a pen in a bowl and move it to side table by the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3TPWUS5F8CSA6AABP0H9M9SWIQNWCB",
                    "high_descs":[
                        "Turn right at the door and face the top shelf on the desk. ",
                        "Pick up the pen to the right of the clock. ",
                        "Look down at the desk. ",
                        "Put the pen in the bowl behind the alarm clock. ",
                        "Pick up the bowl from the desk. ",
                        "Walk over to the night stand to the right of the bed. ",
                        "Put the bowl down on the night stand on the left side. "
                    ],
                    "task_desc":"Put a pen in a bowl and put the bowl down on the night stand. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-Shelf-305/trial_T20190907_213231_881031/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ZE52NWZPN85P_3HWRJOOET8JOB2RI5EOMEM5C3W7SE5",
                    "high_descs":[
                        "Turn around and then walk to your right until you face the right side of the desk",
                        "Pick up a pencil from off of the desk",
                        "Turn around and then head left to face the chest of drawers",
                        "Put the pencil in the mug that is sitting on the desk",
                        "Pick up the mug that has a pencil in it",
                        "Turn around, and then walk right to face the left side of the desk",
                        "Place the mug with the pencil in it on the shelf above the laptop"
                    ],
                    "task_desc":"Grab and place a mug with the pencil in it on a shelf",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3L4D84MIL297W9ZU8LNE7OB2ZS9HJF",
                    "high_descs":[
                        "turn to the left twice and go forward to the corner and turn to the right and go to the desk",
                        "pick up the black pen from the desk",
                        "turn to the right twice and take few steps forward and turn to the left and go to the night stand",
                        "put the pen in the closest mug",
                        "pick up the mug with the pen in it",
                        "turn to the left twice and go forward to the door and turn to the right and go to the desk ",
                        "put the mug with the pen in it on the top shelf of the desk"
                    ],
                    "task_desc":"Place a mug with a pen in it on the top shelf of a desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3Z4AIRP3C9UXNIJ5N0ZU6A3AT1E1XA",
                    "high_descs":[
                        "turn left and head for the table ",
                        "pick up the pen from the table",
                        "turn right and head for the table at the right",
                        "drop the pen in the mug on the table",
                        "pick up the mug from the table",
                        "turn around and locate the table ",
                        "drop the mug on the table"
                    ],
                    "task_desc":"drop a mug on the table with a pen in it",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-Shelf-305/trial_T20190907_213329_139933/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_39ASUFLU60OW7JDHZOU9DUM4I7CXED",
                    "high_descs":[
                        "Turn around to face the wooden desk.",
                        "Pick up the black pen that is on the wooden desk just to the left of a pencil.",
                        "Look down at the front edge of the wooden desk.",
                        "Put the black pen into the white mug that is to the right of the blue book and second from the edge of the desk.",
                        "Pick up the mug with the black pen in it off of the wooden desk.",
                        "Look up at the top of the wooden desk.",
                        "Put the mug with the black pen in it on the top of the wooden desk to the left of the analog clock."
                    ],
                    "task_desc":"Put a mug with a pen in it on top of the wooden desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3QXNC7EIPLC7FXGPO1PGC2YIH4K90V",
                    "high_descs":[
                        "Turn to your right and face desk",
                        "Pick up the pen on the desk",
                        "Look down in front of the desk",
                        "Put the pen in the second mug beside the book",
                        "Pick up the mug with pen",
                        "Look up on the upper part of the desk shelf",
                        "Put the mug with pen on top of the shelf"
                    ],
                    "task_desc":"Put mug with pen on top of the desk shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3XM0HYN6NNGRYABQDXKSJH01G7QEPR",
                    "high_descs":[
                        "Turn around to face the desk.",
                        "Pick up the pen on the desk, between the clock and the pencil.",
                        "Look down, toward the mugs on the desk.",
                        "Put the pen in the mug, located in front of the clock.",
                        "Pick up the mug with the pen in it.",
                        "Look up, toward the top layer of the desk.",
                        "Place the mug on the desk, to the left of the clock."
                    ],
                    "task_desc":"Put a mug with a pen in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-Shelf-305/trial_T20190908_074820_251697/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_31EUONYN2YKQFLLBTNWNULJX6XIVOI",
                    "high_descs":[
                        "Go to the computer desk on the right ",
                        "Pick up the white mug From the desk ",
                        "Take a couple steps to the right, face the desk",
                        "Put the white mug on the top shelf of the desk ",
                        "Pick up the pen From the shelf",
                        "Put the pen inside the white mug"
                    ],
                    "task_desc":"Put the pen inside the mug on top of the desk",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3PDJHANYK8XV8EKNO2TPYK6XDJIH6W",
                    "high_descs":[
                        "Turn right and walk to the desk.",
                        "Pick up the mug which is on the desk to the left of the laptop.",
                        "Walk slightly to the right and face the desk.",
                        "Put the mug on top of the CD which is on the top shelf of the desk.",
                        "Pick up the pen which is on the top shelf of the desk to the left of the credit card.",
                        "Put the pen in the mug."
                    ],
                    "task_desc":"Put a mug with a pen inside it on the top shelf of a desk on top of a CD.",
                    "votes":[
                        1,
                        0,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3WI0P0II6497IHD5UUDXIUIVHMCRDK",
                    "high_descs":[
                        "Move to your right so you are facing the furthest left of the desk",
                        "Pick up a mug off of the desk",
                        "Move to your right and then face left right away",
                        "Set the mug down on the shelf of the desk",
                        "Pick up a pen off of the desk",
                        "Set a pen down inside of the mug"
                    ],
                    "task_desc":"Move a mug and place a pen in it",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "CD",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-Desk-305/trial_T20190907_212639_269759/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36DK84J5YJ942_35LDD5557DLOZ76NH33308JBV2TKM9",
                    "high_descs":[
                        "Move to the desk behind you",
                        "Pick up a pen from the desk",
                        "Move to the left side of the desk",
                        "Put the pen in a cup on the desk",
                        "Pick up the cup from the desk",
                        "Move to the middle of the desk",
                        "Put the cup on the desk"
                    ],
                    "task_desc":"Put a cup with a pen on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3EJJQNKU9UMOUXI7GQWN9FXT98QRH2",
                    "high_descs":[
                        "Turn around to face the table.",
                        "Pick up the pen from off of the table.",
                        "Turn left and back to the table.",
                        "Put the pen in the mug on the table.",
                        "Pick up the mug and pen from the table.",
                        "Move right a little bit.",
                        "Set the mug and pen back on the table near the book."
                    ],
                    "task_desc":"Put the pen in the mug and set it on the table near the book.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3TUI152ZZE4DELIT1M42C27HWYCQ1N",
                    "high_descs":[
                        "Turn around to face the desk.",
                        "Pick up the pen on the desk, to the right of the mug",
                        "Turn left, move forward, and turn right to face the desk again.",
                        "Put the pen in the mug, on the desk.",
                        "Pick up the mug with the pen in it.",
                        "Turn right, go forward, and turn left to face the desk again.",
                        "Place the mug on the desk, in front of the keys and to the right of the book"
                    ],
                    "task_desc":"Put a mug with a pen in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Mug",
                "Pen",
                "Book"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-Desk-305/trial_T20190907_212624_302500/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AUTYWXILTACCR_39DD6S19JSSLCEDW06IUAF2FQ6OZEO",
                    "high_descs":[
                        "Turn around and walk over to the desk.",
                        "Grab the pen that's to the right of the laptop on the desk.",
                        "Look to the upper ledge of the desk.",
                        "Place the pen in the white mug to the right of the clock.",
                        "Grab the mug with the pen it from the desk.",
                        "Look at the lower part of the desk.",
                        "Place the mug to the lower right of the laptop."
                    ],
                    "task_desc":"Place a mug with a pen in it on a desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3Y4W8Q93L21ZBOUM3EI7JR7Y2K7DV1",
                    "high_descs":[
                        "Turn left and begin walking across the room, then hang a left and walk up to the wooden desk.",
                        "Pick up the black pen off of the wooden desk.",
                        "Look up at the top of the wooden desk.",
                        "Put the black pen in the white mug that is on top of the wooden desk.",
                        "Pick up the white mug with the pen inside of it.",
                        "Turn left and take a step forward, then turn right to face the wooden desk.",
                        "Place the white mug with the pen inside of it onto the wooden desk to the right of the laptop."
                    ],
                    "task_desc":"Put a white mug with a pen inside of it on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3FE2ERCCZ0PDA1OF7BNOOTUFK9JPOT",
                    "high_descs":[
                        "Turn around, head to the desk",
                        "Pick up the black pen from the desk",
                        "Put the black pen in the white mug",
                        "Pick up the white mug from the shelf",
                        "Take a couple steps to the left",
                        "Have the desk in front of you",
                        "Put the white mug on the desk"
                    ],
                    "task_desc":"Put the black pen in the white mug",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "CD",
                "AlarmClock",
                "Bowl",
                "Box",
                "Mug",
                "BaseballBat",
                "BasketBall",
                "Pencil",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Desk-305/trial_T20190907_230951_698317/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_34FNN24DCPQLB5AYTJN8SEN07TNY5H",
                    "high_descs":[
                        "Head left to the bed",
                        "Pick up the cell phone that is sitting on the bed to the left of the laptop",
                        "Turn left and head to the door then hang right and walk to the desk",
                        "Place the cell phone on the desk in front of the laptop"
                    ],
                    "task_desc":"Place a cell phone on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3C2NJ6JBKDYZ09NX4YCZDRMHJZT2NV",
                    "high_descs":[
                        "Turn to the left, go to bed.",
                        "Pick up phone from far end of bed, in front of laptop, behind book.",
                        "Turn left, then right, head to desk.",
                        "Place phone on desk, between chair and laptop."
                    ],
                    "task_desc":"Move phone from bed to desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3G5F9DBFOSEGN4ZOPA1XACMWUL4HV0",
                    "high_descs":[
                        "walk to the end of the bed on the right side",
                        "pick up the white cell phone from the far side of the bed",
                        "walk down to the desk, turn to face the desk",
                        "put the cellphone on the desk top in front of the laptop computer"
                    ],
                    "task_desc":"put a cellphone on a desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Desk-305/trial_T20190907_231028_856423/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_35DR22AR5G1TXLXKA4DDU3I7RSAX3U",
                    "high_descs":[
                        "Turn right, go forward, then turn left to approach the bed.",
                        "Pick up the cell phone on the bed.",
                        "Turn around, move forward, then turn right to go towards the door, then turn right to face the desk.",
                        "Put the cell phone on the desk, in front of the computer."
                    ],
                    "task_desc":"Put the cell phone on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3EJPLAJKEPXHZZKHUOZWYRA29KB6Z9",
                    "high_descs":[
                        "Move to the right then straight facing the bed",
                        "Pick up the white phone on top of the bed",
                        "Carry the phone over to the desk facing the middle of the desk top",
                        "Place the phone on the middle front of the desk top"
                    ],
                    "task_desc":"Move a phone to the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3COPXFW7XETUKA309JVVHCD60GQPKE",
                    "high_descs":[
                        "Walk forward and slightly to the right towards the cell phone on the bed.",
                        "Pick up the cell phone from the bed.",
                        "Turn left and walk across the room to the desk on the right.",
                        "Put the cell phone on the desk, in front of the laptop."
                    ],
                    "task_desc":"Move a cell phone from a bed to a desk.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "CellPhone",
                "Bed"
            ]
        },
        "train/look_at_obj_in_light-BaseballBat-None-DeskLamp-305/trial_T20190907_143435_947618/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_34Z02EIMIVUQZCP3M7UX32ZUBXN0TU",
                    "high_descs":[
                        "Go right and approach the bat on the floor by the wall.",
                        "Pick the bat up from the floor near the wall.",
                        "Go right and approach the night stand with the green lamp.",
                        "Turn the lamp on the night stand on."
                    ],
                    "task_desc":"Turn a light on with a bat in hand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1QDQU3TJHQYAU_388U7OUMFAIDJXCBIIP23NYCNCUR0C",
                    "high_descs":[
                        "look down and turn right to walk to the wall",
                        "pick up the base ball bat that is resting against the wall",
                        "turn right to face the bedside table",
                        "turn on the desk lamp that is on the bedside table"
                    ],
                    "task_desc":"turn on the bedside lamp while holding a base ball bat",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3V0Z7YWSI1HC8EW66PYQN8GU5GC2VL",
                    "high_descs":[
                        "Turn right and walk to the baseball bat on the floor.",
                        "Pick up the bat from the floor.",
                        "Turn right and walk to the desk lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a baseball bat by the light of a desk lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "DeskLamp",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-Desk-305/trial_T20190907_143217_355015/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3A0VPWPASCO9J_3I02618YA3N8N68C3XZXNZM42NSUPG",
                    "high_descs":[
                        "Walk across the room to the bed.",
                        "Pick up the cell phone on the bed.",
                        "Turn towards the nightstand with the red credit card.",
                        "Put the cell phone in the bowl on the nightstand.",
                        "Pick up the bowl with the cell phone in it.",
                        "Turn, go towards the door, and take a right past the bed to the desk.",
                        "Set the bowl with the cell phone in it down on the desk."
                    ],
                    "task_desc":"Put a bowl with a cell phone inside on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3YW4XOSQKT256EPAIVO7M346ZA21U5",
                    "high_descs":[
                        "Walk straight towards the middle of the room and turn left towards the bed.",
                        "Pick up the cell phone on the bed.",
                        "Turn right towards the night stand.",
                        "Place the cell phone in the clear bowl on the night stand.",
                        "Pick up the bowl from the night stand.",
                        "Turn around and head towards the dresser on your right.",
                        "Place the bowl on the dresser."
                    ],
                    "task_desc":"Place the cell phone on the desk into a bowl to transfer to the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3EF8EXOTT4CWSYEG6WKTF1VVIR11J0",
                    "high_descs":[
                        "Walk straight then turn to the bed on your left",
                        "Pick up the phone on the bed in between the two laptop",
                        "Turn to you right and walk towards the table",
                        "Put the phone in the bowl on the left side of the table",
                        "Pick up the bowl on the table",
                        "Turn around to your right and walk past the bed",
                        "Face the table at the end of the bed and put the bow  on the table in between other things"
                    ],
                    "task_desc":"Travel the bowl with phone from one table to the other table ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-Desk-305/trial_T20190909_181955_696983/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_31T4R4OBOVXNV6NCLKKGT79DVS8C78",
                    "high_descs":[
                        "Turn left, move forward, then turn left again to approach the bed.",
                        "Pick up the cell phone from on the bed.",
                        "Turn around, move forward, then turn left to approach the dresser.",
                        "Place the cell phone in the bowl, on the dresser.",
                        "Pick up the bowl with the cell phone in it.",
                        "Turn around, go straight, then turn right to approach the desk.",
                        "Put the bowl on the rightmost corner of the desk."
                    ],
                    "task_desc":"Put a bowl with a cell phone in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3N4BPTXIOB97CFBWQ5UPRI0589NUK8",
                    "high_descs":[
                        "turn left and walk forwards a bit, then turn left and walk to the bed at the end of the room",
                        "grab the cellphone off of the bed to the left of the laptop",
                        "move to the right side of the room where the dresser is to the right of the bed",
                        "place the cellphone inside of the glass bowl which is on top of the cabinet there",
                        "pick up the glass bowl with the cellphone in it",
                        "turn around and walk to the end of the room, then turn right and walk forwards until you reach the desk",
                        "place the bowl down on the right side of the desk"
                    ],
                    "task_desc":"place a bowl with a cellphone in it on the right side of the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3TEM0PF1Q8EJINT60HUIYYH88BFD04",
                    "high_descs":[
                        "Turn around and face the bed where the computer sits open.",
                        "Pick up the phone from the bed.",
                        "Turn and walk to face the night stand next to the bed.",
                        "Put the phone in the glass bowl on the night stand.",
                        "Pick up the bowl with the phone in it from the night stand.",
                        "Turn around and walk to the desk and stand in front of the computer.",
                        "Set the bowl on the right side of the desk, to the right of the computer."
                    ],
                    "task_desc":"Put a bowl with a phone in it on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-Desk-305/trial_T20190911_175623_605587/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_35GMH2SV3HY9DAZPYX7DUHVB57IEO7",
                    "high_descs":[
                        "turn around and walk to the mirror on the wall, then turn right and walk to the desk ahead",
                        "grab a pencil off of the desktop",
                        "turn around, walk forwards a bit then turn left and walk over to the desk next to the right of the bed",
                        "place the pencil inside a cup on the desk there",
                        "pick the cup up from the desk",
                        "turn around and walk back over to the desk and the foot of the bed",
                        "place the cup down on the desk there"
                    ],
                    "task_desc":"place a cup with a pencil in it down on the desk at the foot of the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKVQTFH16ICGZ_374TNBHA8ECA4RTWDBBBQPIR2JPQYO",
                    "high_descs":[
                        "Turn to your left, and go over to the desk that's in the left corner of the room",
                        "Pick up the pencil that's on the desk",
                        "Turn to your right and take the pencil over to the dress on the right of the bed",
                        "Put the pencil down into the glass bowl",
                        "Pick up the glass bowl from the dresser",
                        "Turn around and go back over to the desk",
                        "Place down the bowl onto the desk, to the right of the mug"
                    ],
                    "task_desc":"Pick up a pencil, bowl, place it onto the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ACSS93E03ZUGX_3HMVI3QICM9MNN9FSWLWPOAJU8ZY15",
                    "high_descs":[
                        "Turn towards the left of the room and face the desk in corner.",
                        "Pick up the pen off of the desk.",
                        "Go to the right and stand in front of the night stand next to the bed.",
                        "Place the pencil on the dish on the night stand.",
                        "Pick up the dish with the pencil.",
                        "Turn around, go straight and then right to in front of the desk. ",
                        "Place the dish with the pencil on it on the desk."
                    ],
                    "task_desc":"Move the dish with the pencil from the night table to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "AlarmClock",
                "Bowl",
                "Mug",
                "Pillow",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-Desk-305/trial_T20190907_012236_121985/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_308Q0PEVBBUIMSX5SREMI6YE2WTI9M",
                    "high_descs":[
                        "turn to face the computer desk",
                        "grab a pencil off the top of the computer desk",
                        "turn and walk over to the night stand",
                        "place the pencil on the clear bowl on the night stand",
                        "pick up the clear bowl off of the night stand",
                        "turn around and walk back over to the computer desk",
                        "place the clear bowl on the computer desk to the right of the laptop"
                    ],
                    "task_desc":"place a bowl with a pencil in it on the computer desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3L2IS5HSFDZ8KLWZNIM5JAH91HZNU2",
                    "high_descs":[
                        "Go to desk with laptop",
                        "Pick up pencil to right of laptop",
                        "go to bedside table to the right",
                        "place pencil in glass bowl on bedside table",
                        "pick up glass bowl from bedside table",
                        "go to desk with laptop",
                        "place bowl on desk to right of laptop"
                    ],
                    "task_desc":"move bowl with pencil to desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJNQ2PBD07FKE_3S0TNUHWKWZ10CY9VL7XRDNQQOZD8S",
                    "high_descs":[
                        "Turn left and then back right to face the desk. ",
                        "Pick up a pencil from behind the lap top.",
                        "Turn right and then left, go towards the night stand.",
                        "Put the pencil in the clear cup.",
                        "Pick up the cup that has the pencil in it.",
                        "Turn around and go back to the desk with the lap top on it.",
                        "Place the clear cup on the desk to the right of the lap top."
                    ],
                    "task_desc":"Moving a cup with a pencil around.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-Desk-305/trial_T20190910_150857_717050/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CMWA0L8FTSXA_317HQ483IA93BU1ZT1XR07TY7QMIN7",
                    "high_descs":[
                        "Back away from the bed, turn left toward the door, then turn right in front of the desk.",
                        "Grab a pencil off the top shelf of the desk.",
                        "Turn right facing the wall, take a step, then turn left toward the bed, go along the bed to the drawer.",
                        "At the drawer place the pencil on the bowl next to the discs.",
                        "Remove the bowl with the pencil from the drawers.",
                        "Turn back around and walk down the bed toward the door, turn right at the door to the desk.",
                        "Place the bowl with pencil inside on the desk to the left of the laptop."
                    ],
                    "task_desc":"Place a pencil from the desk into a bowl, return the pencil in the bowl back to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3300DTYQT5YCYMC5DAZHJMQBK4IEQP",
                    "high_descs":[
                        "walk over to the computer desk",
                        "grab a pencil off the top of the computer desk",
                        "walk over to the night stand next to the bed on the right",
                        "place the pencil inside of a glass bowl on top of the night stand",
                        "pick up the glass bowl off of the night stand",
                        "bring the bowl over to the computer desk",
                        "place the bowl down next to the laptop on the computer desk"
                    ],
                    "task_desc":"put a bowl with a pencil in it on the computer desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_333U7HK6ICWQKTUSMP4OG3W46ZJJD8",
                    "high_descs":[
                        "Turn left and walk past the bed then turn right and walk to the desk and face it.",
                        "Pick up the pencil that's between two clock on top of the desk.",
                        "Now walk to the night stand that's by the head of the bed and stand so the bed is on your left and you're facing the night stand.",
                        "Put the pencil in the clear bowl.",
                        "Pick up the bowl with the pencil in it.",
                        "Now walk back to the desk and stand in front of the chair and face the desk.",
                        "Put the bowl on the edge of the desk to the left of the laptop."
                    ],
                    "task_desc":"Put a clear bowl with a pencil in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "Pencil",
                "AlarmClock",
                "Bowl",
                "Box",
                "Mug",
                "BaseballBat",
                "BasketBall",
                "CD",
                "Pillow",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Bowl-Shelf-305/trial_T20190906_231848_018392/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_35GCEFQ6I85I2GXZBM1YROYIYM33ZF",
                    "high_descs":[
                        "Turn left towards the mirror and then turn right towards the desk.",
                        "Pick up the pen on the desk.",
                        "Take a step to the right towards the edge of the table.",
                        "Place the pen in the bowl in between the cups on the table.",
                        "Pick up the bowl with the pen.",
                        "Take a step to the left towards the other end of the table.",
                        "Place the bowl to the left of the stack of books closest to the wall on the table."
                    ],
                    "task_desc":"Place the pen in the bowl on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3LO69W1SU6UZR3SJR0H923CTNJCLG0",
                    "high_descs":[
                        "turn left and walk to the mirror on the wall, then turn right and walk to the desk at the end of the room",
                        "pick a pen up from the top of the desk",
                        "move to the right a bit and face the desk again",
                        "place the pen down in the clear bowl on the desk",
                        "pick up the clear bowl off of the desk",
                        "move to the left a bit and face the dresser again",
                        "place the bowl down on top of the dresser"
                    ],
                    "task_desc":"place a bowl with a pen in it down on top of the dresser",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3MYYFCXHJ6O3TVLYL8ISGMAI1V54GA",
                    "high_descs":[
                        "Move to the desk",
                        "Pick up the pen on the desk.",
                        "Bring the pen to the right side of the desk.",
                        "Put the pen in the bowl on the desk. ",
                        "Pick up the bowl with the pen on the desk.",
                        "Bring the bowl to the left side of the desk.",
                        "Put the bowl on the shelf above the desk. "
                    ],
                    "task_desc":"Put a bowl with a pen in it on the shelf on the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Bowl-Shelf-305/trial_T20190906_231958_796806/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AITP2LUW8GPB_3B3WTRP3DEJEB7J33OTUVQRXDY029V",
                    "high_descs":[
                        "Stand in front of bed, turn left then turn right, face the desk.",
                        "Now turn right towards bed",
                        "Pick up pen, carry it",
                        "Place pen inside the bowl. ",
                        "Pick up the bowl with pen on it",
                        "Now carry bowl towards the desk.",
                        "Place bowl with pen onto desk."
                    ],
                    "task_desc":"Go pick up pen, place it onto bowl, then put bowl on top of desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3ND9UOO81NJVOPIJ65LRO6YHH67WLD",
                    "high_descs":[
                        "Turn left towards the door and then turn right towards the desk.",
                        "Pick up the pen from the desk.",
                        "Turn right, walk towards the edge of the desk, and then turn left to face the desk.",
                        "Place the pen the the bowl to the right of the book on the desk.",
                        "Pick up the bowl with the pen.",
                        "Turn left and walk towards the other side of the desk and then turn right to face it.",
                        "Place the bowl to the right of the stack of books closest to the wall."
                    ],
                    "task_desc":"Place the bowl with a pen on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1VAL7L9L79IN0_3WMOAN2SREE8X0LZS8WAFWJSFKOVN7",
                    "high_descs":[
                        "Turn left, walk to the white door, and then turn right and walk to the wooden desk next to the bed.",
                        "Pick up the left pen on the desk.",
                        "Walk to the right side of the desk.",
                        "Place the pen in the glass bowl on the desk that is closest to the waste bin.",
                        "Pick up the glass bowl on the desk closest to the waste bin.",
                        "Walk to the left side of the wooden desk.",
                        "Place the glass bowl with the pen in it on the top shelf of the wooden desk."
                    ],
                    "task_desc":"Place a glass bowl with a pen in it on top of the top shelf of the wooden desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Desk",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Bowl-Shelf-305/trial_T20190906_231904_137208/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2CT57W84KXX25_35DR22AR5G1TXLXKA4DDU3I7QGH3XI",
                    "high_descs":[
                        "Walk straight to the desk.",
                        "Pick up the pen that is next to the cup.",
                        "Go closer to the desk. ",
                        "Put the pen in the clear bowl that is on the desk.",
                        "Pick up the clear bowl with the pen inside of it.",
                        "Turn left, walk to the wall, turn right towards the desk.",
                        "Place the bowl next to the cup on the top shelf of the desk."
                    ],
                    "task_desc":"Place the bowl with the pen in it onto the top shelf of the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3TXMY6UCAH5X1OSRHJTMTYQ8ZPICQ1",
                    "high_descs":[
                        "Look at the dresser in front of you.",
                        "Pick up the pen between the lap top and the mug.",
                        "Hold the pen in front of you.",
                        "Put the pen into the bowl behind the mug.",
                        "Pick up the bowl with the pen.",
                        "Go to the left.",
                        "Put the bowl with the pen on the shelf above the lap top to the right of the mug."
                    ],
                    "task_desc":"Put a pen in a bowl on the shelf above the lap top.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3YDGXNSEO2BO0GFG2A64O9TKD9048W",
                    "high_descs":[
                        "Move forward to the desk. ",
                        "Pick up the pen on the desk. ",
                        "Move closer to the desk. ",
                        "Put the pen in the bowl on the desk. ",
                        "Pick up the bowl from the desk. ",
                        "Bring the bowl over to the computer on the desk. ",
                        "Put the bowl next to the white mug. "
                    ],
                    "task_desc":"Put a bowl with a pen in it on the top shelf of the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pen",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-Dresser-305/trial_T20190909_002641_567647/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_33L7PJKHCJPG2QG4DJWTX3PEO568TD",
                    "high_descs":[
                        "Take a few steps to the right, and continue facing the desk.",
                        "Pick up the pencil from the right top side of the desk.",
                        "Hold the pencil and look down to the desk.",
                        "Hold the pencil and place it in the bowl on the right side of the bottom portion of the desk.",
                        "Pick up the bowl from the desk.",
                        "Hold the bowl and turn around, then turn left to go back to the brown dresser.",
                        "Place the bowl and pencil on the dresser, in the center."
                    ],
                    "task_desc":"Move a bowl and pencil to the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3EA3QWIZ4LM9RWSHM58KASJSR1UITE",
                    "high_descs":[
                        "Take a step to the right to face the top shelf of the desk.",
                        "Pick up the pencil on the top shelf of the desk.",
                        "Look down to face the bowl on the desk.",
                        "Place the pencil in the bowl on the desk.",
                        "Pick up the bowl in the corner of the desk.",
                        "Turn right and walk around the bed to face the side table.",
                        "Place the bowl with the pencil in it on the side table."
                    ],
                    "task_desc":"To put a pencil in a bowl and place it on the side table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3C81THYYSBGVD_3YDTZAI2W07EA5HTZXM6ALQEU0614D",
                    "high_descs":[
                        "Turn right and face the desk with the lap top on your left.",
                        "Take the pencil off of the desk in front of you.",
                        "Face the cup on the table in front of you.",
                        "Place the pencil in the cup on the table in front of you.",
                        "Take the cup with the pencil on the table in front of you.",
                        "Turn right and face the bed side table in front of you.",
                        "Place the cup with the pencil on the table in front of you."
                    ],
                    "task_desc":"Place a pencil in a cup on a bed side table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-Dresser-305/trial_T20190909_014348_157302/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A12HZGOZQD5YK7_352YTHGROY4PEG271MPR286LBSSH4O",
                    "high_descs":[
                        "Turn around and go towards the door, turn right and go to the desk.",
                        "Pick up the phone on the desk.",
                        "Look up to the bowl on the desk.",
                        "Put the phone in the bowl on the desk.",
                        "Pick up the bowl with the phone in it.",
                        "Turn right and go to the night stand.",
                        "Put the bowl on the night stand to the left of the clock."
                    ],
                    "task_desc":"Put a phone in a bowl on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_39PAAFCODPRED2CHLC73PH9MZ6LTVN",
                    "high_descs":[
                        "turn right then turn right again and walk straight towards the door and turn right towards the desk",
                        "pick up the phone on the desk",
                        "look up from the desk",
                        "put the phone in the bowl on the desk",
                        "pick up the phone and the bowl together off of the desk",
                        "turn around then turn left and walk straight towards the night stand",
                        "put the bowl and the phone down on the night stand next to the bed"
                    ],
                    "task_desc":"put a phone into a bowl and put them on the night stand next to the bed",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3NG53N1RLYAIAYNXW2N9STOHZ4RP8Z",
                    "high_descs":[
                        "Turn and go to the desk at the end of the bed.",
                        "Pick up the cell phone that is in front of the chair at the desk",
                        "With the cell phone in hand move forward more with the cell phone in hand.",
                        "Place the cell phone in the bowl in the right back corner of the desk.",
                        "Pick up the bowl in the right back corner of the desk with the cell phone in it.",
                        "With the bowl in hand turn and go to the night stand next to the bed with the lamp on it.",
                        "Place the bowl with the cell phone behind the red credit card on the night stand."
                    ],
                    "task_desc":"Place cell phone in bowl and place on night stand.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/look_at_obj_in_light-Pen-None-DeskLamp-305/trial_T20190907_115838_075745/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1P0XSCJ9XAV74_39KFRKBFIQC7JFGGYYJ71KNRO6WYOQ",
                    "high_descs":[
                        "Look down and turn around and walk to the bed. Turn to the right and go towards the table next to the bed.",
                        "Pick up the pen on the table.",
                        "Raise it up turn to the right and go to the end of the table turning left to face the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Pick up a pen on the table to turn on the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3DY46V3X3SZN9H0EIHIBHHP7C6155Q",
                    "high_descs":[
                        "Turn and face the night stand next to the bed.",
                        "Pick the pen up from the left side of the night stand.",
                        "Move right, to the right side if the night stand.",
                        "Turn the light on."
                    ],
                    "task_desc":"Turn a light on with a pen in hand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3JV9LGBJWWV7XOVG4SX1UKGNJ83GO3",
                    "high_descs":[
                        "Move to the night stand on the right side of the bed",
                        "Pick up the black pen on the far left side of the night stand",
                        "While holding the pen, face the lamp on top of the night stand to your left",
                        "Turn on the lamp "
                    ],
                    "task_desc":"Turn on a lamp while holding a pen",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "Pen"
            ]
        },
        "train/look_at_obj_in_light-Box-None-DeskLamp-305/trial_T20190906_184930_811605/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A115A6OQBJFVVS_3EO896NRAZCX1IQP8F43L7EQ9F7TJP",
                    "high_descs":[
                        "Looks downward slightly, moves to the table next to the bed.",
                        "Turns right goes to the wall, turns around and picks up an open box.",
                        "Turns slightly left, then right and proceeds forward back to the bedside table.",
                        "Turns the light on sitting on the bedside table."
                    ],
                    "task_desc":"Walk by a bed, pick up an empty box, turn on a light.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3QFUFYSY91WXFVP3AOCAY1A60CB4F9",
                    "high_descs":[
                        "Go straight to the dresser, turn right, walk to the wall, turn around",
                        "Grab the box on the floor",
                        "Go straight to the night stand ",
                        "Turn on the night stand"
                    ],
                    "task_desc":"Grab the box in the corner, turn on the night stand",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3JAOYWH7VLLKCT5BDUBZAMQ6JX79L5",
                    "high_descs":[
                        "Go to the right corner of the room and face towards the bed.",
                        "Pick up the box from the floor.",
                        "Go in front of the lamp on the dresser that is to the right of the bed.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Inspect a box in front of a lit lamp.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "Laptop",
                "AlarmClock",
                "Box",
                "Pencil"
            ]
        },
        "tests_seen/trial_T20190907_143200_617478/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right to face the bed.",
                        "Pick up the nearest cell phone on the bed.",
                        "Go to the desk, to the left of the bed.",
                        "Put the cell phone in the bowl, on the desk.",
                        "Pick up the bowl with the cell phone in it.",
                        "Turn down, to look toward the desk.",
                        "Place the bowl on the right front corner of the desk."
                    ],
                    "task_desc":"Put the cell phone in the bowl on the desk."
                },
                {
                    "high_descs":[
                        "Turn to the right and face the left end of the bed.",
                        "Pick up the closest phone on the bed.",
                        "Go left and stand in front of the desk.",
                        "Put the phone in the bowl.",
                        "Pick up the bowl with the phone from the desk.",
                        "Move a couple of steps back from the desk.",
                        "Put the bowl with the phone in it on the far right side of the desk."
                    ],
                    "task_desc":"Put a bowl with a phone in it on the right side of the desk."
                },
                {
                    "high_descs":[
                        "Turn right and walk to the bed.",
                        "Pick up the phone nearest the pillow on the left of the bed.",
                        "Walk to the desk to the right of the bed.",
                        "Place the phone in a bowl on top of the desk.",
                        "Pick up the bowl with the phone in it from the desk.",
                        "Look towards the lower section of the desk.",
                        "Place the bowl on the lower right section of the desk."
                    ],
                    "task_desc":"Place a bowl with a phone in it on a desk."
                },
                {
                    "high_descs":[
                        "Walk forward and turn right to the bed.",
                        "Pick up the nearest phone.",
                        "Go left to the desk.",
                        "Put the phone in the bowl from the shelf.",
                        "Pick up the bowl with the phone.",
                        "Look down at the desk.",
                        "Put the bowl with the phone on the desk."
                    ],
                    "task_desc":"Put a phone in a bowl on the desk."
                }
            ],
            "relative_objects":[
                "Bowl",
                "Desk",
                "CellPhone"
            ]
        },
        "tests_seen/trial_T20190907_231015_732698/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to face the bed.",
                        "Pick up the cell phone from the bed.",
                        "Carry the phone to the desk in the corner, left of the bed.",
                        "Place the phone on the desk in front of the laptop."
                    ],
                    "task_desc":"Move a cell phone to the desk from the bed."
                },
                {
                    "high_descs":[
                        "Turn right towards the bed.",
                        "Pick up the cell phone on the bed.",
                        "Turn left, walk towards the door, and then turn right towards the desk.",
                        "Place the phone to the left of the credit card on the desk."
                    ],
                    "task_desc":"Place the phone from the bed to the desk."
                },
                {
                    "high_descs":[
                        "turn to the right towards the bed",
                        "pick up the phone from the bed",
                        "turn around to the right towards the desk",
                        "put the phone on top of the desk next to the lap top"
                    ],
                    "task_desc":"put the phone on the desk"
                }
            ],
            "relative_objects":[
                "Desk",
                "Pillow",
                "CellPhone"
            ]
        }
    }
}