{
    "scene_name":"FloorPlan310",
    "trials":{
        "train/pick_and_place_simple-TennisRacket-None-SideTable-310/trial_T20190907_040931_725020/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3180JW2OT7TVGGFZ7JM5IR8CT2H5JM",
                    "high_descs":[
                        "Turn right and walk to the corner of the room where the bat and tennis racket are. ",
                        "Pick up the tennis racket from the floor. ",
                        "Turn left and walk over to the bedside table, passing the desk. ",
                        "Place the tennis racket on the table. "
                    ],
                    "task_desc":"Placing a tennis racket on a table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_32KTQ2V7RGW4IBNWD6CEAZ5VKT2M98",
                    "high_descs":[
                        "Move to the corner of the room where the tennis racket is ",
                        "Pick up the tennis racket on the floor in the corner",
                        "Carry the tennis racket to the black night stand next to the bed",
                        "Place the tennis racket on top of the night stand to the left of the phone"
                    ],
                    "task_desc":"Move a tennis racket from the floor to the night stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3JJVG1YBEEEPYXHNJR9OK3PZMYHB5J",
                    "high_descs":[
                        "Turn around and walk to the other side of the room, then turn left and look down at the floor. ",
                        "Pick up the tennis racket that is on the floor next to the baseball bat. ",
                        "Turn to the left and walk over to the desk, then turn left and walk across the room to the bedside table. ",
                        "Place the tennis racket on the bedside table next to the cell phone. "
                    ],
                    "task_desc":"To move a tennis racket to the bedside table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TennisRacket"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Shelf-310/trial_T20190908_023553_529151/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3JCG6DTRV671VP2AM1UHD3FP4HSQQK",
                    "high_descs":[
                        "Move to the brown desk top on the right side in the corner of the room",
                        "Pick up the pencil sitting on top of the desk on the right side",
                        "Move to the left facing the upper top shelf of the desk",
                        "Place the pencil on top of the desk shelf on the right hand side "
                    ],
                    "task_desc":"Move a pencil from the desk to the desk shelf",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3KB8R4ZV1HONEU670NSFO0GOCUFGB0",
                    "high_descs":[
                        "Turn right and walk up to the wooden desk",
                        "Pick up the yellow pencil from the desk",
                        "Walk a couple feet left then turn back to face the same desk",
                        "Put the pencil on the upper shelf of the desk"
                    ],
                    "task_desc":"Put the yellow pencil on the upper shelf of the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3XUHV3NRVNFZPAK9JJJK6ESXHXP5H4",
                    "high_descs":[
                        "Walk around the desk to the other side.",
                        "Pick up the pencil on the desk.",
                        "Look up.",
                        "Put the pencil in the right cabinet in front of the blue pencil."
                    ],
                    "task_desc":"Put a pencil in a cabinet.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-SideTable-310/trial_T20190908_123211_754215/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3QY5DC2MXUB4HI5GL2S9CRS2UJ4UFD",
                    "high_descs":[
                        "Go around the bed to the foot of the bed. ",
                        "Pick up the phone behind the red magazine on the bed.",
                        "Turn right to go around the bed to the black end table.",
                        "Place the phone on the top of the pencil on the top of the end table. ",
                        "Go back to the foot of the bed.",
                        "Pick up the phone on the middle of the bed. ",
                        "Go around the bed too go back to the end table. ",
                        "Place the phone on the top of the end table on the right of the previous phone. "
                    ],
                    "task_desc":"Move the phones from the bed to the end table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Desk-310/trial_T20190909_115859_563203/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_37WLF8U1WS7MA4LVUNWMBCMP5B36KS",
                    "high_descs":[
                        "Turn left and step the night stand on the right of the bed",
                        "Pick up the clock that is sitting on the night stand",
                        "turn right and walk forward to the wall then turn right and walk to the side of the desk",
                        "Place the clock on the desk"
                    ],
                    "task_desc":"Place a clock on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_39KFRKBFIQC7JFGGYYJ71KNROQ2YO0",
                    "high_descs":[
                        "Turn left and face the end table that's to the left of the door.",
                        "Pick up the clock from the end table.",
                        "Turn around and carry the clock to the edge of the brown desk.",
                        "Place the clock on the desk at the end closest to you and the black trash can."
                    ],
                    "task_desc":"Move a clock to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3MH9DQ757ZT2ATFD0E9ATQ8C1G5UGG",
                    "high_descs":[
                        "Turn to the black night stand on your left. ",
                        "Pick up the alarm clock to the right of the credit card on the night stand.",
                        "Turn around and go to the end of the desk, closest to you, on your left. ",
                        "Put the alarm clock on the edge of the desk, closest to the garbage can. "
                    ],
                    "task_desc":"Put the alarm clock on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "Desk"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Desk-310/trial_T20190908_002100_024659/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3AAJC4I4FJ9TNUZOE7TL7VF7VPXZJ8",
                    "high_descs":[
                        "Move to the night stand to the right of the bed facing the clock",
                        "Pick up the clock that is on the night stand",
                        "Carry the clock over to the far left side of the wood desk",
                        "Place the clock on the edge of the desk"
                    ],
                    "task_desc":"Carry a clock to the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3PW9OPU9PT1WM2G8ZBE1GK9EGZZ210",
                    "high_descs":[
                        "Turn around and turn left to stand at the black night stand to the right of the bed.",
                        "Pick the clock up from the night stand.",
                        "Turn around and stand facing the desk at the end where the trash can is.",
                        "Put the clock down on the desk."
                    ],
                    "task_desc":"Put a clock on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3QHK8ZVMIPZ30MK8BEPV1SLW8BJBLJ",
                    "high_descs":[
                        "turn around, walk towards the desk, turn left, walk towards the small table next to the bed",
                        "pick up the alarm clock that is on the table",
                        "turn right, walk forward, turn right, walk to the desk",
                        "put the alarm clock on the desk"
                    ],
                    "task_desc":"move alarm clock from table to desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Desk-310/trial_T20190908_033230_602789/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3JBT3HLQFBJP952M9KY54R1J4OSPZN",
                    "high_descs":[
                        "Turn around and then turn left to face the cabinets above the desk.",
                        "Take the credit card off of the shelf above the desk.",
                        "Go left and then turn to face the end of the desk where the trash can sits.",
                        "Put the credit card on the desk."
                    ],
                    "task_desc":"Put a credit card on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3K772S5NPBSZLTD2UKCNA8YAURBEH3",
                    "high_descs":[
                        "Turn around, proceed to wall,  turn left to face desk.",
                        "Remove credit card from self above desk, located to the right of the pencil.",
                        "Go to left end of desk, turn around to face short end of desk.",
                        "Place credit card on the desk to the right of the drawings."
                    ],
                    "task_desc":"Move credit card from shelf to desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Desk-310/trial_T20190908_033219_058539/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_30BUDKLTXGCN50T7TIBELBVKPIKE5M",
                    "high_descs":[
                        "turn to the left and take a few steps and turn to the right and go to the night stand",
                        "pick up the credit card from the night stand",
                        "turn to the right and go to the wall and turn to the right and go to the desk",
                        "put the credit card on the desk"
                    ],
                    "task_desc":"Place a credit card on the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A14IPKOBOPID9H_3EFE17QCRFM0VCIKVFWSZP2PVIKSHI",
                    "high_descs":[
                        "Turn left and take a few steps then turn right and go alongside the bed to the night stand",
                        "Pick up the credit card from the nightstand",
                        "Turn right and go to the wall then turn right and go to the desk",
                        "Put the credit card on the desk"
                    ],
                    "task_desc":"Move the credit card from the nightstand to the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3QAVNHZ3EPLYHCFG50PZ6H1QQTLLAL",
                    "high_descs":[
                        "walk over to the nightstand",
                        "pick up the credit card from the stand",
                        "take the credit card to the desk ",
                        "put the credit card on the desk to the left"
                    ],
                    "task_desc":"get a credit card from the night stand and put it on the desk",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_simple-CD-None-Shelf-310/trial_T20190908_125911_803188/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_304SM51WA6VYPO1WRVBDE0JTUMPBSQ",
                    "high_descs":[
                        "Turn right and then left to walk to the other side of the desk.",
                        "Pick up the CD on the desk.",
                        "Take a step left and look up.",
                        "Place the CD in the top right cabinet."
                    ],
                    "task_desc":"Place a CD in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_37M28K1J0T407BDEYN23RO80GLYJAU",
                    "high_descs":[
                        "Turn right, head across the room to the desk",
                        "Take the CD from the desk",
                        "Turn around, take a few steps, turn to the right",
                        "Put the CD on the shelf of the desk"
                    ],
                    "task_desc":"Take the CD from the desk, put it on the desk shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3P529IW9K1C1YSIMCO08L4WJHQGFL5",
                    "high_descs":[
                        "Turn right and go to the bed, turn left and walk to the wall, then turn left to face the desk.",
                        "Pick up the CD on the desk, next to the cell phone.",
                        "Go to the left side of the desk, then look up to the cabinets.",
                        "Put the CD in the cabinet on the right, above the desk."
                    ],
                    "task_desc":"Put a CD in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CD-None-Shelf-310/trial_T20190908_125951_058277/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3KAKFY4PGXT4SFUN7Q2TSFFUXXA3I1",
                    "high_descs":[
                        "Turn to your left and walk across the room to the end of the desk on your left. ",
                        "Open the top, right cabinet, above the alarm clock, on the desk and pull out the CD inside. ",
                        "Move over to your left, in front of the cell phone on the desk. ",
                        "Place the CD back into the cabinet where it once was. "
                    ],
                    "task_desc":"Put a CD back in it's original spot. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3X31TUMD70DA8DOE5PLNW2SPGGHL1U",
                    "high_descs":[
                        "Walk a few steps forward, then turn left to head towards the desk, then left again to face the desk.",
                        "Take the CD that is in the far right cabinet above the desk.",
                        "Move over a bit to the left.",
                        "Place the CD in the empty cubby hole of the desk, between the cabinets."
                    ],
                    "task_desc":"Move a CD to a different part of the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3YMU66OBIQZ5QWVRWNRSBX3O1OTGHK",
                    "high_descs":[
                        "walk forward, take a left, walk to the walk, turn left to face the desk",
                        "open cabinet above desk, take CD out, close cabinet",
                        "turn around, take a step, turn right, take a step, turn right to face desk",
                        "put CD on shelf above desk"
                    ],
                    "task_desc":"move CD from cabinet to a shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CD-None-Shelf-310/trial_T20190908_130024_429688/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3J2UYBXQQO3SI30PM2BLTERILTU066",
                    "high_descs":[
                        "Turn right and walk to the window then turn left and walk to the desk.",
                        "Look up and open the cabinet on the right side and then grab the cd that's in there before closing the door again.",
                        "Position yourself so you're facing the left side of the desk on the other side of the chair to your left.",
                        "Put the cd between the two blue pens above you and to your right."
                    ],
                    "task_desc":"Put a cd on a shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3W92K5RLWX8CS01RKGP5M138JUWV5D",
                    "high_descs":[
                        "Turn right and walk to the window. Turn left and go to the wooden desk in the corner. ",
                        "Open the top right cabinet and take the disk in it out.",
                        "Turn around and walk to the left end of the desk by the laptop.",
                        "Place the disk in the open cabinet part with the blue pens in it."
                    ],
                    "task_desc":"Get a disc from the desk and put it in the other cabinet on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "Desk",
                "Shelf"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Shelf-310/trial_T20190907_151339_403808/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_36WLNQG782RPUGAGUS2ROXVCYQZEB3",
                    "high_descs":[
                        "Turn around and walk up to the wooden desk",
                        "Look up and retrieve the clock from on top of the desk",
                        "Turn left and approach the left side of the same desk",
                        "Put the clock on the middle shelf of the desk"
                    ],
                    "task_desc":"Put the clock on the desk",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A21KF567E8ZCLO_3TY7ZAOG5I1RWTZGSYG52BCYRJ50KU",
                    "high_descs":[
                        "turn around and walk towards the desk with the laptop on it",
                        "take the clock from on top of the desk",
                        "turn around and then turn right walk to the middle of the desk",
                        "place the clock on the middle row of the desk"
                    ],
                    "task_desc":"take clock from top of the desk onto the middle of it",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3SKEMFQBZ6M9EI4JN2TKVQIGB3J8K0",
                    "high_descs":[
                        "Turn around and walk until you are facing the farthest right side of the table",
                        "Pick up the alarm clock from off of the top shelf",
                        "Turn around so that you can move to the left side of the same table",
                        "Place the alarm clock on the middle shelf"
                    ],
                    "task_desc":"Move an alarm clock",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Shelf-310/trial_T20190907_151407_969856/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_3AMYWKA6YE350V6ASFOFIT3YORZ6OJ",
                    "high_descs":[
                        "Turn around, and turn around,",
                        "Grab the clock on the table",
                        "Turn around, turn around to the cabinet above the table",
                        "Put the clock in the cabinet"
                    ],
                    "task_desc":"Move the clock from the table to the cabinet above",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3I2PTA7R3WBFKM4F9WAKHH3G5OIQK0",
                    "high_descs":[
                        "Turn around to face the bed, hang a left towards the wall and turn left to face the large desk.",
                        "Pick up the clock to the right of the laptop computer on top of the desk.",
                        "Turn around until the window is on your left, turn right to cross the room and turn right at the end of the bed to reach the large desk.",
                        "Put the clock on the open shelf above the far right laptop computer on the large desk."
                    ],
                    "task_desc":"Put a clock on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3WJ1OXY92DX325VXBBGV1CFK6698AZ",
                    "high_descs":[
                        "Head to the desk that is on your right",
                        "Pick up the clock that is sitting on the desk to the left of the laptop",
                        "Move a few steps over to your left, to the over side of the chair in front of the desk",
                        "Place the clock on in the cabinet that is above the desk"
                    ],
                    "task_desc":"Place a clock in a cabinet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cabinet",
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Shelf-310/trial_T20190907_151357_096210/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AWEPZMK7825JQ_37TRT2X24T8X5WW88TDILD8445YBJ3",
                    "high_descs":[
                        "Turn left and walk to the wooden table.",
                        "Pick up the clock on the table.",
                        "Turn around and then turn right, talk forward and turn back toward the table.",
                        "Put the clock on the top shelf to the right."
                    ],
                    "task_desc":"Place the clock from the table onto the top shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3WSELTNVR6JM0PNLE9RQS8B7KL8TAR",
                    "high_descs":[
                        "Turn left then move towards the wood desk",
                        "Pick up the clock on the right hand side of the desk",
                        "Carry the clock to the left side of the same desk",
                        "Place the clock on the left side of the top shelf of the desk"
                    ],
                    "task_desc":"Move a clock from the desk top to the desk shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3ZWFC4W1UXO4G1R1L08N6ULGTLFRFQ",
                    "high_descs":[
                        "Walk to the window and hang a left to reach the large wooden desk.",
                        "Pick up the black clock from the top of the desk.",
                        "Turn around, hang a right at the edge of the window, cross the room and take a right just past the black chair to face the wooden desk.",
                        "Put the clock on the upper far right shelf above the desk."
                    ],
                    "task_desc":"Place a clock on a wooden shelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Desk-310/trial_T20190908_030223_620154/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ANBWJZYU2A68T_3K4J6M3CXHAIVK1FU9SJTPWIUB1AG4",
                    "high_descs":[
                        "Turn to your right, go across the room, and face the dust bin on left of the table/desk",
                        "Pick up the blue pencil from the dust bin",
                        "Take the pencil closer to the table",
                        "Place the pencil on the table"
                    ],
                    "task_desc":"Pick a pencil in the dustbin and place it on the table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1P0XSCJ9XAV74_3R6P78PK7NSNAG0O09J0OUMAI1TTGH",
                    "high_descs":[
                        "Turn right to walk towards the desk and turn left. Walk halfway past the bed and turn around to walk straight to the wall. Turn right and look down at the trash can.",
                        "Take the pen out of the trash can.",
                        "Raise the pen up in the air.",
                        "Place the pen on the desk."
                    ],
                    "task_desc":"To move the pen from the trash to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3U0SRXB7CGMG4T4IJOR0EZUPVRERN4",
                    "high_descs":[
                        "Turn to the right and then stand on the side of the desk with the trash can, facing the desk.",
                        "Pick the pen up out of the trash can.",
                        "Look up at the desk.",
                        "Put the pen on the desk."
                    ],
                    "task_desc":"Put a pen on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Desk-310/trial_T20190908_030156_053101/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_3A0EX8ZRNB5N0LR7UTELV0NSHQKBY8",
                    "high_descs":[
                        "go a few step forward and turn to the left and go to the nightstand by the bed",
                        "pick up the blue pen from the nightstand",
                        "turn to the right and go to the wall and turn to the right and go to the desk",
                        "put the blue pen on the desk"
                    ],
                    "task_desc":"Place a blue pen on a desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3X87C8JFV9SD85HNE5JM83UQM4XSQT",
                    "high_descs":[
                        "walk to the desk, turn left walk to the night stand",
                        "grab the pen on the night stand",
                        "turn around, walk to the desk",
                        "put the pen on the desk"
                    ],
                    "task_desc":"move the pen from the night stand to the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3B1NLC6UG2DPIO7HJSAGJKLDTXXPGV",
                    "high_descs":[
                        "Go left to face the black night stand to the right of the bed.",
                        "Pick the pen up from the night stand.",
                        "Turn to the right and then right again to face the end of the desk with a trash can next to it.",
                        "Put the pen down on the desk."
                    ],
                    "task_desc":"Put a pen on a desk.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Desk-310/trial_T20190909_142909_426067/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3K9FOBBF2KADMKV3ACJLT95SJYCNLS",
                    "high_descs":[
                        "Turn right and walk to the desk, then make a left and walk to the black night stand to the right of the bed",
                        "Pick up the yellow pencil that is sitting on the black night stand",
                        "Turn right and walk to the wall then right again and walk to the side of the desk, the side where the black trash can is sitting",
                        "Place the pencil on the desk"
                    ],
                    "task_desc":"Place a pencil on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3K9FOBBF2KADMKV3ACJLT95SJYGNLW",
                    "high_descs":[
                        "Turn right and walk around the bed to the nightstand next to it, on the right.",
                        "Pick up the yellow pencil on the nightstand.",
                        "Turn around and walk to the side of the desk closest to you.",
                        "Place the pencil on the desk."
                    ],
                    "task_desc":"Place a pencil on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3KV0LJBBH5CI705G3V1H26PRK00RMV",
                    "high_descs":[
                        "Turn to the right and then go left to face the night stand to the right of the bed.",
                        "Pick the pencil up from the night stand.",
                        "Turn around and face the end of the desk where the trash can sits.",
                        "Put the pencil on the desk."
                    ],
                    "task_desc":"Put a pencil on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Desk-310/trial_T20190909_142857_563593/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_33M4IA01QJST1C4KH23QDN5PR3NXRM",
                    "high_descs":[
                        "Go right and then right again to face the black night stand to the right of the bed.",
                        "Pick the pencil up from the night stand.",
                        "Turn around and cross the room to stand at the end of the desk where the trash can is.",
                        "Put the pencil down on the desk."
                    ],
                    "task_desc":"Put a pencil on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3D8YOU6S9HB8YPC5K9P5ILFP1Z56UK",
                    "high_descs":[
                        "Turn right and walk to the small black nightstand to the right next to the bed",
                        "Pick up the pencil from the left side of the nightstand.",
                        "Turn right and walk to the wooden desk on the right.",
                        "Put the pencil on the left side of the desk next to the book."
                    ],
                    "task_desc":"Place a pencil on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2YUCJ28XANFOX_3X65QVEQI3EUVGYCLMA7DYBGKUECLF",
                    "high_descs":[
                        "cross the room to the night stand",
                        "pick up the pencil sitting on the edge of the night stand",
                        "cross the room to the desk",
                        "set the pencil down on the desk"
                    ],
                    "task_desc":"move the pencil to the desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Desk"
            ]
        },
        "train/pick_and_place_simple-Book-None-Desk-310/trial_T20190909_121828_424706/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3K5TEWLKGY2O4OW6R08ZBA7DOXZIV5",
                    "high_descs":[
                        "turn right, walk forward, turn left to face bed",
                        "pick up the book that is on the bed",
                        "turn around, walk to the wall, turn right to face desk",
                        "put the book on the desk"
                    ],
                    "task_desc":"move book from bed to desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3SKEMFQBZ6WHZ7QHJAI1WC2I53EK84",
                    "high_descs":[
                        "Turn right and go forward toward the bed, then turn left to face the bed.",
                        "Pick up the book nearest to you on the bed.",
                        "Turn around and go toward the wall, then turn right to face the desk.",
                        "Place the book on the desk."
                    ],
                    "task_desc":"Move the book to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3UN61F00HZGKZTKABWKVL4E5Y52R5X",
                    "high_descs":[
                        "Take a step forward, then turn right and walk over to the side of the bed.",
                        "Pick up the closest book off of the bed.",
                        "Turn right and take a step forward, then turn right and walk over to the wall and turn right to face the wooden desk.",
                        "Put the book on the wooden desk."
                    ],
                    "task_desc":"Move a book from the bed to the wooden desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Bed",
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Cabinet-310/trial_T20190908_154238_160623/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_31LVTDXBLA1Y1INV3J022TA2KEXRLI",
                    "high_descs":[
                        "Walk up to the bed.",
                        "Pick up the book off of the bed.",
                        "Turn left and walk towards the wall, then turn left, walk up to the wooden table and look up at the cabinets.",
                        "Open the leftmost cabinet door and put the book inside, then close the door."
                    ],
                    "task_desc":"Move a book into a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_38YMOXR4MXQLQT1AF946090MMYM6WR",
                    "high_descs":[
                        "Walk to the bed in front of you. ",
                        "Pick up the book behind the cushion on the bed. ",
                        "turn around and walk to the desk, and look up at cabinets above the desk. ",
                        "Open the cabinet door on the left side, place the book inside of the cabinet, close the door. "
                    ],
                    "task_desc":"To move a book from the bed to the cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3LJ7UR74RK4HOCOI4KK47S3HXVG4NH",
                    "high_descs":[
                        "Walk forward and stand at the bed.",
                        "Pick up the book from the bed.",
                        "Turn around and go to the desk.",
                        "Put the book in the upper left cabinet over the desk."
                    ],
                    "task_desc":"Put the book from the bed in the upper left cabinet over the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Bed",
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Cabinet-310/trial_T20190908_154222_896076/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_39JEC7537XSXRLA6ZQCD079IBBICV2",
                    "high_descs":[
                        "Turn left and walk over to the side of the bed, turning left again to face it",
                        "Pick up the book nearest the far wall from the bed",
                        "Turn around and walk up to the wooden desk",
                        "Open the top left cabinet of the wooden desk and put the book inside"
                    ],
                    "task_desc":"Put the book in the desk cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3RXPCZQMQS2UMLADUYO7JANHKZAG1Y",
                    "high_descs":[
                        "Turn left and walk up to the side of the bed, then face the bed. ",
                        "Pick up the book that is closest to you on the bed. ",
                        "Turn to the left, walk to the end of the bed, then turn left to walk to the desk.",
                        "Place the book in the top left cabinet of the desk."
                    ],
                    "task_desc":"Move a book from the bed to a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3WZ36BJEV67Z4OEBGVG3O5FFW5BBTN",
                    "high_descs":[
                        "Walk to the chair then turn left and walk to the nightstand then turn left when you get there.",
                        "Pick up the book that's farthest away from you.",
                        "Turn left and walk to the end of the bed then turn left and walk to the desk.",
                        "Put the book in the left side cabinet near your head."
                    ],
                    "task_desc":"Put a book in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Cabinet-310/trial_T20190908_154212_187931/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3I33IC7ZWIT01FF6R2WBS7MJEAJA25",
                    "high_descs":[
                        "turn around, take a step, turn left, walk to desk",
                        "pick up the book that is on the desk",
                        "raise book up to the cabinet",
                        "put the book in the cabinet"
                    ],
                    "task_desc":"move book from desk to cabinet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3U8YCDAGXS7LSLJ91BPJZJ89LV40Q3",
                    "high_descs":[
                        "Move to the desk on your left.",
                        "Pick up the book on the desk. ",
                        "Bring the book up to the cabinet above the desk.",
                        "Open the middle cabinet, put the book in the cabinet. "
                    ],
                    "task_desc":"Put a book in the cabinet. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_33F859I56949ZFNGG1ZEAMCRLBLHBO",
                    "high_descs":[
                        "turn right, head to the desk",
                        "take the book from the desk",
                        "open the cabinet on the desk, put the book in the cabinet",
                        "close the door to the cabinet"
                    ],
                    "task_desc":"take the book from the desk, put it in the desk cabinet",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Desk-310/trial_T20190908_125324_094909/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A21KF567E8ZCLO_333U7HK6IC6Y5IGQIXT5HPG61NIDJB",
                    "high_descs":[
                        "Walk towards the bedside table",
                        "Pick up the keys that are in the back from the table",
                        "Turn around and walk towards the desk",
                        "Place the keys on the desk"
                    ],
                    "task_desc":"Take a set of keys to the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_33PPUNGG3BWI674ZIKRBA8L0ZNXZR1",
                    "high_descs":[
                        "Walk towards the desk, then turn left ad walk across the room to the end table to the right of the bed.",
                        "Pick up the furthest set of keys off of the end table.",
                        "Turn right and walk to the wall, then turn right again and walk up to the wooden desk.",
                        "Put the set of keys on the wooden desk in front of you."
                    ],
                    "task_desc":"Move a set of keys to a wooden desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_3NL0RFNU0IEGG63F77SOF0MD30Z4K0",
                    "high_descs":[
                        "Turn left and cross the room to stand in front of the nightstand that's between the bed and door.",
                        "Pick up the keys off the nightstand that are closest to the head of the bed.",
                        "Turn right and when you get to the wall, head right again until you're standing in front of the black trash bin. and side of the desk.",
                        "Place the keys on the desk."
                    ],
                    "task_desc":"Move keys to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Desk-310/trial_T20190908_124646_907558/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_30LB5CDZNF1U6DK0O78WQCKDQXH0ZN",
                    "high_descs":[
                        "turn to the right and take a step and turn to the right and go to the nightstand",
                        "pick up the set of keys from the nightstand",
                        "turn to the right and go to the wall and turn to the right and go to the desk",
                        "put the set of keys on the desk"
                    ],
                    "task_desc":"Place a set of keys on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AHBWX3WYMAB0E_34X6J5FLPWPSURKVNJZPHON5K30JQH",
                    "high_descs":[
                        "Turn around and move to the night stand on the right of the bed.",
                        "Pick up the keys from the night stand.",
                        "Turn around and move to the end of the desk above the trash can.",
                        "Put the keys on the desk to the right of the paper."
                    ],
                    "task_desc":"Move a set of keys to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3QY5DC2MXUB4HI5GL2S9CRS2UHPUFU",
                    "high_descs":[
                        "Turn around and go to the right to face the black night stand next to the bed.",
                        "Pick the keys up from the black night stand.",
                        "Turn around and go to the left and then right to stand in front of the end of the desk with the trash can. ",
                        "Put the keys on the desk."
                    ],
                    "task_desc":"Put keys on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Desk-310/trial_T20190908_124631_281710/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_323Q6SJS8L7ZCWZWL3LATC3C09XFHO",
                    "high_descs":[
                        "Look up top of the desk.",
                        "Pick up the keys from the right shelf.",
                        "Carry the keys and take a few steps left, then turn and face the desk to the right.",
                        "Place the keys on the desk area, to the closest side."
                    ],
                    "task_desc":"Move keys from the shelf to the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Z43TA0WZ0EG0_3RU7GD8VPRK0TI26A0TE9KOIBQ3SPR",
                    "high_descs":[
                        "Walk forward to the brown desk.",
                        "Take the keys from the open cabinet door on the right side.",
                        "Walk to the left away from the desk toward the door, turn around, walk back to the desk.",
                        "Place they keys on the desk. "
                    ],
                    "task_desc":"Get the keys from the cabinet and place them onto the desk. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3X4MXAO0BJFECCZU7X74B4RIILWRW6",
                    "high_descs":[
                        "go to the desk",
                        "take the keys from the right cabinet",
                        "walk around to the left side of the desk",
                        "set the keys on the desk"
                    ],
                    "task_desc":"take the keys from the desk cabinet and place them on the desk",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-BaseballBat-None-Bed-310/trial_T20190909_013645_463866/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_36WLNQG7821XF5WEQ0R8PJFET0VBEE",
                    "high_descs":[
                        "Walk forward then turn left and look down at the ground.",
                        "Pick up the baseball bat off of the ground.",
                        "Turn around and walk up to the end of the bed.",
                        "Put the wooden bat on the left side of the bed."
                    ],
                    "task_desc":"Move a wooden bat from the ground to a bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3OLF68YTNCSK29RIFXBICQG8NJRAF2",
                    "high_descs":[
                        "Take a step forward then turn left.",
                        "Pick up the baseball bat that's in front of you on the floor.",
                        "Turn around and walk to the bed.",
                        "Lean the bat on the bed against the wall to the left of the book with the handle on the top."
                    ],
                    "task_desc":"Put a bat on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3YDTZAI2W07EA5HTZXM6ALQEUZD41L",
                    "high_descs":[
                        "Take one step then turn left and look down at the floor. ",
                        "Pick up the baseball bat on the floor.",
                        "Turn to the right and walk to the bed. ",
                        "Place the baseball bat on the left side of the bed."
                    ],
                    "task_desc":"Carry the baseball bat to the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_simple-BaseballBat-None-Bed-310/trial_T20190909_013633_346723/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_33C7UALJVOPFT64VB0CJRX6JWLE18U",
                    "high_descs":[
                        "turn around to face the wall",
                        "pick up the bat that is on the floor",
                        "turn around, walk to the bed",
                        "put the bat on the bed"
                    ],
                    "task_desc":"move a bat from the floor to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3A1COHJ8NMMQXHP9DPF4JKMQDA0H8Z",
                    "high_descs":[
                        "Turn around and face the wall in front of you",
                        "Pick up the baseball bat that is laying on the floor in front of you",
                        "Turn around and walk to the end of the bed",
                        "Place the baseball bat on the bed, stand straight up, in front of the left long white pillow."
                    ],
                    "task_desc":"Place a baseball bat on a bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3QY5DC2MXUB4HI5GL2S9CRS2UMDFUD",
                    "high_descs":[
                        "Turn around completely and look down at the baseball bat that is on the floor.",
                        "Pick up the baseball bat that is on the floor. ",
                        "Turn around completely and walk up to the foot of the bed. ",
                        "Place the bat upright on the bed. "
                    ],
                    "task_desc":"Move a baseball bat to the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "Bed",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_simple-BaseballBat-None-Bed-310/trial_T20190909_013655_956829/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_38BQUHLA9ZRFAND0B3KD8BKM90GOMT",
                    "high_descs":[
                        "Turn around and cross the room and turn to the left to face the bat and racket on the floor in the corner.",
                        "Pick the bat up from the floor.",
                        "Go to the right and face the bed.",
                        "Put the bat down on the left side of the bed."
                    ],
                    "task_desc":"Put a bat on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3NAPMVF0ZZ6IIDH8KZKRIGKTD6U27V",
                    "high_descs":[
                        "Turn around and walk to the basketball, then turn left and walk to the baseball bat on the floor.",
                        "Pick up the bat from the floor.",
                        "Turn around and walk to the bed.",
                        "Put the bat on the bed, in front of the laptop on the left."
                    ],
                    "task_desc":"Move a baseball bat from the floor to a bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3WYP994K1AIPFYWAUAMUL6L2XBB6YP",
                    "high_descs":[
                        "Turn right and walk towards the wall, then hang a right and walk over to the end of the bed and turn left and walk up to the stuff on the ground.",
                        "Pick up the baseball bat off of the ground in front of you.",
                        "Turn around and walk over to the bed.",
                        "Put the bat on the bed standing up."
                    ],
                    "task_desc":"Move a baseball bat from the ground to a bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Shelf-310/trial_T20190909_113535_223329/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_33CID57107K6IG2TSTZ6KV7MEHYL3N",
                    "high_descs":[
                        "turn around, walk to the desk",
                        "pick up the pen that is on the desk",
                        "take a few steps to the left",
                        "put the pen on the shelf above the desk"
                    ],
                    "task_desc":"move pen from desk to shelf",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3M1CVSFP63WHTYHRTDMCOPKMUXXAQH",
                    "high_descs":[
                        "Turn around and walk to the desk,",
                        "Pick up the pen that's in front of you.",
                        "Take a small step to your left.",
                        "Look up and put the pen on the shelf to the right of the cabinet in front of you."
                    ],
                    "task_desc":"Put a pen on the shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A30M9SZYJKFDS9_3N2BF7Y2VTL5I6RD7QPNO2NLXRMHM8",
                    "high_descs":[
                        "turn around to the left go left ",
                        "pick up the pen from the desk",
                        "turn to the left go right ",
                        "put the pen inside the shelf"
                    ],
                    "task_desc":"put a pen inside a shelf",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Shelf",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Shelf-310/trial_T20190909_113609_142533/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A22ON3MIIG0IJA_30OG32W0SX2ZGELBTQWHGEF8A1AENV",
                    "high_descs":[
                        "Turn left and walk to the black chair, then turn left again to face the desk.",
                        "Pick up the blue pen from the desk.",
                        "Take a side step to the left and look up.",
                        "Put the pen in the cubby hole to the right above the desk."
                    ],
                    "task_desc":"Put a pen in the cubby hole above the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_37TRT2X24TI5QLI6412ZMZS6YJZBJT",
                    "high_descs":[
                        "Turn left, move past the bed, then move to the center of the desk in the corner of the room, and then turn left to face the desk.",
                        "Pick up the blue pen in front of the CD from the desk.",
                        "Move to the left side of the desk near the black rubbish bin and then face the shelf above the desk.",
                        "Place the pen in front of the white smartphone on the shelf above the desk."
                    ],
                    "task_desc":"Place a pen on the shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3LBXNTKX0UMNXC8YNL34M25VLHEX9W",
                    "high_descs":[
                        "Take a left at the bed and walk to the large wooden desk on the left.",
                        "Pick up the blue pen to the left of the clock.",
                        "Turn left and walk to the desk on the right.",
                        "Put the blue pen in front of the cell phone on the open shelf to the right of the desk."
                    ],
                    "task_desc":"Place a pen on a desk.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "Pen",
                "Book",
                "Laptop",
                "Pencil"
            ]
        },
        "train/pick_and_place_simple-Pen-None-Shelf-310/trial_T20190909_113544_965358/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3B1NLC6UG2NX3DTFF0ZXK65FNV6PGX",
                    "high_descs":[
                        "turn around, walk across the room, turn left to face the desk",
                        "pick up the pen that is on the desk",
                        "turn around, take a step, turn right, take two steps, turn right to face desk",
                        "put pen on shelf above desk"
                    ],
                    "task_desc":"move pen from desk to shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3BEFOD78W9KB6U3ISJ54UDEHSL7M4W",
                    "high_descs":[
                        "Turn around and walk to the wall then turn left to face the desk.",
                        "Pick up the blue pen from the desk.",
                        "Move to the left front side of the desk.",
                        "Put the pen in the cubby hole above the desk."
                    ],
                    "task_desc":"Put a pen in the cubby hole above the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3NGMS9VZTO9FY08QQDXAQRRZKBPFFT",
                    "high_descs":[
                        "Make a left to walk to the desk.",
                        "Pick up the blue pen from the desk.",
                        "Turn to face the cabinet above the desk.",
                        "Put the blue pen in the cabinet above the desk."
                    ],
                    "task_desc":"Move a blue pen from the desk to the cabinet above it.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "valid_seen/pick_and_place_simple-Pencil-None-Desk-310/trial_T20190909_113054_894334/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_30H4UDGLT59XVNP1Q3XSXBPCJHGPM3",
                    "high_descs":[
                        "Turn left and walk to the left side of the desk, with the trash bin on the floor.",
                        "Pick up the pencil from the trash bin.",
                        "Look up at the desk.",
                        "Place the pencil on the desk."
                    ],
                    "task_desc":"Place a pencil on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3LBXNTKX0UMNXC8YNL34M25VLH69X0",
                    "high_descs":[
                        "Turn around and then face to your right twice so that you are facing the side of the trash can",
                        "Pick up a pencil out of the trash can",
                        "Look up from the trash can",
                        "Put the pencil down on the desk"
                    ],
                    "task_desc":"Take a pencil out of the trash and put it on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3XC1O3LBOVDBHX0N785X28BK8F4LTV",
                    "high_descs":[
                        "Walk over to the small black bin next to the wooden desk on your left.",
                        "Pick up the pencil out of the small black bin.",
                        "Look up at the wooden desk in front of you.",
                        "Put the pencil on the wooden desk."
                    ],
                    "task_desc":"Move a pencil from a small black bin to a wooden desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "AlarmClock",
                "Pencil"
            ]
        }
    }
}