{
    "scene_name":"FloorPlan307",
    "trials":{
        "train/pick_and_place_simple-CreditCard-None-Shelf-307/trial_T20190908_141045_644908/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_352YTHGROY4PEG271MPR286LBKO4HR",
                    "high_descs":[
                        "Turn left then head to the table beside the desk",
                        "Pick up the credit card on the table beside the lamp",
                        "Turn right then head to the book shelf above the desk on your right",
                        "Put the credit card on the book shelf"
                    ],
                    "task_desc":"Put the credit card from the table to  the book shelf",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A9KPD7Y55PU9Q_3LPW2N6LKWTCFLCRFQF0QF1P5NEU5E",
                    "high_descs":[
                        "Turn one hundred and eighty degrees and walk in between the two wooden chairs. ",
                        "Pick up the red credit card that is right next to the lamp.",
                        "Take a few steps to the right and stand behind the desk with a clock on it. ",
                        "Place the red credit card on the wooden shelf with the books on it."
                    ],
                    "task_desc":"Walk to the desk and pick up a credit card, place the credit card on a wooden shelf. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3KIBXJ1WD8LKKZDXQR7XTYSIKRFOKA",
                    "high_descs":[
                        "walk over to the desk",
                        "take the credit card sitting under the lamp",
                        "walk the card to the desk on the right",
                        "put the card on the center of the ledge above"
                    ],
                    "task_desc":"take the credit card from one desk and put it on the shelf of the other.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Shelf",
                "CreditCard",
                "Desk",
                "Book"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Shelf-307/trial_T20190908_141030_925653/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_32KTQ2V7RG6C309U9E1VBLPXEY99M9",
                    "high_descs":[
                        "turn to face the desk",
                        "pick up the red credit card on the left from the desk top",
                        "face the book shelf directly above the desk",
                        "put the credit card on the book shelf in front of the books"
                    ],
                    "task_desc":"put a credit card on a book shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3HYA4D452UAVX6WE2II368XABRKF2D",
                    "high_descs":[
                        "Take a small step forward then turn left and take a step forward then turn left and walk to the chair.",
                        "Pick up the credit card that's nearest to you.",
                        "Take a small step to your right.",
                        "Put the credit card on the shelf by your head."
                    ],
                    "task_desc":"Put a credit card on the shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3TOK3KHVJW9WPK6D7XIOPTNWE807OA",
                    "high_descs":[
                        "Turn left and walk to the wooden desk on the left.",
                        "Pick up the red credit card in between the clear container and the book on the desk.",
                        "Turn right, walk towards the wall and turn left to face the wooden shelf above the desk.",
                        "Put the red credit card on the middle of the shelf above the wooden desk."
                    ],
                    "task_desc":"Place a credit card on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Shelf",
                "Book"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Shelf-307/trial_T20190908_141017_721379/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_30H4UDGLT59XVNP1Q3XSXBPCJ1YMPM",
                    "high_descs":[
                        "Turn right and walk to the desk.",
                        "Pick up the credit card on the desk.",
                        "Look up.",
                        "Place the credit card on the shelf in front of the books."
                    ],
                    "task_desc":"Place a credit card on a book shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3AWETUDC95J5D81GSXX2WGK9CRIIZK",
                    "high_descs":[
                        "Turn right and walk up to the desk.",
                        "Pick up the credit card that is sitting on the desk.",
                        "Look up at the shelf that sits above the desk.",
                        "Place the credit card on the shelf in front of the books."
                    ],
                    "task_desc":"Move a credit card from a desk to a shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3VE8AYVF8PO6JLY3IZR4GZADXQO8FJ",
                    "high_descs":[
                        "turn to the right, take a few steps",
                        " turn to the left, face the desk",
                        "take the red bank card from the desk",
                        "put the bank card on the desk shelf"
                    ],
                    "task_desc":"take the bank card from the desk, put it on the desk shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Shelf",
                "CreditCard",
                "Desk",
                "Book"
            ]
        },
        "train/look_at_obj_in_light-TennisRacket-None-DeskLamp-307/trial_T20190907_164320_377785/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_33F859I569U1EQ1IKTAX90SPRL5BHP",
                    "high_descs":[
                        "Walk to the tennis racket on the floor to the left of the bed.",
                        "Pick up the tennis racket off of the floor.",
                        "Turn around and walk to the lamp on the desk.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a tennis racket by the light of a desk lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3EFE17QCRFM0VCIKVFWSZP2PV9WHS1",
                    "high_descs":[
                        "walk towards bed, turn left, walk towards door, turn right, walk to the corner",
                        "pick up tennis racket that is in the corner",
                        "turn around, take a left past the bed, walk forward, turn right, walk across to the desk",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine tennis racket with a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3HHRAGRYXBMSIE88QMRR23U0F7VO9V",
                    "high_descs":[
                        "Move to the left side of the bed by the wicker basket",
                        "Pick up the tennis racket on the floor to the left of the bed",
                        "Carry the tennis racket over to the small wood desk where the desk lamp is",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry a tennis racket while turning on a light",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TennisRacket",
                "DeskLamp"
            ]
        },
        "train/look_at_obj_in_light-CD-None-DeskLamp-307/trial_T20190906_200412_559520/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A21KF567E8ZCLO_3GA6AFUKOR5WBVX550VRRHUD2PUH3X",
                    "high_descs":[
                        "walk towards the desk that is on the right",
                        "pick up the bottom most CD from the desk",
                        "turn around 180 degrees, then turn right and stop at the next desk",
                        "turn the light on at the desk"
                    ],
                    "task_desc":"Take a CD to a new desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3II4UPYCOMO76GY5HFOXD48QKOFDQL",
                    "high_descs":[
                        "Walk forward to the desk.",
                        "Pick up the CD which is closest to you.",
                        "Turn left and walk towards the lamp at the edge of the desk.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a CD by the light of a table lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3WAKVUDHUZXJH04C7B5GNDVJ1ZUU7S",
                    "high_descs":[
                        "Walk straight towards the desk.",
                        "Pick up the CD that is closest to you.",
                        "Turn left and walk towards the lamp on your right.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a CD by the light of a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-Desk-307/trial_T20190919_011916_023298/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_337RC3OW08TQUP4CC35C3QZ55L9LV6",
                    "high_descs":[
                        "Turn and face the white shelf on the right. ",
                        "Pick up the credit card from the white shelf. ",
                        "Turn around and walk to the desk on the left. ",
                        "Put the credit card in the bowl to the left of the alarm clock. ",
                        "Pick up the bowl from the desk. ",
                        "Walk to the right side of the desk on the right side. ",
                        "Put the bowl down on the right side of the desk. "
                    ],
                    "task_desc":"To put a credit card in a bowl and put the bowl down on the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3FE2ERCCZ0ZLVQAD3JC5PFEHE27OPZ",
                    "high_descs":[
                        "walk to face the white radiator cover in front of a window",
                        "pick up the red credit card from the radiator cover",
                        "turn right, walk to face the small square table to the left of the desk",
                        "put the credit card into the bowl on the table top",
                        "pick up the bowl from the table top",
                        "turn right, walk to face the right side of the desk",
                        "put the bowl on the desk to the right of the closest set of keys"
                    ],
                    "task_desc":"put a bowl and credit card on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3JMSRU9HQLLCOJUKVHI8QV9LWOWVEH",
                    "high_descs":[
                        "Go to the white table under the window",
                        "Pick up the credit card",
                        "Go to the lamp table",
                        "Put the credit card in a bowl",
                        "Pick up the bowl ",
                        "Go to the desk",
                        "Put the bowl down on the desk"
                    ],
                    "task_desc":"Put a bowl with a credit card in it on the desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard",
                "Desk"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-Desk-307/trial_T20190908_132717_173929/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3VJ40NV2QLEJNI3KK0LPUPFE35QOT2",
                    "high_descs":[
                        "Turn left  cross the room then turn right go to the desk",
                        " Pick up the credit card on the edge of the desk ",
                        "Look up and face the bowl on the desk",
                        "Put the credit card in the bowl on the same desk",
                        "Pick up the bowl with credit card",
                        "Turn right then head to the right side of the study table",
                        "Put the bowl with credit card on the study table "
                    ],
                    "task_desc":"Put the bowl with credit card on the study table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3X31TUMD70DA8DOE5PLNW2SPGHSL17",
                    "high_descs":[
                        "Turn around and take two steps then turn right to walk to the desk with a light on it.",
                        "Pick up the credit card that's in front of you.",
                        "Look up at the bowl near the wall.",
                        "Put the credit card in the bowl near the wall.",
                        "Pick up the bowl with the credit card in it.",
                        "Turn around and take a step then turn left and walk to the right side of the desk and stand facing it to the left of the alarm clock.",
                        "Put the bowl on the desk slightly to the right of the chair."
                    ],
                    "task_desc":"Put a bowl with a credit card in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3YGXWBAF738YX8RRFUBQRH95YSD4CC",
                    "high_descs":[
                        "Turn around and walk to the small desk on the right. ",
                        "Pick up the credit card in front of the pencil. ",
                        "Look at the back of the desk. ",
                        "Put the credit card in the bowl to the left of the lamp. ",
                        "Pick up the bowl from the desk. ",
                        "Walk over to the right side of the desk to the right. ",
                        "Put the glass bowl on the desk to the left of the keys. "
                    ],
                    "task_desc":"To put a credit card in a bowl and put the bowl on the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-SideTable-307/trial_T20190909_145133_564616/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3SITXWYCNY06L5NVL5H0D80L9JTBX0",
                    "high_descs":[
                        "Turn left and walk over to the bookcase, then turn left and walk up to the wooden desk.",
                        "Pick up the red credit card off of the wooden desk.",
                        "Turn left and walk forward, then turn right to face the wooden desk.",
                        "Put the credit card in the glass bowl that's on the desk.",
                        "Pick up the glass bowl with the credit card in it off of the desk.",
                        "Walk over to the small wooden table to the left of the desk.",
                        "Put the bowl with the credit card in it on the wooden table."
                    ],
                    "task_desc":"Put a glass bowl with a credit card in it on a wooden table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3VZLGYJEYO1233QBRJX3ZQ7O0LYXZ9",
                    "high_descs":[
                        "Turn left, head to the TV, turn left, move to the desk.",
                        "Pick up the red credit card on the desk. ",
                        "Bring the credit card to the left side of the desk.",
                        "Put the credit card in the bowl on the desk. ",
                        "Pick up the bowl with credit card on the desk. ",
                        "Bring the bowl with card to the table with a lamp on it, left of that desk.",
                        "Put the bowl with card on the table. "
                    ],
                    "task_desc":"Put the bowl with card on the table with the lamp. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2DN53DIE3049T_33SA9F9TR0LP38UPLRN4CXSZ3D5WEV",
                    "high_descs":[
                        "Turn to the left, walk to the desk on the left side of the room",
                        "Pick up the credit card on the desk",
                        "Turn to the left, walk to where the plate is on the desk",
                        "Place the credit card on the plate on the desk",
                        "Pick up the credit card and the plate from the desk",
                        "Turn to the left, walk to the second desk on the right",
                        "Place the credit card and plate on the desk"
                    ],
                    "task_desc":"pick up credit card and plate",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-SideTable-307/trial_T20190909_145014_643118/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3ERMJ6L4D1J8PHL1UH3BXPYRJPS7M0",
                    "high_descs":[
                        "Turn right, move to the small desk with the lamp on it.",
                        "Pick up the red credit card on the desk. ",
                        "Bring the card to the larger desk on the right.",
                        "Put the card in the bowl on the desk.",
                        "Pick up the bowl with card on the desk.",
                        "Bring the bowl with card to the small desk on the left.",
                        "Put the bowl with card on the back of the small desk, left of the lamp."
                    ],
                    "task_desc":"Put a bowl with a card in it on the small desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3EWIJTFFVRYWVIT4SKUJ52JV2800E7",
                    "high_descs":[
                        "turn right, walk to desk",
                        "pick up the credit card that is on the desk",
                        "turn right, walk forward, turn left to face the other desk",
                        "put credit card in bowl that is on the desk",
                        "pick up the bowl that is on the desk with card in it",
                        "move a few steps to the left to face the smaller desk",
                        "put the bowl with the card in it on the desk"
                    ],
                    "task_desc":"put bowl with credit card in it on desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3GDTJDAPVX2CPVQK4MVHBPUMU8SM8U",
                    "high_descs":[
                        "Turn right and walk to the small wooden table.",
                        "Pick up the red credit card from the right side of the table behind the small lamp.",
                        "Turn around and walk to the large wooden desk on the left.",
                        "Put the credit card inside the clear container on the desk.",
                        "Pick up the clear container with the card inside from the desk.",
                        "Turn around and walk to the small wooden table on the right.",
                        "Put the container with the card to the left of the small lamp on the table."
                    ],
                    "task_desc":"Place a container with a card on a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-SideTable-307/trial_T20190909_144724_449929/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3L70J4KAZJDN4PDMORGSOQDNBJVAD1",
                    "high_descs":[
                        "Move to the smaller desk with a lamp on it, to your right.",
                        "Pick up the red credit card on the desk. ",
                        "Bring the credit card to the larger desk on the right.",
                        "Put the card in the gray bowl on the desk.",
                        "Pick up the bowl with card on the desk. ",
                        "Bring the bowl with card to the smaller desk on the left.",
                        "Put the bowl with card on the desk, left of the CD."
                    ],
                    "task_desc":"Put a bowl with a credit card in it on the small desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3NJM2BJS4ZXKM1DADE3EUFK0P40PCB",
                    "high_descs":[
                        "Turn around and move forward, then turn left to go to the desk with the lamp on it.",
                        "Pick up the credit card from the desk.",
                        "Turn around and step forward, then turn left and go toward the book case, then turn left to face the desk.",
                        "Put the credit card in the bowl on the desk.",
                        "Pick up the bowl from the desk.",
                        "Return to the desk with the lamp, to your left.",
                        "Place the bowl on the desk."
                    ],
                    "task_desc":"Put a bowl with a credit card in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3QIYRE09Y680WDRZH2129UWELSFN1U",
                    "high_descs":[
                        "Turn right and cross the room to face the card on the desk.",
                        "Pick up the card on the desk.",
                        "Take a step to the right to face the computer desk.",
                        "Place the card in the bowl on the computer desk.",
                        "Pick up the bowl on the computer desk.",
                        "Step to the left to face the desk.",
                        "Place the bowl on the desk."
                    ],
                    "task_desc":"To put a card in a bowl plus move them to the left desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard",
                "Desk"
            ]
        },
        "train/look_at_obj_in_light-Pencil-None-DeskLamp-307/trial_T20190909_014346_726857/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3GNCZX450LEWTMGCT07NOKUCPSAPAM",
                    "high_descs":[
                        "Walk forward across the room to the window.",
                        "Pick up the yellow pencil near the window.",
                        "Turn around, walk forward slightly, then turn left and walk to the lamp on the desk.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a pencil by the light of a desk lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_3K4J6M3CXHKQG9NDQHH0UBGKO1HGA3",
                    "high_descs":[
                        "move forward to the white cabinet that is below the window",
                        "pick up the yellow pencil that is to the left of the green pencil from the top of the cabinet",
                        "turn around and move a few steps to the small desk on the left, turn to the left to face the desk",
                        "turn on the lamp that is in the left back corner of the smaller desk"
                    ],
                    "task_desc":"examine a pencil by the light of the lamp on the smaller desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3ZY8KE4ISMU1LMKP48D8KCYZFYNVQA",
                    "high_descs":[
                        "Go across the room to the chest under the window. ",
                        "Pick up the pencil to the right of the chest board, on the chest. ",
                        "Turn around and go to the left side of the desk to your left.",
                        "Turn on the lamp in the right, back corner of the desk. "
                    ],
                    "task_desc":"Turn on the desk lamp. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_two_obj_and_place-Laptop-None-Desk-307/trial_T20190909_005000_349735/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_3FPRZHYEP1Y9ELEN6X1C745O5323V2",
                    "high_descs":[
                        "Move forward, then right and face the bed on your right.",
                        "Take the lap top from the bed in front of you.",
                        "Turn right and face the brown desk in front of you.",
                        "Place the lap top on the brown desk in front of you.",
                        "Turn around and face the bed in front of you.",
                        "Close the lap top on top of the bed in front of you and take it.",
                        "Turn around and face the brown desk in front of you. ",
                        "Place the lap top on the desk in front of you."
                    ],
                    "task_desc":"Place lap tops on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Desk-307/trial_T20190909_075126_209289/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_34HJIJKLP8NUWHXR6B6VH9XUJ6H4VD",
                    "high_descs":[
                        "Turn to the right then left and go forward to the desk.",
                        "Pick up the pencil from the desk. ",
                        "Step to the right and go to the other desk. ",
                        "Place the pencil on top of the desk."
                    ],
                    "task_desc":"Move a pencil to a different desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3IXQG4FA2WPGK95XIPBMX5E326E9B7",
                    "high_descs":[
                        "Turn to your right and go across the room to the small desk across from you. ",
                        "Pick up the pencil in front of the lamp, on the small desk. ",
                        "Move over to the far, left end of the large desk. ",
                        "Place the pencil on the large desk, to the right of the laptop. "
                    ],
                    "task_desc":"Put a pencil on the large desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3XCC1ODXDO29SF38VO8YJF9WUSMRQP",
                    "high_descs":[
                        "Turn around and walk to the middle of the room then turn left and walk to the desk.",
                        "Pick up the yellow pencil from in front of the white lamp.",
                        "Turn right and walk to the map then turn left to face the desk.",
                        "Put the pencil on the desk next to the right side of the laptop."
                    ],
                    "task_desc":"Put a pencil next to a laptop.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Desk-307/trial_T20190907_143649_550638/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_3ERMJ6L4D1904SZ3Y9EUW3EPP3DM7V",
                    "high_descs":[
                        "Turn around and walk over to the desk on the other side of the room. ",
                        "Take the credit card in front of the books on the second shelf. ",
                        "Look down at the desk below the shelf. ",
                        "Place the credit card on the edge of the desk between the two pencils. "
                    ],
                    "task_desc":"To retrieve a credit card and place it on the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3VE8AYVF8PEYYWC5MR2NFDQB2LWF8Q",
                    "high_descs":[
                        "turn around and walk to the end of the room",
                        "pick the credit card up off of the top of the desk",
                        "move to the left a bit and face the desk again",
                        "place the credit card down on the lower part of the desk"
                    ],
                    "task_desc":"place a credit card down on top of the lower part of the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"APRZ7BR8C0ZMQ_3YDGXNSEO2BO0GFG2A64O9TKDVK48O",
                    "high_descs":[
                        "Go to the desk.",
                        "Pick up the credit card, lying flat on the front part of the top shelf of the desk.",
                        "Take the credit card to the lower part of the desk.",
                        "Set the credit card on the main flat surface of the desk between the 2 pencils."
                    ],
                    "task_desc":"Move the credit card from the top shelf of the desk to the main surface of the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Desk-307/trial_T20190907_143724_810881/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_34HJIJKLP8DMBSBTA3HEGNDSPWF4VU",
                    "high_descs":[
                        "turn right and walk to the end of the left side of the desk at the end of the room and turn right to face it",
                        "grab a credit card off of the desk there",
                        "turn right to walk past the desk, then turn left to walk to the end of the room, then turn left",
                        "place the credit card down on the top of the desk on the right"
                    ],
                    "task_desc":"place a credit card down on the larger desk in the room",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3PM8NZGV81XL4M3M8FP97BBI1XFXQE",
                    "high_descs":[
                        "Move to the wood desk so that you are facing the black books on the desk",
                        "pick up the red credit card to the left of the books",
                        "carry the credit to the other desk on the right ",
                        "Place the credit card to the right of the silver remote"
                    ],
                    "task_desc":"Place a credit card on top of the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3XLBSAQ9Z7T03ZYMDY4O45AY47MZ7G",
                    "high_descs":[
                        "Turn right and walk to the desk on the left.",
                        "Pick up the credit card from the desk.",
                        "Walk to the larger desk on the right.",
                        "Put the credit card on the larger desk, to the right of the closest remote control."
                    ],
                    "task_desc":"Move a credit card from one desk to an adjacent desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Desk",
                "Laptop"
            ]
        },
        "train/pick_two_obj_and_place-AlarmClock-None-Desk-307/trial_T20190907_013719_752378/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJNQ2PBD07FKE_3MMN5BL1W2LI39YGWXB4JM29JNJM3P",
                    "high_descs":[
                        "Turn around, go forward and at the wall take a right and head towards the desk.",
                        "Pick up the clock off of the desk",
                        "Turn right and head towards the other desk on your left.",
                        "put the clock on that desk.",
                        "Turn around and head back to the first desk.",
                        "pick up the other clock off of the desk.",
                        "Turn right and then left and go back to the other desk",
                        "put the clock on the other desk. "
                    ],
                    "task_desc":"re arranging clocks in a room.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3T111IHZ5H7VFR0OIE8VWYZ5P2V9RK",
                    "high_descs":[
                        "Turn around and walk across the room the the small desk by the recycling bin",
                        "Pick up the alarm clock from the front right edge of the desk",
                        "Turn right and walk to the larger desk toward the book shelf",
                        "Put the alarm clock on the desk left of the cell phone",
                        "Turn left and walk over to the far side of the small desk",
                        "Pick up the remaining alarm clock from the desk",
                        "Walk back over to the larger desk",
                        "Put the alarm clock on the desk right of the other alarm clock"
                    ],
                    "task_desc":"Move the alarm clocks from the small desk to the large desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/look_at_obj_in_light-Cloth-None-DeskLamp-307/trial_T20190907_133721_464394/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3VA45EW49Q4AT95DM9CYNXCHHON1O1",
                    "high_descs":[
                        "Move to the left and pick up the white rag on the ground. ",
                        "Pick up the white rag on the ground. ",
                        "Turn around and bring the rag to the lamp on the desk.",
                        "Turn on the lamp on the desk. "
                    ],
                    "task_desc":"Examine the white rag by the light of the lamp on the desk. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3Z9WI9EOZ2527T5CQ6NQ83BFE9IKHA",
                    "high_descs":[
                        "Look on the floor, turn to your left then turn to your right",
                        "Pick up the white cloth on the floor beside the green cloth",
                        "Turn to your right and walk across the room, then head to the desk with a lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine the cloth by the light ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3TOK3KHVJWZO4VKFBPT7O73UKBU7OD",
                    "high_descs":[
                        "Take a step to the left and look at the floor in front.",
                        "Pick up the white towel from the floor.",
                        "Turn right and head towards the lamp on the desk.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a white towel next to the light of a desk lamp.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3YDGXNSEO2BO0GFG2A64O9TKEA1844",
                    "high_descs":[
                        "Take a half a step to your left.",
                        "Pick up the white cloth to the right of the green cloth.",
                        "Turn around and take a step then turn left to walk to the desk with the chair and two alarm clocks on it by a light.",
                        "Turn on the light."
                    ],
                    "task_desc":"Inspect a cloth in the lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6SR4BU227GUH_3NVC2EB65TGIXQNUF0ZFDHPGTNK3Y0",
                    "high_descs":[
                        "Turn to the left and look down at the floor.",
                        "Pick up the white cloth next to the green cloth.",
                        "Turn right and face the desk to the right of the recycling bin.",
                        "Switch on the lamp on the desk above the alarm clock."
                    ],
                    "task_desc":"Retrieve a cloth and bring it to a lit desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-Pen-None-Drawer-307/trial_T20190919_075916_872303/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36A780ODXBDEH_3PPTZCWALTBIU6PZ552B5IBV397ZQS",
                    "high_descs":[
                        "Turn around and go to the small desk with the lamp on it.",
                        "Pick up the pen to the left of the clock nearest to you.",
                        "Turn around, turn left and then face the large desk against the wall on the right.",
                        "Open the top desk drawer and put the pen inside the drawer.",
                        "Turn right and get closer to the large desk.",
                        "Pick up the pen on this large desk.",
                        "Back away from the desk to face the desk drawers.",
                        "Place this pen inside the top desk drawer."
                    ],
                    "task_desc":"Move the pens from the small desk and the large desk into the top large desk drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_two_obj_and_place-Pen-None-Drawer-307/trial_T20190909_055453_986512/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3ZWMVK6GNTJ8_3GM6G9ZBKQOVNFI87K6C2LQ98C0MTO",
                    "high_descs":[
                        "Turn around and move to the small desk on the left side of the bookshelf.",
                        "Pick up the black pen on the desk between the two yellow pencils.",
                        "Turn to your right and go to the desk at the end of the room.",
                        "Open the top drawer and place the pen inside and close it.",
                        "Find the pen next to the clock on top of the desk.",
                        "Pick up the pen off the top of the desk.",
                        "Find the drawer where you place the other pen in the desk.",
                        "Open the top drawer and place the pen inside and close it."
                    ],
                    "task_desc":"Get the black pens and place in the top drawer of the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Desk-307/trial_T20190907_072303_146844/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3CP1TO84PWIVAKHR0YGDJAMVS0U25E",
                    "high_descs":[
                        "Walk forward to the small desk in front of you",
                        "Pick up the middle alarm clock from the desk",
                        "Turn right and walk to the right side of the larger wooden desk",
                        "Put the clock down on the desk just right of the book"
                    ],
                    "task_desc":"Put the alarm clock on the large wooden desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3ZAZR5XV04Z6FGTI4FCZKR2C5Q5ZCH",
                    "high_descs":[
                        "take a right and walk over to the small desk on the left",
                        "take an alarm clock off of the desk there",
                        "move over to the right side of the room and turn left to face the right side of the larger desk",
                        "place the alarm clock down on the desk there"
                    ],
                    "task_desc":"place an alarm clock down on the larger desk in the room",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_39ZSFO5CABDC1V5E8KUDQ30STZBUJR",
                    "high_descs":[
                        "Walk up to the small desk that is in front of you. ",
                        "Pick up the alarm clock that is in the middle of the other two. ",
                        "Turn right and head over to the desk.",
                        "Place the alarm clock down on the desk."
                    ],
                    "task_desc":"Move an alarm clock to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3TDXMTX3CEBV49V7UKBAYW7CDY26IN",
                    "high_descs":[
                        "Go straight to the small wooden desk with clocks on it. ",
                        "Grab the alarm clock closest to the back wall and beside the lamp. ",
                        "Turn to your right and walk to the end of the desk. ",
                        "Place the alarm clock on the desk, above the drawers. "
                    ],
                    "task_desc":"Put an alarm clock on the desk in the corner, above the drawers. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Desk-307/trial_T20190907_072317_014092/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3JBT3HLQFBJP952M9KY54R1J46GPZB",
                    "high_descs":[
                        "turn around and walk forward stop to face the small table to the left of the desk",
                        "pick up an alarm clock that is on the desk",
                        "turn to the right, walk forward, stop at the far end of the desk, face the desk to the left",
                        "put the alarm clock on to the desk"
                    ],
                    "task_desc":"move an alarm clock from a table to a desk",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_39N5ACM9HH4A3EK95M46R3ZQPZ2P9Y",
                    "high_descs":[
                        "Move to the desk that has three clocks sitting on top of it",
                        "Pick up the clock that is on the far right on top of the desk",
                        "Carry the clock to the larger desk on the left where the phone is sitting ",
                        "Place the clock on the desk to the right of the phone"
                    ],
                    "task_desc":"Carry a clock to the desk to place on top of the desk",
                    "votes":[
                        0,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3DQQ64TANJ2LFAXHYXEY5N71N70WPM",
                    "high_descs":[
                        "Turn around and face the desk on the left. ",
                        "Pick up the alarm clock that's closest to the lamp. ",
                        "Walk over to the right side of the desk that's on the right. ",
                        "Place the alarm clock to the right of the cell phone. "
                    ],
                    "task_desc":"Move one alarm clock to the other desk. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3ATTHHXXWD58NOF3V7K0Y9KWAZWIXI",
                    "high_descs":[
                        "Turn around and go to the smaller desk.",
                        "Pick up an alarm clock.",
                        "Move to stand in front of the larger desk on the right.",
                        "Put the alarm clock on the desk."
                    ],
                    "task_desc":"Put an alarm clock on the large desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-Desk-307/trial_T20190907_072329_828593/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3CFJTT4SXW7E899CDUG24A788VC7IL",
                    "high_descs":[
                        "Move to the desk on the right facing the alarm clock",
                        "Pick up the alarm clock that is sitting on top of the desk",
                        "Carry the alarm clock to the other desk to the left ",
                        "Place the alarm clock on top of the CD that is closest to the book"
                    ],
                    "task_desc":"Carry an alarm clock to place on top of a CD that is on top of a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3U84XHCDIFU3KCG3B06H1TQOD754ZE",
                    "high_descs":[
                        "Turn to the left and take one step then turn to the right to face the desk. ",
                        "Take the alarm clock next to the keys.",
                        "Turn to the right and walk across the room, then turn left.",
                        "Place the alarm clock on top of the CD that is next to the book."
                    ],
                    "task_desc":"To put the alarm clock on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3Y5140Z9D0X3EFDC9GAJ4WYT8SMPIK",
                    "high_descs":[
                        "Take a step to your left so you're standing in front of the alarm clock.",
                        "Pick up the alarm clock please.",
                        "Take two steps to your right so you standing in front of a book with a phone to the left of it.",
                        "Put the alarm clock on the left CD."
                    ],
                    "task_desc":"Put an alarm clock on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "AlarmClock",
                "Desk"
            ]
        },
        "tests_seen/trial_T20190907_143702_923249/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to the left and walk halfway across the room, then turn right and walk over to the desk. ",
                        "Take the credit card on the near edge of the table, next to the glass bowl. ",
                        "Turn to the right and walk across the room, then turn left and face the desk. ",
                        "Place the credit card on the edge of the table, to the right of the remote control. "
                    ],
                    "task_desc":"To move a credit card to a desk. "
                },
                {
                    "high_descs":[
                        "turn left and walk to the end of the room, then turn right and walk over to the desk at the end of the room",
                        "grab the bottom right credit card of the four credit cards on the desk there",
                        "take a right and walk to the end of the room, then turn left to face the right side of the larger desk",
                        "place the credit card down on the right side of the desk top"
                    ],
                    "task_desc":"place a credit card on the right side of the larger desk"
                }
            ],
            "relative_objects":[
                "Desk",
                "CreditCard",
                "Pen"
            ]
        },
        "tests_seen/trial_T20190907_133706_723900/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move to the mirror to the left of the window.",
                        "Pick up the green rag from the floor.",
                        "Move to the desk ahead and to the right of you.",
                        "Turn on the lamp on the desk."
                    ],
                    "task_desc":"Inspect the green rag with the lamp on the desk."
                },
                {
                    "high_descs":[
                        "Go to the left and stand above the green blanket on the floor.",
                        "Pick the green blanket up from the floor.",
                        "Go to the right and then stand in front of the small table wit the lamp.",
                        "Turn the lamp on the small table on."
                    ],
                    "task_desc":"Turn a lamp on with a blanket in hand."
                },
                {
                    "high_descs":[
                        "Move over to the mirror on the wall and face the rags on the floor. ",
                        "Pick up the green rag on the floor. ",
                        "Bring the green rag to the lamp on the desk. ",
                        "Turn on the light on the desk."
                    ],
                    "task_desc":"Examine the green rag by the light of the lamp on the desk. "
                },
                {
                    "high_descs":[
                        "Turn to the right and then right again to go past the bed toward the window.",
                        "Pick up the green cloth on the floor.",
                        "Carry the green cloth across the room and turn left to find the small table.",
                        "Hold the cloth and turn on the lamp."
                    ],
                    "task_desc":"Pick up a cloth and turn on the lamp."
                },
                {
                    "high_descs":[
                        "Turn right, then walk across the room until you get to the mirror.",
                        "Pick up the green cloth from in front of the mirror.",
                        "Walk to the desk to your left.",
                        "Turn on the lamp on the desk."
                    ],
                    "task_desc":"Turn on a lamp while holding a cloth."
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "RemoteControl",
                "Pencil",
                "CellPhone",
                "Cloth"
            ]
        },
        "tests_seen/trial_T20190919_040146_329866/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and veer left to the right side of the desk. ",
                        "Pick up the red credit card on the desk.",
                        "Place the card in the bowl.",
                        "Pick up the bowl.",
                        "Walk right and straight around the desk.",
                        "Place the bowl on the desk to the right of the laptop."
                    ],
                    "task_desc":"Place a bowl with a credit card in it on a desk."
                },
                {
                    "high_descs":[
                        "Turn right, proceed to wall.  Turn left to face desk.",
                        "Pick up credit card from behind the stack of books on the desk.",
                        "Place credit card on clear bowl on left side of desk.",
                        "Pick up bowl with credit card on it.",
                        "Turn right and move to end of desk.  Turn left, proceed to wall and turn left to face the end of the desk.",
                        "Place bowl with credit card on desk, to the left and below the other credit card."
                    ],
                    "task_desc":"Move to desk, put credit card in bowl, move bowl and credit card to other credit card."
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "tests_seen/trial_T20190909_075104_529646/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Go to the right side of the small desk in front of you. ",
                        "Pick up the pencil to the right of the book on the small desk. ",
                        "Turn to your right and walk to the wall across from you and turn to the large desk on your right. ",
                        "Place the pencil in front of the remote, on the large desk. "
                    ],
                    "task_desc":"Put a pencil on the large desk. "
                },
                {
                    "high_descs":[
                        "Turn right and walk slightly forward, then turn left and walk towards the lamp on the desk.",
                        "Pick up the pencil on the desk near the lamp.",
                        "Turn right and walk to the center of the desk on the right.",
                        "Put the pencil on the front of the desk, in front of the remote control."
                    ],
                    "task_desc":"Move a pencil from one desk to an adjacent desk."
                },
                {
                    "high_descs":[
                        "Turn right and walk to the wooden desk on the left.",
                        "Pick up the pencil in front of the lamp on the left desk.",
                        "Turn around, turn left to face the book case and walk to the side of the wooden desk closest to the wall on the left.",
                        "Put the pencil in front of the remote control on the desk."
                    ],
                    "task_desc":"Place a pencil on a desk."
                }
            ],
            "relative_objects":[
                "Pencil",
                "Desk"
            ]
        }
    }
}