{
    "scene_name":"FloorPlan210",
    "trials":{
        "train/pick_and_place_with_movable_recep-KeyChain-Box-ArmChair-210/trial_T20190908_014922_148721/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3GU1KF0O4LITR7Z636I2I9UGDLFBPC",
                    "high_descs":[
                        "Take a step to the right and face the dresser.",
                        "Pick up the keys from on top of the dresser.",
                        "Carry the keys and turn around, then left, to find the coffee table.",
                        "Place the keys in the box on the coffee table.",
                        "Pick up the box from the coffee table.",
                        "Carry the box and turn to the left to find the black chair.",
                        "Place the box on the black chair."
                    ],
                    "task_desc":"Move keys and a box to a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_37FMASSAYF81ALC2QBSI9CT4R5JBIV",
                    "high_descs":[
                        "Take the keys from in front of the TV",
                        "Turn around, head across the room",
                        "Face the box on top of the ottoman",
                        "Put the keys in the box",
                        "Pick up the box from the ottoman",
                        "Turn around, head to the black chair",
                        "Put the box on the black chair"
                    ],
                    "task_desc":"Put the keys in the box, put the box on the black chair",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3DHE4R9OCZSTQH6BHUZ4N7DKIOI2G0",
                    "high_descs":[
                        "move forward towards the television stand",
                        "pick up the keys on the stand",
                        "turn around towards the center table",
                        "drop the key in the carton on the table",
                        "pick up the carton from the table",
                        "turn around and head for the chair",
                        "place the carton on the chair"
                    ],
                    "task_desc":"place a carton with a key in it on the chair",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-ArmChair-210/trial_T20190908_014757_582805/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3D4CH1LGEDA4Q1RA23EJXULYOVEG9U",
                    "high_descs":[
                        "Turn left, walk to the flower pot, turn left to the window, and then turn right to face a dresser.",
                        "Pick up the set of keys on the dresser.",
                        "Turn around, head straight to the middle of the room, and then turn left towards an ottoman on your left.",
                        "Place the set of keys in the box on the ottoman.",
                        "Pick up the box from the ottoman.",
                        "Turn around and head towards the black sofa chair.",
                        "Place the box on the chair."
                    ],
                    "task_desc":"Place a box with a set of keys from the dresser on the black sofa chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3VSOLARPKEQ3WPFM7O7ZE0WPKP693A",
                    "high_descs":[
                        "Turn left and walk towards the curtains, turn left at the curtains, turn right at the curtains and face the wooden dresser. ",
                        "Pick up the keys to the left of the remote. ",
                        "Turn around and walk to the ottoman in front of the couch with the open box. ",
                        "Put the keys inside of the box. ",
                        "Pick up the box on the ottoman. ",
                        "Turn around to face the black chair. ",
                        "Place the box on the black chair. "
                    ],
                    "task_desc":"Put the keys in a box and put the box on the black chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3WZ36BJEV6XRJZSDKNRMNJVD2PBTBC",
                    "high_descs":[
                        "move to the dresser in between the two windows",
                        "pick up the keys from the dresser",
                        "move to the coffee table behind you",
                        "put the keys in the box on the table",
                        "pick up the box from the table",
                        "move to the chair to the left",
                        "put the box on the chair"
                    ],
                    "task_desc":"Put a box with a watch on a arm chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Watch",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-ArmChair-210/trial_T20190908_015056_840775/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2ALWT2BUSXD83_36DSNE9QZ8FHOQLHCYI4RX83BM1OJ4",
                    "high_descs":[
                        "Turn to your right and walk to the ottoman. ",
                        "Pick up the keys on the ottoman.",
                        "Walk to the side of the ottoman closest to the sofa. ",
                        "place the keys in the box on the ottoman.",
                        "Pick up the box on the ottoman.",
                        "Turn to your left and walk to the sofa chair.",
                        "Place the box on the sofa chair."
                    ],
                    "task_desc":"Place a box with keys in it on the sofa chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_39PAAFCODPH6SDQJP4IMOVPK5HNVTG",
                    "high_descs":[
                        "Turn right and walk across the room, then turn left and take a step and turn right to face the ottoman on the floor.",
                        "Pick up the keys on the ottoman.",
                        "Turn left and take a step, then turn right and face the box on the ottoman to the right.",
                        "Place the keys in the box on the ottoman.",
                        "Pick up the box with the keys in it.",
                        "Walk around the ottoman and go forward to face the black chair.",
                        "Place the box with keys in it on the black chair."
                    ],
                    "task_desc":"To put keys in a box as well as move them from the ottoman to the Black chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3ZPPDN2SLYD66NVJW8OVXR0MBFL9ES",
                    "high_descs":[
                        "Turn right and walk to the plant then turn right and take a step then turn right to face the ottoman.",
                        "Pick up the keys off of the ottoman.",
                        "Turn left and walk past the ottoman then turn right and walk to the box on the ottoman.",
                        "Put the keys in the box.",
                        "Pick up the box with the keys in it.",
                        "Turn left and walk to the black chair.",
                        "Put the box on the black chair."
                    ],
                    "task_desc":"Put a box that has keys in it on the chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Pillow",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-210/trial_T20190907_050813_790433/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"APRZ7BR8C0ZMQ_3RYC5T2D76AG7EGVZ34SIOZKUJ7RPH",
                    "high_descs":[
                        "Go to the footstool in the middle of the room.",
                        "Pick up the keys that sit on the footstool.",
                        "Take the keys to the light in the corner of the room.",
                        "Leave the keys on the light switch on the side of the light, turning on the light when you do this."
                    ],
                    "task_desc":"Take the keys from the footstool at the middle of the room, put them on the switch of the light in the corner of the room turn the light on while doing so.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3PM8NZGV81XL4M3M8FP97BBI0WIQX7",
                    "high_descs":[
                        "Walk straight to the ottoman, turn right to the computer",
                        "Grab the key chain on it",
                        "Turn left, walk across the room to the corner with a floor lamp",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Grab the key chain from the ottoman, turn on the floor lamp",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3Z7EFSHGNCVHALT33XOEN6M1XITCX3",
                    "high_descs":[
                        "Turn left, then turn right, then go forward and turn right to face the ottoman.",
                        "Pick up the keys on the ottoman, in front of the computer.",
                        "Turn left, then turn right, then turn left, then turn right, to go to the lamp that is next to the sofa.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at keys in the light.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-Watch-None-FloorLamp-210/trial_T20190908_032733_263333/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_33IZTU6J84IXH2IZ0JEE2BQJJ8JXSW",
                    "high_descs":[
                        "go to the dresser",
                        "take the ring sitting on top of the dresser by the t.v.",
                        "take the ring to the stand with the lamp",
                        "turn on the lamp "
                    ],
                    "task_desc":"get a ring and turn on a lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AUTYWXILTACCR_3LPW2N6LKWJ4UWQTJIQJPTHNB615UH",
                    "high_descs":[
                        "Walk straight, turn left at the ottoman, and walk to the entertainment stand.",
                        "Pick up the watch from the right of the entertainment stand.",
                        "Turn around and walk to the lamp in the left side of the room.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Turn on a lamp while holding a watch.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3634BBTX0RBRN2OIVDEES2KP65KIFX",
                    "high_descs":[
                        "move left towards the television stand",
                        "pick up the watch from the stand",
                        "turn around and head to the lamp stand",
                        "put on the lamp stand"
                    ],
                    "task_desc":"put on a lamp stand while holding a watch",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_and_place_simple-Newspaper-None-Ottoman-210/trial_T20190907_144848_204708/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_35GCEFQ6I85I2GXZBM1YROYIZD93Z4",
                    "high_descs":[
                        "Turn around, hang a right just before the brown ottoman, head left at the couch and turn left to face the left side of the couch.",
                        "Pick up the newspaper on the far left corner of the couch.",
                        "Turn left, walk to the wall, hang a left and turn left at the plant to face the ottoman.",
                        "Put the newspaper on the left corner between two laptop computers on the ottoman."
                    ],
                    "task_desc":"Place a newspaper on the ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3BF51CHDTYR0U3Y8MDD8PJW60BM0HU",
                    "high_descs":[
                        "Turn around and head to the ottoman, turn right and head to the couch, turn left and go to the left side of the couch, face the couch. ",
                        "Pick up the newspaper on the left side of the couch. ",
                        "Turn around with the the newspaper and face the ottoman. ",
                        "Put the newspaper down on the ottoman behind the computer. "
                    ],
                    "task_desc":"Put a newspaper on the ottoman. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3CFVK00FWO2XUA3DFN8NQCZ4UU06LP",
                    "high_descs":[
                        "Move across the room to the left side of the largest sofa",
                        "Pick up the newspaper that is to the far left on the sofa",
                        "Carry the newspaper towards the left side of the ottoman",
                        "Place the newspaper behind the computer on the left on the ottoman"
                    ],
                    "task_desc":"Move a newspaper from the couch to the ottoman",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3I7DHKZYGQHFBET3OTVK3TGK1C75FP",
                    "high_descs":[
                        "Turn around and walk up to the left side of the couch",
                        "Pick up the left most newspaper from the couch",
                        "Move slightly left then turn back around to face the ottoman",
                        "Put the newspaper down on the ottoman behind the nearest laptop"
                    ],
                    "task_desc":"Put the newspaper on the ottoman",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3SB5N7Y3O6LMU73X27VQ4JK5LIKG00",
                    "high_descs":[
                        "Turn around and walk across the room until you reach the end of the coffee table., then turn to your right so you are facing the couch. ",
                        "Pick up the newspaper on the far left of the couch. ",
                        "Turn around so that you are facing the ottoman in front of the couch. ",
                        "Place the  newspaper on the ottoman, behind the laptop in the center of the ottoman. "
                    ],
                    "task_desc":"Put a newspaper on the ottoman, behind the computer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3WJ1OXY92DX325VXBBGV1CFK6LJ8A3",
                    "high_descs":[
                        "Move across the room to the left side of the large brown sofa ",
                        "Pick up the newspaper on the far left on top of the sofa",
                        "Carry the newspaper to the ottoman ",
                        "Place the newspaper on top of the ottoman between the laptops"
                    ],
                    "task_desc":"Move a newspaper to the ottoman",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/pick_two_obj_and_place-RemoteControl-None-Ottoman-210/trial_T20190906_202114_729948/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3W8CV64QJ5GIQXMLM9W1IUXZ2M6H9Q",
                    "high_descs":[
                        "Turn around and go between the couch and the foot stool, then face the couch.",
                        "Take the remote control from the couch cushion.",
                        "Go to the left, then turn facing the foot stool with the couch to the left.",
                        "Put the remote control on the bottom left corner of the couch cushion.",
                        "Go to the TV stand to the right.",
                        "Take the remote control from the TV stand.",
                        "Turn around, go to the left of the foot stool and face the foot stool.",
                        "Put the remote control next to the remote control on the foot stool."
                    ],
                    "task_desc":"Put remote controls on a foot stool.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Ottoman-210/trial_T20190909_021528_920592/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ALKQPW0O9C98N_3DH6GAKTY1GR38GLWFJ5I4EX2J5ZYE",
                    "high_descs":[
                        "Turn left and go to the laptop on the left on the couch",
                        "Close the lid and pick up the computer from the couch",
                        "Turn left until facing the ottoman",
                        "Put the computer on the ottoman above the remote control"
                    ],
                    "task_desc":"Put a laptop on an ottoman",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3HQUKB7LNI5JQSQ2GT9AWXFPGWYHHS",
                    "high_descs":[
                        "Step to the left then turn right and face the couch.",
                        "Pick up the laptop from the couch. ",
                        "Turn to the left and then turn around and face the ottoman.",
                        "Place the laptop on the ottoman."
                    ],
                    "task_desc":"Move a laptop to an ottoman. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3K772S5NPB276IZ0QS14BUICOGHEHK",
                    "high_descs":[
                        "Move to the left then face the middle of the large tan sofa",
                        "Pick up the laptop on the left side of the sofa",
                        "Carry the laptop to the ottoman in the middle of the room facing the newspaper",
                        "Place the laptop on the ottoman behind the remote"
                    ],
                    "task_desc":"Move a laptop to the ottoman",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Ottoman",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Ottoman-210/trial_T20190909_021456_923505/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A14IPKOBOPID9H_37UQDCYH60MRF4FA8942KLH4A8GV7X",
                    "high_descs":[
                        "Turn around and go just past the dresser that is on the right then turn left and go to the sofa",
                        "Close the laptop that is on the sofa then pick up the laptop",
                        "Turn left and go past the sofa, then turn left and go to the plant then turn left to face the ottoman",
                        "Put the laptop on the ottoman"
                    ],
                    "task_desc":"Move the laptop from the sofa to the ottoman",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_384PI804XVSX51YMTFEOUJNA3QHS0Q",
                    "high_descs":[
                        "Turn around, move over to the tan couch on the left..",
                        "Pick up the computer on the couch.",
                        "Turn left, bring the computer to the other side of the ottoman, turn around to face the black chair behind the ottoman.",
                        "Put the computer on the ottoman."
                    ],
                    "task_desc":"Put a computer on the ottoman. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3N1FSUEFL8R820X5FQ61BNRNJZMD4W",
                    "high_descs":[
                        "turn around and walk over to the couch on the left side of the room",
                        "grab the laptop off of the couch there",
                        "turn left and walk to the end of the room, then turn around to face the foot rest in front of the couch",
                        "place the laptop down on top of the foot rest to the left of the box"
                    ],
                    "task_desc":"place a laptop on top of the footrest",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Ottoman-210/trial_T20190909_021425_508275/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3JAOYWH7VLVSXIR9920GB8A8E009L2",
                    "high_descs":[
                        "Turn right and walk until you get to the wooden cabinet to your left then when you get to it turn right and walk to the couch.",
                        "Close the laptop and then pick it up.",
                        "Turn left and walk to the wall then turn left and walk to the plant then turn left to face the ottoman.",
                        "Put the laptop on the ottoman."
                    ],
                    "task_desc":"Put a closed laptop on the ottoman",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3VAR3R6G1SS0PYBWH2AU3TJRPZG8OM",
                    "high_descs":[
                        "Turn around completely then walk forward then turn right to face the couch. ",
                        "Close the laptop and pick it up from the couch. ",
                        "Turn to the left and turn left again to face the ottoman.",
                        "Place the laptop on the ottoman."
                    ],
                    "task_desc":"Move a laptop to the ottoman. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1T643M1P572AA_3W2LOLRXLE6NHC5DIJO1NTXNVMWRKZ",
                    "high_descs":[
                        "Turn right and move forward and then turn right and head to the couch",
                        "close the computer and then pick it up",
                        "turn left and move forward thenturn left 2 times",
                        "place the computer on the chair"
                    ],
                    "task_desc":"Pick up the computer from the couch and place it on the chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "Laptop"
            ]
        },
        "tests_seen/trial_T20190908_074451_643463/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and move to the laptop on the couch",
                        "Pick up the credit card from the couch",
                        "Turn left and move to the lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Pick up the credit card on the couch and turn on the light to see the credit card"
                },
                {
                    "high_descs":[
                        "Move across the room to the left side of the  large grey sofa",
                        "Pick up the blue credit card on the sofa",
                        "Carry the credit card to the left corner of the room where the floor lamp is",
                        "turn on the lamp"
                    ],
                    "task_desc":"carry a credit card while turning on a lamp"
                },
                {
                    "high_descs":[
                        "Walk to the sofa in front of the laptop.",
                        "Grab the card from the sofa.",
                        "Go to the tall lamp next to the sofa.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a credit card under a lamp."
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CreditCard"
            ]
        }
    }
}