{
    "scene_name":"FloorPlan22",
    "trials":{
        "train/pick_cool_then_place_in_recep-Apple-None-Microwave-22/trial_T20190908_000205_582040/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A13OOAT2ORKH6V_39KFRKBFIQC7JFGGYYJ71KNROPYOYK",
                    "high_descs":[
                        "Walk to the table ahead.",
                        "Grab the apple on the table.",
                        "Carrying the apple, turn around and walk to the fridge to your right.",
                        "Place the apple in the fridge to chill it, then remove it.",
                        "Carrying the cold apple, turn around and walk to the microwave to your right.",
                        "Place the cold apple on the plate in the microwave."
                    ],
                    "task_desc":"Place a cold apple on a plate in the microwave.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3HUTX6F6VX4HIUN95DCCSGMM9BEO2G",
                    "high_descs":[
                        "Walk around to the other side of the counter in front of you.",
                        "Pick up the apple on the counter.",
                        "Walk around the counter and ahead to the fridge.",
                        "Place the apple in the fridge to the left of the lettuce. Close the door, wait a moment, and take the apple out again.",
                        "Turn around and veer right to the microwave.",
                        "Place the apple in the microwave to the right of the glass."
                    ],
                    "task_desc":"Place a chilled apple in a microwave.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3PB5A5BD0YN0CI3HN6GZJYUST40G7Q",
                    "high_descs":[
                        "Walk left and forward to the left side of the rounded counter",
                        "Pick up the red apple from the counter",
                        "Turn right and walk over to the fridge",
                        "Put the apple into the fridge then remove it",
                        "Turn around and walk over to the microwave left of the dishwasher",
                        "Put the apple in the microwave"
                    ],
                    "task_desc":"Put the chilled red apple in the microwave",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Apple-None-Microwave-22/trial_T20190908_000314_718780/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3018Q3ZVOL79KAATAKMVSTAPWLARAH",
                    "high_descs":[
                        "Turn right and walk to the outside of the counter.",
                        "Pick up the red apple.",
                        "Turn right and walk ahead to the fridge.",
                        "Place the apple in the fridge to the left of the lettuce. Close the door, wait a moment, and take it out again. ",
                        "Turn around and veer right to the microwave.",
                        "Place the apple in the microwave."
                    ],
                    "task_desc":"Place a chilled apple in a microwave.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3JZLYQ606HJJR_35L9RVQFCRZGAPAOKKRSEQKDGFTHUB",
                    "high_descs":[
                        "Move to the white counter in the middle of the room with an apple on it. ",
                        "Pick up the apple that is close to the knife. ",
                        "Move across the room to fridge. ",
                        "Place the apple inside the fridge to cool.  Remove apple and close the fridge door. ",
                        "Turn left and move to the microwave.",
                        "Place the apple inside the microwave and close the door."
                    ],
                    "task_desc":"Cool an apple to be placed inside the microwave. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3F0BG9B9MS40Y9OHHC25QY1WYZNY71",
                    "high_descs":[
                        "Turn right, go forward, then turn right to face the counter.",
                        "Pick up the apple on the counter, next to the knife.",
                        "Turn right, go forward, turn left, go forward, then turn right and go to the fridge.",
                        "Chill the apple in fridge.",
                        "Turn around, go toward the coffee maker, then turn right and go to the microwave.",
                        "Put the apple in the microwave."
                    ],
                    "task_desc":"Put a cold apple in the microwave.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple"
            ]
        },
        "train/pick_heat_then_place_in_recep-AppleSliced-None-SinkBasin-22/trial_T20190906_194154_721408/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A10AVWALIHR4UQ_3J88R45B2JF04A2782AK76L8VPDPXA",
                    "high_descs":[
                        "Turn right and move to the counter near the window.",
                        "Pick up the knife with the gold handle from the counter.",
                        "Move around the counter to the right of the black stool in front of the window .",
                        "Slice the apple in the center of the counter using the knife.",
                        "Turn to the right, move towards the blue trash bin, then turn to the left, move towards the brown coffee maker, then turn to the right and move to the red microwave.",
                        "Open the microwave door and place the knife in front of the egg on the plate then close the microwave door.",
                        "Turn right, move toward the range, then turn right and move toward the window, then turn right and move to the black stool, then turn and face the counter.",
                        "Take one apple slice from the sliced apple.",
                        "Turn to the right, move towards the blue trash bin, then turn to the left, move towards the brown coffee maker, then turn to the right and move to the red microwave.",
                        "Open the microwave, place the apple slice on the plate to the left of the egg, microwave the slice, open the microwave door, take the apple slice from the plate, then close the microwave door.",
                        "Turn right, move towards the range, then turn left and face the sink.",
                        "Place the apple slice in the front of the sink between the fork and the spatula."
                    ],
                    "task_desc":"Place a cooked apple slice in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3MD9PLUKKLVP6KQ9T5LD02WO34ZZNY",
                    "high_descs":[
                        "Turn right, go straight to the counter.",
                        "Take the knife from the counter.",
                        "Go to the other side of the counter, facing towards the microwave.",
                        "Cut the apple on the counter into pieces.",
                        "Go around the counter to the right, then go straight to the microwave.",
                        "Put the knife in the microwave.",
                        "Turn around, go back across the room to the other side of the counter facing the microwave.",
                        "Take a piece of apple from the counter.",
                        "Go around the counter to the right, then go straight to the microwave.",
                        "Cook the apple in the microwave, take the apple from the microwave.",
                        "Turn right, go to the sink.",
                        "Put the apple in the sink between the fork and the spatula."
                    ],
                    "task_desc":"Put a cooked piece of apple in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3SNVL38CI79BQLUW4E9PXCEZ0WGKCX",
                    "high_descs":[
                        "Turn right and walk towards the counter.",
                        "Pick up the yellow knife from the counter.",
                        "Take a step to the left.",
                        "Slice the apple on the counter in three pieces.",
                        "Turn right, walk past the counter, and then turn left towards the microwave.",
                        "Open the microwave, place the knife in it, and close the microwave.",
                        "Turn back around towards the counter.",
                        "Pick up a slice of apple from the counter.",
                        "Turn around and head towards the microwave.",
                        "Open the microwave, place the apple in it, heat it up, and pick the apple back out.",
                        "Turn right and head towards the sink on your left.",
                        "Place the apple slice in between the spatula and fork in the sink."
                    ],
                    "task_desc":"Place a warm slice of apple in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple",
                "Pan",
                "Plate",
                "Sink"
            ]
        },
        "train/pick_heat_then_place_in_recep-AppleSliced-None-SinkBasin-22/trial_T20190906_193944_424506/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3K4J6M3CXHAIVK1FU9SJTPWIT53AGT",
                    "high_descs":[
                        "Turn right, walk towards the wall, turn left to face the counter.",
                        "Pick up the knife from the counter.",
                        "Turn right, head towards the sink, turn right towards the window, turn right towards the table.",
                        "Cut the apple on the table in three pieces.",
                        "Turn left towards the microwave.",
                        "Put the knife in the microwave and close it.",
                        "Turn around and head towards the table. ",
                        "Pick up a slice of apple.",
                        "Turn around and head towards the microwave.",
                        "Open the microwave, place the apple slice in it, heat it up, and take it out.",
                        "Head towards the sink on your right.",
                        "Place the slice of apple in the sink."
                    ],
                    "task_desc":"Place the slice of apple in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AHBWX3WYMAB0E_3NJM2BJS4ZNC1CRCH6EXTT0YU3OPCZ",
                    "high_descs":[
                        "Turn right and move to the end counter top on your right.",
                        "Pick up the knife.",
                        "Turn right and move to the other side of the peninsula just to the left of the knife.",
                        "Cut the apple into thirds.",
                        "Go right and around the peninsula to the microwave across the room.",
                        "Put the knife in the microwave and close the door.",
                        "Turn around and go back around the peninsula, stopping to the left of the knife.",
                        "Pick up one third of the apple.",
                        "Go right and then around the peninsula to the microwave across the room.",
                        "Put the apple in the microwave to the left of the glass, cook the apple for a few seconds and remove the apple from the microwave.",
                        "Move to the sink on your right.",
                        "Put the apple in the right front corner of the sink."
                    ],
                    "task_desc":"Place cooked one third apple into the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3V5Q80FXI08SW5UNMFSK4DOBDIX239",
                    "high_descs":[
                        "Turn right, go to the end of the counter, face the counter to the left of the microwave.",
                        "Take the knife from the counter.",
                        "Go straight, turn right at the sink, go straight and around the counter in between the window and the counter, face the counter.",
                        "Cut the apple on the counter.",
                        "Go around the counter to the right and straight to the microwave.",
                        "Put the knife in the microwave.",
                        "Turn around, go straight and around the counter in between the window and the counter, face the counter.",
                        "Take a piece of apple from the counter.",
                        "Go around the counter to the right and straight to the microwave.",
                        "Cook the apple in the microwave, take the apple from the microwave.",
                        "Turn right, go to the sink.",
                        "Put the apple in the sink."
                    ],
                    "task_desc":"Put a cooked piece of apple in a sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Sink",
                "Apple",
                "Knife"
            ]
        },
        "train/pick_heat_then_place_in_recep-AppleSliced-None-SinkBasin-22/trial_T20190906_194516_380304/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AT3C00TKZK13L_3E337GFOLCPPF3V43DXOFVGISKHGNE",
                    "high_descs":[
                        "Walk towards the counter next to the stove",
                        "Grab a knife from the counter",
                        "Walk with the knife towards the counter next to the stools",
                        "Slice the apple on the counter",
                        "Walk with the knife towards the microwave",
                        "Put the knife in the microwave",
                        "Walk towards the counter",
                        "Take a slice of the apple",
                        "Walk with the slice of the apple",
                        "Put the slice of apple inside the microwave and cook it",
                        "Walk to the right towards the sink",
                        "Set the slice of apple in the sink"
                    ],
                    "task_desc":"Slice the apple, put knife slice of apple in the microwave, set slice of apple in sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3LRKMWOKB8YTHY1G7MNT8ETQSFF2ZT",
                    "high_descs":[
                        "Turn left and move toward the silver dishwasher, then turn right and move to counter between the range and the refrigerator.",
                        "Pick up the knife between the salt shaker and the black toaster on the counter.",
                        "Turn right and move toward the gray door, then turn right and move to the black stools in the corner of the room next to the counter.",
                        "Use the knife to slice the apple next to the red credit card on the counter.",
                        "Turn right and move forward toward the blue trash bin then turn left and move to the red microwave to the left of the dishwasher.",
                        "Open the microwave and place the knife on the plate, then close the microwave.",
                        "Turn right and move towards the range then turn right and move toward the gray door, then turn right and move to the black stools next to the counter.",
                        "Pick up one apple slice from the sliced apple next to the red credit card and gray bowl.",
                        "Turn right and move forward toward the blue trash bin then turn left and move to the red microwave to the left of the dishwasher.",
                        "Place the apple slice to the rear of the knife on the plate in the microwave, microwave the apple slice, open the microwave door, pick up the apple slice from the plate, then close the microwave door.",
                        "Turn to the right and move toward the range then turn to the left and face the sink.",
                        "Place the apple slice in front of the gray plate in the sink."
                    ],
                    "task_desc":"Place a cooked apple slice in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3V26SBZTBGVJN94SWTW7VP3XDJ0ZZA",
                    "high_descs":[
                        "Go straight and to the left to the counter to the left of the fridge.",
                        "Take the knife from the counter.",
                        "Turn right, go to the door, turn right, go between the window and the counter, face the counter.",
                        "Cut the apple on the counter into pieces.",
                        "Go around the counter to the right and go to the microwave.",
                        "Put the knife in the microwave.",
                        "Turn around, go back to the area between the window and the counter and face the counter.",
                        "Take a piece of apple from the counter.",
                        "Go around the counter to the right and go to the microwave.",
                        "Cook the apple in the microwave, take the apple from the microwave.",
                        "Turn right, go to the sink.",
                        "Put the apple in the sink."
                    ],
                    "task_desc":"Put a cooked piece of apple in a sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple",
                "Knife"
            ]
        },
        "train/pick_clean_then_place_in_recep-LettuceSliced-None-Fridge-22/trial_T20190909_044131_951473/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AISNLDPD2DFEG_3B2X28YI3Z6T2Q3ZKI8ADVN1C7D6B4",
                    "high_descs":[
                        "Turn around, go forward, turn left to the counter",
                        "Pick up the knife on the counter",
                        "Turn around, go forward, turn left at the fridge",
                        "Slice the lettuce in the fridge",
                        "Turn down to the fridge",
                        "Put the knife in the fridge",
                        "Turn up to the fridge",
                        "Pick up a lettuce slice from the fridge",
                        "Turn around, go forward a bit, turn right and go to the sink",
                        "Put the lettuce slice in the sink, wash the lettuce slice with water, pick up the lettuce slice from the sink",
                        "Turn around, go forward, turn left at the fridge",
                        "Put the lettuce slice in the fridge"
                    ],
                    "task_desc":"Slice a lettuce, wash a slice and cool it",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3TVRFO09GN6IYE97CI6URBWQL4JLXR",
                    "high_descs":[
                        "Turn around and cross the room and turn left to face the knife on the counter.",
                        "Pick up the knife on the counter.",
                        "Turn around and walk forward and turn left to face the fridge.",
                        "Cut the lettuce in the fridge into slices.",
                        "Look up to face the fridge.",
                        "Place the knife in the fridge by the lettuce.",
                        "Look up to face the fridge.",
                        "Pick up a slice of lettuce in the fridge.",
                        "Turn left and walk forward to face the sink.",
                        "Wash the lettuce slice in the sink and remove it.",
                        "Turn around and walk forward and turn left to face the fridge.",
                        "Place the slice of lettuce in the fridge."
                    ],
                    "task_desc":"To wash a slice of lettuce and place it in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3V26SBZTBG5R8YQQS1LOWBNZ8DGZZC",
                    "high_descs":[
                        "Turn around, go forward to the counter, turn left, go forward to the counter.",
                        "Take the knife from the counter.",
                        "Turn around, go forward, turn left at the fridge.",
                        "Cut the lettuce in the fridge into slices.",
                        "Stay at the fridge.",
                        "Put the knife in the fridge to the left of the lettuce.",
                        "Stay at the fridge.",
                        "Take a slice of lettuce from the fridge.",
                        "Turn around, go forward a step, turn right, go forward to the sink.",
                        "Wash the lettuce in the sink. Take the lettuce from the sink.",
                        "Turn around, go forward, turn right at the fridge, go to the fridge.",
                        "Put the lettuce slice to the left of the knife in the fridge."
                    ],
                    "task_desc":"Put a washed slice of lettuce in a fridge.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Lettuce",
                "Plate"
            ]
        },
        "train/pick_clean_then_place_in_recep-LettuceSliced-None-Fridge-22/trial_T20190909_043839_239600/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ALZDJ7DBWN919_32N49TQG3J99Y6D8FCGMUCJUBI0VA6",
                    "high_descs":[
                        "Walk to the sink and face it.",
                        "Grab the knife from the sink.",
                        "Go to the fridge with the knife.",
                        "Open the fridge, cut the lettuce with the knife, and close the fridge.",
                        "Open the door to the fridge again.",
                        "Cut the lettuce more with the knife.",
                        "Close the door to the fridge.",
                        "Take out a slice of lettuce.",
                        "Go to the sink with the lettuce.",
                        "Wash the lettuce in the sink.",
                        "Take the lettuce to the fridge and open it.",
                        "Put the lettuce in the fridge and close the door."
                    ],
                    "task_desc":"Put the cut and washed lettuce in the fridge.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3YJ6NA41JE77UFJGN6K0HJXVFH1JPX",
                    "high_descs":[
                        "Turn around, go forward, turn left and go forward to the sink.",
                        "Take the knife from the sink.",
                        "Turn around, go forward, turn left and go forward to the fridge.",
                        "Cut the lettuce in the fridge into slices.",
                        "Stay at the fridge.",
                        "Put the knife in the fridge on the left of the lettuce.",
                        "Stay at the fridge.",
                        "Take a slice of lettuce from the fridge.",
                        "Turn left, go forward and left to the sink.",
                        "Wash the lettuce in the sink then take it out.",
                        "Turn around, go forward, turn left and go forward to the fridge.",
                        "Put the slice of lettuce in the fridge behind the knife."
                    ],
                    "task_desc":"Put a washed slice of lettuce in a fridge.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ANBWJZYU2A68T_3GA6AFUKORF4WKJ318K8S3EFXRH3H8",
                    "high_descs":[
                        "Turn around and go to the sink",
                        "Pick up the butter knife from the sink",
                        "Turn around and go to the fridge",
                        "Open the fridge, cut the cabbage into slices, and close the fridge",
                        "Move a step from the fridge and wait a few seconds",
                        "Open the fridge, put the knife on the tray with the cabbage, and close the fridge",
                        "Move a step to the fridge while waiting for a second",
                        "Open the fridge, pick up a cabbage slice from the tray, and close the fridge",
                        "Turn left and go to the sink",
                        "Put the cabbage slice in the sink, run the water over it, stop the water, and pick up the slice",
                        "Go back to the fridge",
                        "Open the fridge, put the cabbage slice back on the same tray with other slices"
                    ],
                    "task_desc":"Put a chilled and clean cabbage slice in the fridge",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Lettuce",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Pan-None-CounterTop-22/trial_T20190907_003423_873600/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_31EUONYN2YKQFLLBTNWNULJX5V0OVO",
                    "high_descs":[
                        "Go to the counter behind you and the the right of the sink.",
                        "Pick up the pan that is to the right of the hand soap.",
                        "Take the pan to the fridge behind you.",
                        "Chill the pan in the fridge.",
                        "Go to the counter next to the fridge.",
                        "Place the pan on the counter next to the toaster."
                    ],
                    "task_desc":"Place a chilled pan on the counter. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2M7VEYAS1405L_3TEM0PF1Q8EJINT60HUIYYH87LF0DA",
                    "high_descs":[
                        "turn to face the toaster, go towards the toaster, turn left, go towards the sink",
                        "pick up the pan",
                        "turn around and go to the refrigerator across the room",
                        "open the refrigerator, place the pan on the top shelf, close the refrigerator door, wait 7 seconds, open the refrigerator, take the pan from the top shelf, and close the refrigerator door",
                        "turn left, go forward to the toaster, and turn to face the toaster",
                        "place the pan to the left of the toaster"
                    ],
                    "task_desc":"Place a cool frying pan next to the toaster",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1VAL7L9L79IN0_3YDGXNSEO2BO0GFG2A64O9TKD6184V",
                    "high_descs":[
                        "Turn around and walk to the sink.",
                        "Grab the frying pan to the right of the soap dispenser.",
                        "Turn around and walk to the fridge on your left.",
                        "Put the frying pan in the fridge, close the fridge, wait a while, and then take the pan out of the fridge.",
                        "Turn left and walk to the kitchen cabinet with the toaster on top of it.",
                        "Place the frying pan on top of the kitchen cabinet and to the left of the toaster."
                    ],
                    "task_desc":"Put the cold frying pan next to the toaster.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pan",
                "Spatula"
            ]
        },
        "train/pick_cool_then_place_in_recep-Pan-None-CounterTop-22/trial_T20190907_003325_111452/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2MHM7JK1T9XHR_35LDD5557DLOZ76NH33308JBU4EKMX",
                    "high_descs":[
                        "Turn around and go to the section of counter between the sink and the stove.",
                        "Pick up the square pan that is sitting in the top right.",
                        "Turn around and go to the refrigerator.",
                        "Place the pan on the top shelf of the fridge and leave it inside for a few seconds.",
                        "Turn left and go to face the section of counter between the stove and refrigerator.",
                        "Place the pan on the counter, between the stove and the toaster."
                    ],
                    "task_desc":"Place a chilled pan on the counter by the stove.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3IOEN3P9SA0K43Z9MDQ46XQQVYV16X",
                    "high_descs":[
                        "Turn around, walk to the stove, turn left,",
                        "Grab the pan in the corner",
                        "Turn around, walk to refrigerator on the left",
                        "Open the refrigerator, put the pan in, close the refrigerator, open the refrigerator, take the pan out, close the refrigerator",
                        "Turn left, walk to the counter by the stove",
                        "Put the pan in between the toaster and the stove"
                    ],
                    "task_desc":"Cool the pan from the corner in the refrigerator, put it on the counter",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3OS46CRSLIG0QFF7TRATDLX6K2A6VZ",
                    "high_descs":[
                        "Turn around and go to the stove.  Turn to your left and face the counter.",
                        "Pick up the plate that is to your right.",
                        "Turn and go to the fridge.",
                        "Open the door to the fridge. Place the plate on the top shelf.  Close the fridge door.  Open the fridge door.  Grab the plate on the top shelf.",
                        "Turn right and go to the toaster on the counter.",
                        "Place the plate to the left side of the toaster on the counter."
                    ],
                    "task_desc":"Place the plate next to the toaster.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pan",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Pan-None-CounterTop-22/trial_T20190907_003356_969170/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A23HZ18KTCK2DA_339ANSOTR8J23OGWWO5B8FCUDUBKIW",
                    "high_descs":[
                        "Turn and go to the coffee maker.",
                        "Pick up the tray next to the coffee maker.",
                        "Turn and go to the fridge.",
                        "Open the fridge door.  Place the tray on the bottom shelf.  Close the fridge door. Open the fridge door and grab the tray on the bottom shelf.",
                        "Turn to your left and go to the toaster. ",
                        "Place the tray on the counter to the left of the toaster."
                    ],
                    "task_desc":"Move the tray to the counter by toaster.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3JC6VJ2SAE0KFNCVDD9SPS5T3VPA59",
                    "high_descs":[
                        "Turn right, move past the refrigerator, then turn left and move to the coffee maker, then turn left and face the pan to the left of the coffee maker.",
                        "Pick up the pan from the counter.",
                        "Move along the edge of the counter then turn left and move to the refrigerator next to the blue rubbish bin.",
                        "Open the refrigerator and place the pan on the lowest shelf, underneath the head of lettuce. Close the refrigerator, wait for the pan to chill, then open the refrigerator and pick up the pan from the bottom shelf. Close the refrigerator door.",
                        "Turn left, move towards the sink, then turn right and face the kitchen counter area between the oven and the refrigerator.",
                        "Place the pan between the oven and the toaster next to the refrigerator."
                    ],
                    "task_desc":"Place a chilled pan on the kitchen counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3NPI0JQDARMTNTTN3S9NI302IL7PTT",
                    "high_descs":[
                        "Move to the center counter.",
                        "Pick up the square pan on the counter. ",
                        "Bring the square pan to the fridge.",
                        "Chill the pan in the fridge. ",
                        "Bring the pan to the counter right of the stove.",
                        "Put the pan on the counter right of the stove next to the toaster. "
                    ],
                    "task_desc":"Put a chilled pan on the counter next to the toaster. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pan"
            ]
        },
        "train/pick_clean_then_place_in_recep-Knife-None-Drawer-22/trial_T20190908_093833_553092/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_30BXRYBRP7ET2TZTFK6TWE5A1VCWHX",
                    "high_descs":[
                        "Turn around and walk to the large knife on the counter.",
                        "Pick up the knife from the counter.",
                        "Turn right and walk forward to the sink.",
                        "Put the knife in the sink, rinse it off, and take it out of the sink.",
                        "Turn right towards the stove top.",
                        "Put the knife in the top drawer to the right of the stove top, to the right of the other knife, then close the drawer."
                    ],
                    "task_desc":"Place a cleaned knife in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3J2UYBXQQOTKXEERQUM4SS7GRCK061",
                    "high_descs":[
                        "Turn around and face the counter with the knife on it.",
                        "Pick the knife up from the counter.",
                        "Turn around and go left to face the sink.",
                        "Put the knife in the sink and turn the water on and then turn it off and pick the knife up.",
                        "Turn around and face the drawer to the right of the stove.",
                        "Open the drawer to the right of the stove and put the knife in and shut the drawer."
                    ],
                    "task_desc":"Put a clean knife in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3WT783CTPEYAXIQ2Y1WWY9V9E2TCBS",
                    "high_descs":[
                        "Turn around, head to the counter",
                        "Take the yellow knife from the counter",
                        "Turn around, head to the sink",
                        "Put the knife in the sink, turn on the water for 3 seconds",
                        "Take the knife out of the sink, Turn to the right",
                        "open the drawer next to the fridge, put the knife in the drawer, close the drawer"
                    ],
                    "task_desc":"Wash the yellow knife in the sink, put it in the drawer next to the fridge",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Sink",
                "Knife",
                "Fridge",
                "Drawer"
            ]
        },
        "train/pick_clean_then_place_in_recep-Knife-None-Drawer-22/trial_T20190907_224827_746945/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ALDWVFR4I0V2D_30H4UDGLT5ZPAY33UV8BWP5APIEMP3",
                    "high_descs":[
                        "Turn left and walk towards the oval counter ",
                        "Pick up the knife on the counter",
                        "Turn right, walk towards the sink",
                        "Place the knife in the sink, turn on the faucet to fill the sink with water, turn off the faucet, and retrieve the knife from the sink",
                        "Turn right and face the stove",
                        "Open the top drawer to the right of the oven and place the knife in. Close the drawer"
                    ],
                    "task_desc":"Find and clean a knife before placing it in a drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_35L9RVQFCRZGAPAOKKRSEQKDGFLUHG",
                    "high_descs":[
                        "Turn left to head across the kitchen,take the yellow knife from the counter",
                        "Turn to the right, head to the sink, Put the yellow knife in the sink",
                        "Turn on the water for 4 seconds, take the knife out of the sink",
                        "Turn to the right, open the drawer next to the fridge,",
                        "put the knife in the drawer",
                        "Close the drawer next to the sink"
                    ],
                    "task_desc":"Wash the yellow knife, put it in the drawer next to the fridge",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3TS1AR6UQTVUYI7MCMAH1DUGSP47FM",
                    "high_descs":[
                        "Turn left and walk to the large knife on the counter.",
                        "Pick up the knife from the counter.",
                        "Turn right and walk forward to the sink.",
                        "Put the knife in the sink, rinse it off, and take it back out of the sink.",
                        "Turn right towards the stove top.",
                        "Put the knife in the top drawer to the right of the stove top, then close the drawer."
                    ],
                    "task_desc":"Put a cleaned knife in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "Knife",
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-Knife-None-Drawer-22/trial_T20190907_224751_540006/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3PB5A5BD0YN0CI3HN6GZJYUST54G7W",
                    "high_descs":[
                        "Turn around to your left walk straight then turn left move slightly then turn left facing the island",
                        "Pick up the knife beside the apple on the island",
                        "Turn to your right then walk straight then turn left head to the sink",
                        "Put the knife in the sink and rinse it",
                        "Turn around to your left then face the drawer below the toaster",
                        "Open the drawer and put inside the knife then close it again"
                    ],
                    "task_desc":"Put the clean knife in the drawer.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3TXD01ZLD7YMYDMT5D79K1B9BBXU4U",
                    "high_descs":[
                        "Turn around, proceed around rounded counter.  Stop in front of knife with apple behind it.",
                        "Pick up knife from directly in front of apple.",
                        "Turn right, proceed to sink.",
                        "Put knife in sink left of spoon and green sponge.  Fill sink and empty it.  Pick up same knife.",
                        "Turn left three times and proceed to counter to the right of the stove.",
                        "Open top drawer, place knife on the right hand side and close drawer."
                    ],
                    "task_desc":"Move knife from counter, clean it and put it in a drawer.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_32N49TQG3JZ1DHRAJ4R5TQZSHYZVA4",
                    "high_descs":[
                        "Walk to the left side of the table.",
                        "Grab the knife in front of you.",
                        "Walk to the kitchen sink.",
                        "Turn the faucet on, and soak the knife.",
                        "Go to the kitchen drawer and open it.",
                        "Place the knife in the drawer and close it."
                    ],
                    "task_desc":"Get a knife from the table to soak it and put it in the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Knife",
                "DishSponge"
            ]
        },
        "train/pick_and_place_with_movable_recep-DishSponge-Plate-Cabinet-22/trial_T20190908_080652_453821/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_35LDD5557DLOZ76NH33308JBVJ3KMH",
                    "high_descs":[
                        "Move forward, turn right then head to the counter beside the microwave",
                        "Pick up the sponge beside the microwave",
                        "Turn right then face left to the sink",
                        "Put the sponge on the plate at the sink",
                        "Pick up the plate with sponge",
                        "Turn right walk forward then left face the last cabinet",
                        "Open the last cabinet put in the plate with sponge then close the cabinet"
                    ],
                    "task_desc":"Put in the plate with sponge in the cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3A9AA95ATZ3R2RIX2WRPFNUO3YOP52",
                    "high_descs":[
                        "Turn to the right and go back to the microwave.",
                        "Pick up the sponge on the left side of the counter.",
                        "Carry the sponge and take a step to the right to the sink.",
                        "Place the sponge on a plate in the sink.",
                        "Pick up the plate from the sink.",
                        "Carry the plate and turn around, then face right to the wall. Look up the the cabinet above the fridge.",
                        "Open the cabinet and place the plate inside, then shut the door."
                    ],
                    "task_desc":"Move a plate and sponge to a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3QFUFYSY91WXFVP3AOCAY1A61VZ4F0",
                    "high_descs":[
                        "Go to the counter on the right of the microwave.",
                        "Pick up the sponge on the counter.",
                        "Turn and go to the sink.",
                        "Put the sponge on the plate in the sink.",
                        "Pick up the plate with the sponge on it.",
                        "Go to the cabinet above the fridge on the right.",
                        "Put the plate and sponge in the cabinet."
                    ],
                    "task_desc":"Put a plate with a sponge on it in the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-DishSponge-Plate-Cabinet-22/trial_T20190912_084819_864455/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2AXP68AJJ3B94_37W3JXSD69PFOOPIPKAHIE0DRZ0YWP",
                    "high_descs":[
                        "Turn around and move to the sink",
                        "Pick up the sponge in the sink",
                        "Turn and face the plate that is in the sink",
                        "Put the sponge on the plate that is in the sink",
                        "Pick up the plate and sponge in the sink",
                        "Turn left and move towards the cabinets on the right",
                        "Open the cabinet, place the plate inside and close the cabinets"
                    ],
                    "task_desc":"Place the sponge on the plate and move them to the cabinet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3NQL1CS15UP29ZPDZA5LWCHZKRSYVB",
                    "high_descs":[
                        "Turn around and walk over to the sink.",
                        "Pick up the sponge out of the sink.",
                        "Turn right and take a step forward, then turn left to face the sink.",
                        "Put the sponge on the black plate that is in the sink.",
                        "Pick up the black plate with the sponge on it.",
                        "Turn left and walk over to the wall, then turn right and look up at the upper cabinets.",
                        "Open the leftmost upper cabinet and put the plate with the sponge on it inside, then close the door."
                    ],
                    "task_desc":"Put a plate with a sponge on it in a cabinet.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3E7TUJ2EGF31EHHJ0DDBR9I1BAG9D9",
                    "high_descs":[
                        "Turn complete around and walk to the sink. ",
                        "Pick up the sponge from the sink.",
                        "Step to the right and face the sink.",
                        "Put the sponge on the plate that is in the sink.",
                        "Pick up the plate and sponge from the sink.",
                        "Turn left and walk forward to the wall. Turn right to face the counter. Look up at the cabinets above the counter. ",
                        "Place the plate and sponge inside the cabinet. Shut the door. "
                    ],
                    "task_desc":"Put a sponge and plate away in a cabinet. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cabinet",
                "DishSponge",
                "Plate"
            ]
        },
        "train/pick_heat_then_place_in_recep-BreadSliced-None-Fridge-22/trial_T20190909_151927_879893/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A18X8ZAS0QDLKJ_32AT8R96GOQ50YO4VE3RI4RFPCZSU4",
                    "high_descs":[
                        "Walk towards the stove.",
                        "Pick up the knife by the salt shaker.",
                        "Turn around and walk towards the dishwasher, then turn right.",
                        "Cut the loaf of bread into slices.",
                        "Turn right. walk towards the sink. ",
                        "Place the knife into the sink.",
                        "Turn left, walk towards the loaf of bread.",
                        "Pick up a slice of bread.",
                        "Turn left and walk towards the microwave.",
                        "Place the slice of bread inside of the microwave then turn it on, when its done remove it.",
                        "Turn around and walk towards the round table, turn left, then walk towards the refrigerator.",
                        "Open the refrigerator and place the bread on the shelf next to the lettuce."
                    ],
                    "task_desc":"Place a slice of warm bread inside of the refrigerator. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_38YMOXR4MXGD54FCJ1FPZNGKS2KW6Q",
                    "high_descs":[
                        "Move to the counter that is left of the stove.",
                        "Pick up the knife that is left of the stove.",
                        "Turn left and move to the counter in front of the bread.",
                        "use the knife to slice the bread.",
                        "Turn right and move to the counter in front of the sink.",
                        "Place the knife into the sink.",
                        "Turn right and move to the counter in front of the bread.",
                        "Pick up a slice of bread from the counter.",
                        "Turn left, move to the counter in front of the microwave.",
                        "Place the bread slice into the microwave, cook it, then pick it back up.",
                        "Turn right and go to the refrigerator.",
                        "Place the microwaved bread slice on to the top shelf of the refrigerator."
                    ],
                    "task_desc":"Microwave a slice of bread, put it into the refrigerator.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3SKEMFQBZ6M9EI4JN2TKVQIGAHA8KI",
                    "high_descs":[
                        "Walk forward to the stove.",
                        "Pick up the knife on the counter to the right of the stove.",
                        "Turn around and walk to the counter to the left of the sink.",
                        "Slice the loaf of bread on the counter.",
                        "Move to the right to stand at the sink.",
                        "Place the knife in the sink.",
                        "Move back to the left.",
                        "Pick up a slice of bread.",
                        "Go to the right to the microwave.",
                        "Put the bread in the microwave, heat it, and take it out again.",
                        "Turn around and go to the fridge on the left.",
                        "Put the bread in the fridge."
                    ],
                    "task_desc":"Put a microwaved slice of bread in the fridge.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3XC1O3LBOV33W8EPB0GG1MRIEB0LTM",
                    "high_descs":[
                        "Walk forward to face the counter beside the stove.",
                        "Pick up the knife on the counter.",
                        "Turn around and walk forward and then turn right to face the sink.",
                        "Cut the loaf of bread on the counter.",
                        "Step to the right to face the sink.",
                        "Place the knife in the sink.",
                        "Step to the left to face the counter.",
                        "Pick up a slice of bread from the counter.",
                        "Step to the left to face the microwave.",
                        "Heat the bread in the microwave and then remove it.",
                        "Turn to the right and walk forward to face the fridge.",
                        "Place the bread in the fridge to the left of the lettuce."
                    ],
                    "task_desc":"Cut a loaf of bread as well as put it in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3UJ1CZ6IZK6OFJYPUDVJASZZQYX5SW",
                    "high_descs":[
                        "Walk straight ahead and stand in front of the stove.",
                        "Pick up the knife laying on the counter.",
                        "Turn around and walk halfway across the room and turn right to face the counter.",
                        "Cut the bread on the counter into slices.",
                        "Turn to the right, take a step, and turn to face the sink.",
                        "Put the knife in the sink.",
                        "Turn to the left, take a step, and then turn to face the counter with bread on it.",
                        "Pick up a slice of bread.",
                        "Turn to the left, take a step, and then turn to the right to face the microwave.",
                        "Open the microwave, place the bread inside, heat the bread, and then open the door and remove the bread.",
                        "Turn to the right, take a step, then turn right again and walk to the counter, then take a left and walk across the room to face cabinet.",
                        "Open the cabinet and place the bread on the shelf and then close the cabinet."
                    ],
                    "task_desc":"To cook a slice of bread and store it for later.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bread"
            ]
        },
        "train/pick_heat_then_place_in_recep-BreadSliced-None-Fridge-22/trial_T20190909_151242_004997/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3B58QWMTBXVE0_31LM9EDVOO9Z65L5BJIRC88YLYDNJD",
                    "high_descs":[
                        "Turn left and walk across the room, turn right and walk to the counter with the toaster.",
                        "Pick up the closest knife from the front of the counter.",
                        "Turn around and carry the knife to the loaf of bread on the counter on the right.",
                        "Slice the loaf of bread on the counter.",
                        "Turn left and carry the knife to the microwave.",
                        "Open the microwave and put the knife inside, close the microwave.",
                        "Turn right and go to the loaf of bread on the counter.",
                        "Pick up a slice of bread from the loaf on the counter.",
                        "Carry the slice of bread to the microwave to the left.",
                        "Open the microwave and put the slice of bread in the microwave, turn on the microwave, after the bread is heated take it out",
                        "Turn around carrying the slice of bread, then turn left and bring the bread to the refrigerator.",
                        "Put the slice of bread in the refrigerator."
                    ],
                    "task_desc":"Put a heated slice of bread in the refrigerator",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3S06PH7KSULJPCEOW0YIC30IDD71D1",
                    "high_descs":[
                        "turn left and walk forwards to the near end of the room, then turn right and walk to the kitchen counter to the right of the stove",
                        "grab a butterknife off of the kitchen stove",
                        "turn around and walk over to the dishwasher on the right side of the room",
                        "cut up the loaf of bread on the kitchen counter there",
                        "move left a bit and face the microwave on the kitchen counter to the right",
                        "place the knife inside of the microwave",
                        "move right a bit and face the kitchen counter on the left just before the sink",
                        "grab a slice of the loaf of bread off of the counter",
                        "turn left and walk to the microwave on your right",
                        "place the slice of bread inside of the microwave, cook it, then take it back out",
                        "turn around and walk to the fridge on the left side of the room",
                        "place the bread slice inside of the fridge"
                    ],
                    "task_desc":"place a microwaved slice of bread inside of the fridge",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2WKZI3JQCE3Z6_3JNQLM5FT739C9KCSLWK0ZISEX12LN",
                    "high_descs":[
                        "Turn left, move forward to the 3rd square away from the counter, turn right, move forward to the counter.",
                        "Pick up the knife.",
                        "Turn around, move forward to alongside the dishwasher, turn right, ",
                        "Slice the bread.",
                        "Turn left, move forward to the microwave, turn right.",
                        "Open the microwave, put the knife inside, close the microwave.",
                        "Turn right, move forward to alongside the bread, turn left.",
                        "Pick up a slice of bread.",
                        "Turn left, move forward to the microwave, turn right.",
                        "Open the microwave door, place the bread inside, close the door, turn on the microwave for 2 seconds, open the door, remove the bread slice.",
                        "Turn around, move forward to the counter, turn left, move to the fridge.",
                        "Open the fridge door, put the bread on the top shelf, close the fridge door."
                    ],
                    "task_desc":"Put a heated slice of bread in the fridge.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_34T446B1C3V9DVNS0LZ7ESZQNM8C0U",
                    "high_descs":[
                        "Turn left, move to the counter, left of the toaster.",
                        "Pick up the knife that is closest to the edge.",
                        "Turn left, move to the counter in front of the bread.",
                        "Slice the bread with the knife.",
                        "Turn left, move to the counter in front of the microwave.",
                        "Place the knife in to the microwave.",
                        "Turn right, move to the counter in front of the bread.",
                        "Pick up a slice of bread.",
                        "Turn left, move to the counter in front of the microwave.",
                        "Place the bread slice into the microwave, cook it, then pick it up.",
                        "Turn right, move to the refrigerator.",
                        "Place the bread slice onto the top shelf of the refrigerator."
                    ],
                    "task_desc":"Microwave a slice of bread.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3UOUJI6MTGVDWFA3PO9EHC8741ZXUZ",
                    "high_descs":[
                        "Turn to your left and walk across the kitchen, then turn to the counter on your right between the stove and the refrigerator.  ",
                        "Pick up the knife closest to the edge of the counter top. ",
                        "Turn around and walk past the sink, and turn to your right, in front of the counter top above the dishwasher. ",
                        "Cut the loaf of bread between the sink and the microwave, on the counter top into slices. ",
                        "Go to the microwave on the counter to your left. ",
                        "Place the knife inside the microwave. ",
                        "Go back to the counter top with the sliced bread to your right. ",
                        "Remove a slice of bread from the center of the loaf, on the counter top.  ",
                        "Go back to the microwave, to your left. ",
                        "Place the slice of bread in the microwave, heat it, then remove it from the microwave. ",
                        "Turn to your left and go to the refrigerator with the slice of bread. ",
                        "Place the slice of bread in the refrigerator, on the front right corner of the top shelf. "
                    ],
                    "task_desc":"Place a warm slice of bread in the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3V0Z7YWSI1HC8EW66PYQN8GU5Y02V9",
                    "high_descs":[
                        "Turn left and head to the counter with the toaster on it",
                        "Grab the knife that is on the counter",
                        "Turn around and stop at the counter over the washing machine",
                        "Cut the loaf of bread on the counter into slices",
                        "Turn left and stop at the microwave",
                        "Put the knife in the microwave",
                        "Turn right and stop at the counter on the left",
                        "Grab a slice of bread off the counter",
                        "Turn left and stop at the microwave",
                        "Heat the bread in the microwave and then take it out",
                        "Turn around and head to the fridge",
                        "Put the bread in the fridge"
                    ],
                    "task_desc":"Putting a slice of bread in the fridge",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bread",
                "Plate"
            ]
        },
        "train/pick_heat_then_place_in_recep-BreadSliced-None-Fridge-22/trial_T20190907_154407_951065/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1S1K7134S2VUC_30LB5CDZNFRMLOY2SZJFPQ0BWZ80ZL",
                    "high_descs":[
                        "Turn right and move to the counter near the teapot.",
                        "Pick up the sharp knife that is near the egg.",
                        "Turn right and move to the counter where the bread is.",
                        "Use the knife to slice the bread.",
                        "Turn left and move to the microwave.",
                        "Place the knife into the microwave.",
                        "Turn right, move to the counter where the bread is.",
                        "Pick up a slice of bread.",
                        "Turn left and move to the microwave.",
                        "Place the bread slice into the microwave, cook the bread slice, remove the bread slice.",
                        "Turn right, move to the refrigerator.",
                        "Open the refrigerator, place the bread slice on the top shelf."
                    ],
                    "task_desc":"Place a microwaved slice of bread into the refrigerator.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3L6L49WXW3E5DYWE4CZ1CPJTB5K54O",
                    "high_descs":[
                        "Turn right and walk to the end of the island. ",
                        "Pick up the knife with the yellow handle.",
                        "Turn to the right and begin to walk toward the dishwasher. ",
                        "Walk closer to the dishwasher.",
                        "Turn to the left and walk over to the microwave. ",
                        "Open the microwave and place the knife on the plate",
                        "Close the microwave, turn right, and walk toward the sink.",
                        "Pick up a slice of bread from the counter. ",
                        "Turn left and walk to the microwave.",
                        "Open the microwave, place bread on plate in the microwave, warm the bread, and then remove the bread from the microwave. ",
                        "Turn to the right and walk to the refrigerator. ",
                        "Open the refrigerator and place the bread slice inside. "
                    ],
                    "task_desc":"Place a warm slice of bread into the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3NPFYT4IZFLURX985JKXDX7GVDUGXW",
                    "high_descs":[
                        "Go to the table by the window.",
                        "Pick up the chef's knife on the table.",
                        "Go to the dishwasher.",
                        "Slice the bread with the knife.",
                        "Move to the microwave.",
                        "Put the chef's knife in the microwave.",
                        "Move back to the counter over the dishwasher.",
                        "Pick up a slice of bread on the counter.",
                        "Move back to the microwave.",
                        "Heat the bread in the microwave.",
                        "Go to the fridge.",
                        "Put the warm bread into the fridge."
                    ],
                    "task_desc":"Put a warm piece of bread in the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bread",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Cup-None-SinkBasin-22/trial_T20190909_054932_581308/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3BF51CHDTY18FSK6IL2PQ5G8UFM0HZ",
                    "high_descs":[
                        "walk forwards to the kitchen counter space ahead, then take a right and walk over to the kitchen counter just a little bit to the right of the stove up ahead at the end of the room",
                        "grab a cup off of the kitchen counter space to the right of the stove",
                        "turn right and walk over to the fridge a bit ahead on the left",
                        "place the cup inside of the fridge there to cool, then take it back out once it has cooled",
                        "turn around and walked forwards just a bit, enough to end up at the kitchen sink when you then take a right and walk over to the kitchen sink",
                        "place the cup down inside of the kitchen sink"
                    ],
                    "task_desc":"place a cooled cup down inside of the kitchen sink",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3GGAI1SQEYPE1YGXLYBMDBQ5KQHMCM",
                    "high_descs":[
                        "Go straight ahead to the dishwasher, then turn right and go forward toward the stove.",
                        "Pick up the cup on the counter next to the stove.",
                        "Turn right and go forward, then turn left to face the fridge.",
                        "Open the fridge, put the cup inside and chill it, then take it out.",
                        "Turn around and move forward, then turn right to go to the sink.",
                        "Put the cup in the sink."
                    ],
                    "task_desc":"Put a cold cup in the sink.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TUUIV61CR0C7_3GFK2QRXXC8P7P1WAQU183MMQBDW5J",
                    "high_descs":[
                        "Walk forward to the dishwasher, turn right, walk to the counter next to the stove. ",
                        "Pick up the goblet next to the stove. ",
                        "Turn right, walk to the refrigerator, turn left so you are facing the refrigerator. ",
                        "Open the refrigerator, put the goblet on the front right of the top shelf, close the refrigerator door.  Open the refrigerator door, pick up the goblet, close the refrigerator door. ",
                        "Turn completely around, walk slightly forward, turn right and walk to the sink. ",
                        "Put the goblet in the sink in front of the plate. "
                    ],
                    "task_desc":"Chill the goblet and put it in the sink. ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Sink",
                "Cup"
            ]
        },
        "train/pick_cool_then_place_in_recep-Cup-None-SinkBasin-22/trial_T20190909_054956_720701/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ALKQPW0O9C98N_3EFVCAY5L60MONKZ1PIPVX25Q5NJ8V",
                    "high_descs":[
                        "Turn left and go to the counter to the right of the sink",
                        "Pick up the wine glass from the sink",
                        "Turn around and go to the refrigerator on the left",
                        "Open the refrigerator door, put the wine glass on the shelf with the apple and close the door. Open the refrigerator door and take the wine glass out.",
                        "Turn left and go to the sink",
                        "Put the wine glass on the right side of the sink."
                    ],
                    "task_desc":"Put a chilled wine glass in the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3TMFV4NEPB58U7KY8O14KNWDS2Y8WJ",
                    "high_descs":[
                        "Turn left walk forward head to the counter beside the stove",
                        "Pick up the wine glass ",
                        "Turn right then head to the fridge",
                        "Open the fridge chill the wine glass take it out then close the fridge",
                        "Turn left then head to the sink",
                        "Put the wine glass in the sink"
                    ],
                    "task_desc":"Put the chilled wine glass in the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3TVRFO09GN6IYE97CI6URBWQL3HXLZ",
                    "high_descs":[
                        "Turn around and go forward to the counter adjacent to the sink.",
                        "Pick up the cup from the counter.",
                        "Turn around and go forward, then turn left to face the fridge.",
                        "Open the fridge and put the cup inside, chill it, and take it out.",
                        "Turn around and step forward, then turn right and go to the sink ahead.",
                        "Put the cup inside of the sink."
                    ],
                    "task_desc":"Put a cold cup in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Mug-None-Cabinet-22/trial_T20190908_072939_855818/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PGS1Q1XAY79I_37TRT2X24T8X5WW88TDILD844VIJBB",
                    "high_descs":[
                        "Turn to your left and walk to the microwave oven on the other side of the room",
                        "Look up to the cupboard above the microwave, open the cupboard on the left, pick up the white mug, close the cupboard",
                        "Look down to the microwave",
                        "Open the door of the microwave, place the mug on the left end of the plate in the microwave, close the door, turn the microwave on; once it turns off, open the microwave door, pick up the mug, close the door",
                        "Look up the cupboard above the microwave",
                        "Open the middle cupboard, place the mug in the center of the cupboard, close the cupboard"
                    ],
                    "task_desc":"Get a mug from the cupboard, heat it in the microwave, put it back in the cupboard",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3RRCEFRB7PT72EDN5MQEFBJLMZVB4H",
                    "high_descs":[
                        "Turn to your left and go around the counter to your left, then head towards the cabinets above the microwave, at the left end of the kitchen counter. ",
                        "Remove a coffee cup from the cabinet above the microwave. ",
                        "Step down from the cabinets up top. ",
                        "Place the coffee cup in the microwave, heat it up, then remove the coffee cup from the microwave. ",
                        "Step back up to the cabinets above the microwave. ",
                        "Put the coffee cup back in the right cabinet, above the microwave. "
                    ],
                    "task_desc":"Put a warm coffee cup in the kitchen cabinet. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3OWEPKL08CT6MAK3AATU9I3PVVXN7B",
                    "high_descs":[
                        "Walk around the table and go to the microwave.",
                        "Grab the coffee cup from the top left cabinet above.",
                        "Locate the microwave under the cabinet.",
                        "Put the cup in the microwave and grab the cup afterwards.",
                        "Look at the top left cabinet again.",
                        "Put the cup in the cabinet."
                    ],
                    "task_desc":"Heat a mug and replace it.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Microwave",
                "Mug"
            ]
        },
        "train/pick_heat_then_place_in_recep-Mug-None-Cabinet-22/trial_T20190908_073225_811379/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_34QN5IT0T2871SXFJ9J2C637XG6809",
                    "high_descs":[
                        "Turn to the left, and go back to the microwave.",
                        "Open the top left cabinet and take out the mug.",
                        "Hold the mug and look down.",
                        "Place the mug in the microwave below, then when finished, open the door and take out the mug.",
                        "Hold the mug and look above again.",
                        "Open the left side cabinet and place the mug inside, shut the door."
                    ],
                    "task_desc":"Heat a mug and place it in the cabinet.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_39GXDJN2OWVNUTYVM67RXZTXRB4V87",
                    "high_descs":[
                        "Walk towards the wall, then hang a left an walk over to the microwave.",
                        "Open the leftmost cabinet door above the microwave and remove the mug from inside the cabinet, then close the door.",
                        "Look down at the microwave on the counter.",
                        "Open the microwave and put the mug inside then turn on the microwave, after a couple seconds open the microwave and remove the now heated mug then close the door.",
                        "Look up at the upper cabinets.",
                        "Open the left upper cabinet door in front of you and put the heated mug inside, then close the door."
                    ],
                    "task_desc":"Put a heated mug in a cabinet.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_32UTUBMZ7JD6WRW2PIR1O1JY0OEBVQ",
                    "high_descs":[
                        "Move back then left to the cupboard on the left directly above the red microwave",
                        "Open the cupboard and remove the white mug inside of the cupboard, close the cupboard",
                        "Carry the white mug to face the red microwave",
                        "Open the microwave, place the mug inside, turn it on then remove the mug and shut the door",
                        "Move to face the upper cupboard on the left where the mug was",
                        "Place the mug back in the cupboard and close the cupboard"
                    ],
                    "task_desc":"Move a heated mug to the cupboard",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Kettle",
                "Mug"
            ]
        },
        "train/pick_heat_then_place_in_recep-PotatoSliced-None-Fridge-22/trial_T20190908_183019_730053/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3T9K2RY06UO14_36PW28KO42NSWVRMKMRCU8V8BHKAEQ",
                    "high_descs":[
                        "Turn and go to the table.",
                        "Pick up a knife on the table. ",
                        "Turn and go to the counter by the microwave. ",
                        "Cut a potato on the counter. ",
                        "Turn and go to the microwave.",
                        "Put the knife in the microwave. ",
                        "Turn and go to the counter by the microwave. ",
                        "Pick up a slice of potato on the counter.",
                        "Turn and go to the microwave.",
                        "Cook the slice of potato in the microwave.",
                        "Turn and go to the refrigerator.",
                        "Put the slice of potato in the refrigerator. "
                    ],
                    "task_desc":"Put a microwaved slice of potato in the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_3QAPZX2QN74402HOZ0ZI31A65VV026",
                    "high_descs":[
                        "Turn around and walk towards the door and when you're a few steps away, head right to stand at the curved edge of the counter.",
                        "Pick up the sharp knife with a yellow handle from the counter.",
                        "Turn right and carry the knife to stand in front of the dishwasher.",
                        "Use the knife to slice the potato on the counter above the dishwasher.",
                        "Carry the knife to the microwave, which is to your left.",
                        "Place the knife on the blue plate inside the microwave.",
                        "Move right to stand back in front of the sliced potato.",
                        "Pick up a slice of potato from the counter.",
                        "Carry the potato to the microwave on your left.",
                        "Place the potato inside the microwave and then remove once heated.",
                        "Turn around and carry the potato towards the curved end of the counter, and then head left to the fridge.",
                        "Place the potato slice on the shelf next to the lettuce in the fridge."
                    ],
                    "task_desc":"Refrigerate a slice of hot potato.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A12HZGOZQD5YK7_3SNLUL3WO7EQHAFC7DV774XMRKPULR",
                    "high_descs":[
                        "Turn left, go across the room, turn right and head to the counter.",
                        "Pick up the knife on the counter.",
                        "Turn right and head to the dishwasher.",
                        "Cut the potato on the counter.",
                        "Turn left and go to the microwave.",
                        "Open the microwave, put the knife in the microwave and shut the microwave.",
                        "Turn right and go back to the counter above the dishwasher.",
                        "Pick up a slice of potato.",
                        "Turn left and go back to the microwave.",
                        "Put the slice of potato in the microwave, cook it and pick it back up.",
                        "Turn around, go to the counter, turn left and head to the fridge.",
                        "Put the slice of potato in the fridge to the right of the lettuce."
                    ],
                    "task_desc":"Put a cooked slice of potato in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato"
            ]
        },
        "train/pick_heat_then_place_in_recep-PotatoSliced-None-Fridge-22/trial_T20190908_185723_946017/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AISNLDPD2DFEG_36V4Q8R5ZNRIVZQGQGCHXGFMO3UQM3",
                    "high_descs":[
                        "Turn right, go forward a bit, turn around and go to the table",
                        "Pick up the knife on the table",
                        "Turn right and go to the counter",
                        "Slice the potato on the counter",
                        "Move to the left in front of the microwave",
                        "Put the knife in the microwave",
                        "Move to the right a bit",
                        "Pick up a slice of potato",
                        "Move to the left in front of the microwave",
                        "Put the potato slice in the microwave, start the microwave, wait, pick up the potato slice from the microwave",
                        "Turn right, go forward a bit, turn right, go forward, turn left and go to the fridge",
                        "Put the potato slice in the fridge"
                    ],
                    "task_desc":"Cook  a potato slice and put it in the fridge",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3GNCZX450LEWTMGCT07NOKUCPQCAP5",
                    "high_descs":[
                        "Turn left to face the knife on the table.",
                        "Pick up the knife on the table.",
                        "Turn right and walk across the room to face the potato on the counter.",
                        "Cut the potato on the counter into slices.",
                        "Take a step to the left to face the microwave.",
                        "place the knife in the microwave.",
                        "Take a step to the right to face the potato on the counter.",
                        "Pick up a slice of potato on the counter.",
                        "Take a step to the left to face the microwave.",
                        "Heat the potato slice in the microwave and remove it.",
                        "Turn right and walk across the room to face the fridge.",
                        "Place the potato slice in the fridge."
                    ],
                    "task_desc":"To heat a potato slice and place it in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CPNA5L0J834N_3VHP9MDGRQB8VOOGZB79IL6WNOXCFV",
                    "high_descs":[
                        "look down and turn right then walk towards the window then turn right towards the table",
                        "take the knife off of the table ",
                        "Carry the knife to the right",
                        "Cut the potato with the knife",
                        "turn to the left and walk towards the wall",
                        "turn towards the right  and open the microwave place the knife in the microwave",
                        "Close the microwave and turn to the right",
                        "turn left towards the counter and pick up a potato slice",
                        "turn left with the potato slice then turn right towards the microwave",
                        "place the potato slice in the microwave then close and start the microwave open the microwave",
                        "pull the potato slice out and turn right the left towards the window then right towards the refrigerator",
                        "Open the refrigerator and place potato slice in. "
                    ],
                    "task_desc":"Put the cooked potato slice into the Refrigerator",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato",
                "Pan",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-PotatoSliced-None-CounterTop-22/trial_T20190909_040954_050525/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ALZDJ7DBWN919_323Q6SJS8L7ZCWZWL3LATC3C0J2FHD",
                    "high_descs":[
                        "Go to the counter to the right of the sink.",
                        "Pick up the knife off of the counter.",
                        "Go to the counter on the other side of the sink with the potato.",
                        "Cut the potato with the knife.",
                        "Take the knife to the fridge.",
                        "Put the knife inside the fridge.",
                        "Go back to the potato.",
                        "Grab a slice of potato from the counter.",
                        "Take the potato to the fridge.",
                        "Put the potato in and then take it back out.",
                        "Take the potato back to the counter.",
                        "Place the potato on the counter."
                    ],
                    "task_desc":"Cut and refrigerate the potato on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3LWJHTCVCFDCPPYZ4T842QVDR6AFQL",
                    "high_descs":[
                        "Turn around and go to the end of the counter and turn to your left. ",
                        "Pick up the butter knife on the edge of the counter. ",
                        "Turn to your left and go to the counter to the left of the sink. ",
                        "Cut the potato on the counter into slices. ",
                        "Turn around and do to the end of the counter that wraps around, then turn to your left and go to the refrigerator. ",
                        "Place the knife in the refrigerator, on the top shelf, in front of the bowl. ",
                        "Turn around and go back to the end of the counter that stick out from the kitchen, then turn to your right and go back to the counter across from you, where the potato is. ",
                        "Pick up one of the potato slices on the counter.  ",
                        "Turn around and go back to the end of the counter that wraps around and turn to your left and go to the refrigerator. ",
                        "Place the potato slice in the refrigerator, on the top shelf, to the left of the knife, wait a moment for the potato slice to chill, then remove the potato slice from the refrigerator.  ",
                        "Turn around and go back to the counter that sticks out from the kitchen, turn to your right and go back to the counter across from you where the rest of the potato is. ",
                        "Place the potato slice on the counter to the left of the fork. "
                    ],
                    "task_desc":"Put a knife in the refrigerator, and a cold potato slice on the counter. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3XM0HYN6NNQZJZXO9599K3K3A7EEPC",
                    "high_descs":[
                        "Turn right and walk across the room to face the counter to the right of the sink.",
                        "Pick up the knife on the counter.",
                        "Take a step to the left to face the potato on the counter.",
                        "Cut the potato on the counter into slices.",
                        "Turn right and step forward to face the fridge.",
                        "Place the knife in the fridge.",
                        "Turn left and step forward to face the potato on the counter.",
                        "Pick up a slice of potato on the counter.",
                        "Turn right and step forward to face the fridge.",
                        "Cool the potato slice in the fridge and remove it.",
                        "Turn left and step forward to face the potato on the counter.",
                        "Place the slice of potato on the counter."
                    ],
                    "task_desc":"To heat a potato slice and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato",
                "Knife"
            ]
        },
        "train/pick_cool_then_place_in_recep-PotatoSliced-None-CounterTop-22/trial_T20190909_040642_077525/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3C5W7UE9CIH24WRSCU79ROBFL85MXO",
                    "high_descs":[
                        "Walk around the island and take a right at the dishwasher.",
                        "Walk to the stove and pick up the knife that is to the right of the stove. ",
                        "Turn to the left and walk to the dishwasher. ",
                        "Cut the potato that is on the counter above the dishwasher. ",
                        "Turn around to the right and walk to the refrigerator. ",
                        "Open the refrigerator and place the knife on the top shelf. ",
                        "Close the refrigerator, turn to the left, and walk back to the counter above the dishwasher where the potato is.",
                        "Pick up the potato slice from the potato from the counter. ",
                        "Turn to the right and walk to the refrigerator. ",
                        "Open the refrigerator, place the potato on the shelf, close the refrigerator. Open the refrigerator, remove the potato, close the refrigerator. ",
                        "Turn to the left and walk back to the dishwasher. ",
                        "Place the potato on the counter beside the other pieces of potato. "
                    ],
                    "task_desc":"Cool a potato slice in the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3LYA37P8ITE015OOMM2BNESJD2GKB6",
                    "high_descs":[
                        "Walk across the room to face the stove.",
                        "Pick up the knife on the stove.",
                        "Turn left and step forward to face the potato on the counter.",
                        "Cut the potato on the counter into slices.",
                        "Turn right and cross the room to face the fridge.",
                        "Place the knife in the fridge.",
                        "Turn left and step forward to face the potato on the counter.",
                        "Pick up a slice of potato on the counter.",
                        "Turn right and cross the room to face the fridge.",
                        "Cool the potato slice in the fridge and remove it.",
                        "Turn left and step forward to face the potato on the counter.",
                        "Place the potato slice on the counter."
                    ],
                    "task_desc":"To cool a potato slice and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3T9K2RY06UO14_3PJ71Z61R7TF7BN5GSIXRT1UGVO91R",
                    "high_descs":[
                        "Turn and go to the counter by the stove.",
                        "Pick up a knife on the counter by the stove. ",
                        "Turn and go to the counter by the sink.",
                        "Cut a potato on the counter by the sink. ",
                        "Turn and go to the refrigerator.",
                        "Put the knife in the refrigerator.",
                        "Turn and go to the counter by the sink.",
                        "Pick up a slice of potato on the counter. ",
                        "Turn and go to the refrigerator. ",
                        "Chill the slice of potato in the refrigerator. ",
                        "Turn and go to the counter by the sink.",
                        "Put the slice of potato on the counter."
                    ],
                    "task_desc":"Put a chilled slice of potato on the counter by the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato"
            ]
        },
        "train/pick_cool_then_place_in_recep-PotatoSliced-None-CounterTop-22/trial_T20190909_040822_239216/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3IUZPWIU1RYSP8MZHDY7AS54N2AWK8",
                    "high_descs":[
                        "Turn right and cross the room to face the knife on the counter to the right of the sink.",
                        "Pick up the knife on the counter.",
                        "Take a step to the left to face the potato on the counter.",
                        "Cut the potato on the counter into slices.",
                        "Turn right and cross the room to face the fridge.",
                        "Place the knife in the fridge.",
                        "Turn left and cross the room to face the potato on the counter.",
                        "Pick up a slice of potato on the counter.",
                        "Turn right and cross the room to face the fridge.",
                        "Cool the potato in the fridge and remove it.",
                        "Turn left and cross the room to face the potato on the counter.",
                        "Place the potato slice on the counter."
                    ],
                    "task_desc":"To cool a potato slice and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HU9JOPC9UK8Q_3OUYGIZWRAP0S9IU1YAUZEIZG8DP0E",
                    "high_descs":[
                        "Turn around and walk to the bench with the toaster, then turn left to face the egg and knife.",
                        "Take the knife from the counter.",
                        "Turn left and walk to the potato on the bench, to the left of the sink.",
                        "Cut up the potato into slices.",
                        "Holding the knife, turn around and walk to the fridge on your left.",
                        "Open the fridge and place the knife on the top shelf, and then close the fridge door.",
                        "Turn around and walk forward, then turn right and walk to the counter with the potato.",
                        "Pick up a slice of potato.",
                        "Turn around and carry the potato slice to the fridge on your left.",
                        "Open fridge and put potato slice on top shelf and close door, then open door after eight seconds and remove the potato slice, then close door.",
                        "Turn around and carry the potato slice back to the counter top above the dishwasher.",
                        "Place the potato slice on the bench directly in front of the spoon."
                    ],
                    "task_desc":"Place a piece of refrigerated potato on the bench next to the spoon.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3SLE99ER0Q4VQ0NAMN5LATGWHAABZY",
                    "high_descs":[
                        "turn around, go to counter to the right of sink with potato",
                        "pick up silver knife to the right of potato on counter",
                        "go to counter to the left of the sink with blue dispenser",
                        "slice potato on counter to left of sink",
                        "turn right, go to white refrigerator",
                        "place knife on top shelf of refrigerator in between lettuce and apple, close refrigerator",
                        "turn around, go to counter to the left of sink on the right",
                        "pick up slice of potato from counter",
                        "turn right, go to white refrigerator",
                        "open refrigerator, place potato slice to the right of lettuce on top shelf, close refrigerator, open refrigerator, pick up potato slice from top shelf, close refrigerator",
                        "turn around, go to counter to the left of sink on the right",
                        "place potato slice in front of spoon on counter to the left of sink"
                    ],
                    "task_desc":"place knife in refrigerator, place chilled potato slice on counter",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato",
                "Knife"
            ]
        },
        "train/pick_two_obj_and_place-Spatula-None-Drawer-22/trial_T20190918_162346_300273/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2AXP68AJJ3B94_3X4MXAO0BJ56RNDWBPINAI7GOCXRWS",
                    "high_descs":[
                        "Turn right and move to the sink",
                        "Pick up the spatula from the sink",
                        "Turn around and move left towards the cubbard",
                        "Put the spatula in the drawer next to the stove",
                        "Turn around and move towards the sink on the right",
                        "Pick up the spatula from the sink",
                        "Turn around and move left towards the cubbard",
                        "Put the spatula in the cubbard"
                    ],
                    "task_desc":"Move the spatulas from the sink into the cubbard",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2VAOQ8P5M2Y8D_3A4NIXBJ79GZJDO523F4F8WQKIDMLP",
                    "high_descs":[
                        "move to the left towards the sink ",
                        "pick up right spatula in sink ",
                        "move right towards the stove",
                        "open drawer next to stove, place spatula in drawer",
                        "move to the left towards the sink",
                        "pick up spatula in sink",
                        "open drawer next to stove, place spatula in drawer",
                        "close the drawer after placing spatula in"
                    ],
                    "task_desc":"Put spatulas in drawer",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Spatula"
            ]
        },
        "train/pick_two_obj_and_place-Spatula-None-Drawer-22/trial_T20190908_054430_044367/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3K4J6M3CXHAIVK1FU9SJTPWIUMZAGO",
                    "high_descs":[
                        "Turn left and walk up to the kitchen counter right of the oven",
                        "Pick up the spatula from the counter",
                        "Turn around and walk down to the kitchen counter by the microwave",
                        "Open the kitchen drawer under the microwave and put the spatula in it",
                        "Walk a couple feet further left past the microwave and turn to face the counter",
                        "Pick up the spatula from the counter",
                        "Move a couple feet right and turn to face the counter by the microwave",
                        "Open the kitchen drawer under the microwave and put the spatula in it"
                    ],
                    "task_desc":"Put the spatulas in the kitchen drawer",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Spatula"
            ]
        },
        "train/pick_cool_then_place_in_recep-Plate-None-Cabinet-22/trial_T20190908_084019_408981/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AUTYWXILTACCR_3N2BF7Y2VTBXXH5FBI06NG3J3KUHM5",
                    "high_descs":[
                        "Walk forward, then turn left at the window to reach the sink.",
                        "Grab the black plate from the sink.",
                        "Turn around, then turn left when you get to the fridge.",
                        "Cool the plate in the fridge, then take it out again.",
                        "Turn left and walk back to the sink.",
                        "Place the plate in the cabinet underneath the sink, to the right."
                    ],
                    "task_desc":"Place a cooled plate in a cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3TPZPLC3M3TOOCVTOD3W0QW4PKR3PK",
                    "high_descs":[
                        "Begin walking across the room, then hang a left and walk over to the sink.",
                        "Take the black plate out of the sink basin.",
                        "Turn around and start walking across the room, then turn left and walk up to the fridge.",
                        "Open the fridge and put the black plate inside on the top shelf, then close the door, after a couple seconds open the door and remove the plate then close the door again.",
                        "Turn left and walk over to the counter.",
                        "Open the second cabinet door from the right in front of you and place the chilled plate in the cabinet then close the door."
                    ],
                    "task_desc":"Put a chilled black plate in a kitchen cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1AKL5YH9NLD2V_3WJ1OXY92DX325VXBBGV1CFK6J2A8K",
                    "high_descs":[
                        "Walk to the blue trash can then turn left and walk to the sink.",
                        "Pick up the black plate in the sink.",
                        "Turn around and walk to the fridge.",
                        "Chill the plate in the fridge, then pick up the plate from the fridge and close the fridge.",
                        "Turn left and walk to right cabinet below the sink.",
                        "Place the plate in the right cabinet below the sink."
                    ],
                    "task_desc":"Place a chilled black plate in the right cabinet below the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Plate-None-Cabinet-22/trial_T20190908_083901_120678/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFU00NU09CFXE_374TNBHA8ECA4RTWDBBBQPIR3G3YQ5",
                    "high_descs":[
                        "Turn and face the dishes in the kitchen sink.",
                        "Pick up the black plate that's in the sink.",
                        "Carry the black plate over to the fridge.",
                        "Place the plate in the fridge on the top shelf and then remove after it has cooled. ",
                        "Carry the plate back to stand in front of the kitchen sink.",
                        "Open the cupboard beneath the right end of the kitchen sink and place the plate inside. "
                    ],
                    "task_desc":"Place a cooled plate in the cupboard beneath the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3V0Z7YWSI1HC8EW66PYQN8GU5UWV2Q",
                    "high_descs":[
                        "Please turn to your right.",
                        "Pick up the black plate that's in the sink please.",
                        "Turn around and walk to the fridge that's on your left and face it.",
                        "Open the fridge and put the plate to the left of the lettuce and then close the door and let it cool off before retrieving it and closing the door.",
                        "Turn left and walk to the cupboard.",
                        "Open the second cupboard from the right and put the plate down there."
                    ],
                    "task_desc":"Put a cold plate in the cupboard.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1AKL5YH9NLD2V_3YWRV122CVGNHE9VHGXM1DREDOS8UW",
                    "high_descs":[
                        "Turn right to face the sink.",
                        "Pick up the black plate in the sink.",
                        "Turn around and walk to the fridge on the left side of the room.",
                        "Chill the black plate in the refrigerator and then pick the plate up and close the fridge.",
                        "Turn left and walk to the cabinets below the sink.",
                        "Place the plate in the right cabinet below the sink and then close the cabinet."
                    ],
                    "task_desc":"Place a chilled black plate in the right cabinet below the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Plate-None-Cabinet-22/trial_T20190907_200807_715947/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2NGMLBFZ3YQP5_39U1BHVTDO8MG4O05UCG50X1EP4T3B",
                    "high_descs":[
                        "Turn left, walk to sink.",
                        "Take black plate from the sink.",
                        "Turn right, turn right, walk to refrigerator.",
                        "Put plate in refrigerator, close door, wait a short time, take plate from refrigerator.",
                        "Got to cabinet immediately to left of refrigerator.",
                        "Open cabinet door and put plate on the bottom shelf."
                    ],
                    "task_desc":"Put a plate on bottom shelf in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3QL2OFSM99ZCYRFZ1R15P4V3VKFCNB",
                    "high_descs":[
                        "Turn to the left and face the sink.",
                        "Take the plate out of the sink.",
                        "Go to the right to stand in front of the fridge.",
                        "Put the plate in the fridge and shut the door and then open the door and take the plate out and shut the door again.",
                        "Move to the left and face the lower cabinet to the left of the fridge.",
                        "Put the plate in the cabinet left of the fridge."
                    ],
                    "task_desc":"Put a clean plate in the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3YT88D1N0BFNDLYDBLYO49A5VB1K3I",
                    "high_descs":[
                        "Take a step forward, then turn left and walk up to the sink.",
                        "Pick up the black plate that is in the sink.",
                        "Turn around and walk towards the wall, then turn left and walk up to the fridge.",
                        "Open the fridge and place the black plate inside on the top shelf, then close the fridge door, after a couple seconds open the fridge and remove the plate, then close the door again.",
                        "Turn around and walk forward, then turn right and walk forward, then turn right to face the counter to the left of the fridge.",
                        "Open the rightmost cabinet door below the counter and put the chilled plate inside the cabinet then close the door."
                    ],
                    "task_desc":"Put a chilled plate in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Spoon-Cup-CounterTop-22/trial_T20190906_200019_392987/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1AKL5YH9NLD2V_3AQF3RZ55BZBUITHTC5PVZUKW9HF6H",
                    "high_descs":[
                        "Turn to the left then turn left again when you reach the blue trash can and then walk to the sink.",
                        "Pick up the spoon to the left of the black plate.",
                        "Walk one step to the left and face the sink.",
                        "Place the spoon inside the orange cup in the sink.",
                        "Pick up the orange cup in the sink.",
                        "Walk two steps left and then turn to face the counter.",
                        "Place the cup down in front of the knife with the yellow handle on the counter."
                    ],
                    "task_desc":"Place a cup with a knife in it on the counter in front of the knife.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3R5F3LQFV517O5QLUKLQFRWTTBFOZ7",
                    "high_descs":[
                        "Turn to the left and walk to the sink. ",
                        "Pick up the spoon from the sink. ",
                        "Turn slightly and walk to the counter to the left of the sink. ",
                        "Place the spoon, handle down, into the wine glass that is in the sink. ",
                        "Pick up the wine glass containing the spoon from the sink. ",
                        "Turn left and walk to the counter above the dishwasher.",
                        "Place the wine glass containing the knife on the counter. "
                    ],
                    "task_desc":"Stacking dishes on the counter. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3SNVL38CI79BQLUW4E9PXCEZ0MLCKA",
                    "high_descs":[
                        "walk on over to the kitchen sink",
                        "grab a spoon out of the sink",
                        "move a bit to the left of the kitchen sink",
                        "place the spoon in the wine cup in the kitchen sink",
                        "pick up the cup with the spoon in it",
                        "walk over to the kitchen counter to the right of the microwave",
                        "place the cup down on the kitchen counter there"
                    ],
                    "task_desc":"place a cup with a spoon in it on the kitchen counter next to the microwave",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Microwave",
                "Knife",
                "Spoon",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-CounterTop-22/trial_T20190909_023544_721677/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_37TD41K0AK0HZTT25V78PKPBCF8CSX",
                    "high_descs":[
                        "turn to the left and take a few steps and turn to the right and go to the sink",
                        "pick up the cup from the sink ",
                        "turn to the left and go to the front of the microwave and turn to the right facing the microwave",
                        "put the cup in the microwave and turn on the microwave and heat the cup and take out the cup from the microwave when done heating",
                        "turn to the right and take a few steps and turn to the left facing the counter",
                        "put the cup right of the white cup on the counter top"
                    ],
                    "task_desc":"Place a heated cup on the counter top",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3AAPLD8UCF89V1HXGNQZAGIDRQQHTZ",
                    "high_descs":[
                        "walk to face sink",
                        "pick up goblet from sink",
                        "walk to face microwave",
                        "warm goblet in microwave, remove goblet from microwave",
                        "turn to the right of the microwave to face counter top",
                        "put goblet on counter top"
                    ],
                    "task_desc":"put a warmed goblet on kitchen counter top",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RVDEU138ZF9P_3WYGZ5XF3Z6ZIR5QX8O6D32JHONKSO",
                    "high_descs":[
                        "Turn left and walk towards the kitchen sink, then turn right.",
                        "Pick up the brown glass from inside the sink.",
                        "Turn left and walk towards the microwave, then turn right.",
                        "Open the microwave and place the glass inside, then take the glass out",
                        "Shut the microwave and turn right, and walk towards the white mug on the counter.",
                        "Place the glass next to the white mug."
                    ],
                    "task_desc":"Microwave the glass and place it on the kitchen counter. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Kettle",
                "Mug",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-CounterTop-22/trial_T20190909_023638_397924/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_31LVTDXBLA1Y1INV3J022TA2KNKRLN",
                    "high_descs":[
                        "Walk forward to the counter then turn right and walk to the counter to the left of the sink.",
                        "Pick up the orange wine glass that's in front of you.",
                        "Take a couple steps to your left until you're in front of the microwave.",
                        "Warm the wine glass in the microwave then take it back out and close the door.",
                        "Take a small step to your right.",
                        "Put the wine glass on the edge of the counter ."
                    ],
                    "task_desc":"Put a warm wine glass on the counter.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1T643M1P572AA_32M8BPYGAWD5MR6B259DB943197IGU",
                    "high_descs":[
                        "move forward and turn right and move to the counter",
                        "pick up the cup  off of the sink",
                        "turn left and move forward and then turn right and face to the microwave",
                        "place the cup in the microwave and heat it up and then take it out",
                        "turn right and walk forward and then turn left and face towards the counter",
                        "place the cup on to the counter"
                    ],
                    "task_desc":"Take the cup to the microwave and heat it up and after it is done place it on the counter.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3NS0A6KXC7ZRHHVL29XZB47TXM3ZG2",
                    "high_descs":[
                        "Walk ahead and veer right to the counter left of the sink.",
                        "Pick up the yellow cup on the counter.",
                        "Take a few steps left.",
                        "Heat the cup in the microwave.",
                        "Take a step right.",
                        "Place the cup on the counter, in front and to the right of the fork."
                    ],
                    "task_desc":"Place a heated cup on a counter.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Microwave",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-Cabinet-22/trial_T20190907_173342_454704/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_317HQ483IA93BU1ZT1XR07TY8OZINH",
                    "high_descs":[
                        "Go forward and stand in front of the sink.",
                        "Take the wine glass out of the sink.",
                        "Go to the left and stand in front of the microwave.",
                        "Put the mug into the microwave and shut the door and then open it and take the mug out.",
                        "Look up to the cabinets above the microwave.",
                        "Open the cabinet to the left above the microwave and put the glass in and shut the door."
                    ],
                    "task_desc":"Put a warmed glass in the cupboard.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_33PPUNGG3BMALII1MC2U9M1Y5VIZR5",
                    "high_descs":[
                        "Walk to the sink straight ahead. ",
                        "Pick up the wine glass to the left of the sponge. ",
                        "Move to the counter space to the left of the dishwasher in front of the microwave. ",
                        "Place the glass in the microwave, heat up the glass, take the glass out of the microwave and close the door. ",
                        "Look up at the cabinets above the microwave. ",
                        "Open the door to the cabinet on the left, place the glass inside the cabinet, and close the door. "
                    ],
                    "task_desc":"To heat a glass and put in the cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PGS1Q1XAY79I_3YMU66OBIQPX579T0F2BABJM7Y0GHE",
                    "high_descs":[
                        "Walk to the left side of the sink.",
                        "Pick up the brown goblet in the sink.",
                        "Turn to your left and walk to the microwave oven.",
                        "Open the microwave door and place the goblet on the plate in the microwave to the right of the egg, close the microwave door, turn the oven on and when it is done cooking, open the microwave door and pick up the goblet.",
                        "Look up to the cupboard above the microwave oven and open the door of the left cupboard.",
                        "Place the goblet at the right front of the cupboard and close the cupboard door."
                    ],
                    "task_desc":"Move a goblet on the shelf to the microwave oven then into the cupboard",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_cool_then_place_in_recep-PotatoSliced-None-GarbageCan-22/trial_T20190909_040714_562307/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3AMW0RGHOGT3D5A124CSAQECOZ8PN5",
                    "high_descs":[
                        "Turn around, and walk to the sink.",
                        "Pick up the knife.",
                        "Turn left, walk past the sink, and turn right.",
                        "Slice the potato on the counter.",
                        "Turn around, walk to the counter, turn left, and walk to the fridge.",
                        "Open the fridge, put the knife in the fridge, and close the fridge.",
                        "Turn around, walk to the counter, turn right, and walk to the counter.",
                        "Pick up a potato slice.",
                        "Turn around, walk to the counter, turn left, and walk to the fridge.",
                        "Open the fridge, put the potato slice in the fridge, close the fridge, open the fridge, pick up the potato slice, and close the fridge.",
                        "Face the trashcan to the right.",
                        "Put the potato slice in the trashcan."
                    ],
                    "task_desc":"Put a knife in the fridge, and a cold potato slice in the trashcan.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3KAKFY4PGXT4SFUN7Q2TSFFUX6LI39",
                    "high_descs":[
                        "Turn around and step forward to face the sink.",
                        "Pick up the knife in the sink.",
                        "Turn left to face the potato on the sink.",
                        "Cut the potato on the sink into slices.",
                        "Turn right and walk forward to face the fridge.",
                        "Place the knife in the fridge.",
                        "Turn left and step forward to face the counter.",
                        "Pick up a slice of potato on the counter.",
                        "Turn right and walk forward to face the fridge.",
                        "Cool the potato slice in the fridge and remove it.",
                        "Step to the right to face the trash can.",
                        "Place the potato slice in the trash can."
                    ],
                    "task_desc":"To cool a potato slice and place it in the trash can.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AISNLDPD2DFEG_3LUY3GC632REAKIEMXV3ETSMOMCP77",
                    "high_descs":[
                        "Turn around and go to the sink",
                        "Pick up the knife in the sink",
                        "Move a bit to the left",
                        "Slice the potato on the counter",
                        "Turn around, go forward ,turn left and go to the fridge",
                        "Put the knife in the fridge",
                        "Turn around, go forward, turn right and go to the counter",
                        "Pick up an potato slice from the counter",
                        "Turn around, go forward ,turn left and go to the fridge",
                        "Put the potato slice in the fridge, wait, pick up the potato slice from the fridge",
                        "Move a bit to the right",
                        "Put the potato slice in the bin"
                    ],
                    "task_desc":"Slice a potato, cool a slice, an throw it into the bin",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato",
                "Knife"
            ]
        },
        "train/pick_cool_then_place_in_recep-PotatoSliced-None-GarbageCan-22/trial_T20190909_041110_300557/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A271V19C06841K_3VJ40NV2QLEJNI3KK0LPUPFE3ECOT6",
                    "high_descs":[
                        "turn around, turn left to the counter",
                        "pick up knife from counter",
                        "turn around, turn right to the counter",
                        "slice the potato on the counter",
                        "turn around, turn left to the fridge ",
                        "open door, place knife on to the shelf, close door",
                        "turn around, turn right to the counter",
                        "pick up slice of potato from counter ",
                        "turn around, turn left to the fridge ",
                        "open fridge door, place potato on shelf, close door, open door, take potato out, close door",
                        "turn right, turn left to the trash can",
                        "place potato into trash can"
                    ],
                    "task_desc":"pick up knife, cut potato, put in fridge, remove from fridge, place in trash can ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3MRNMEIQW8X4084QLI5IX4TY5NLLD5",
                    "high_descs":[
                        "Turn to your right and go across the kitchen to the counter top between the stove and the refrigerator. ",
                        "Pick up the knife to the right of the apple on the counter top. ",
                        "Turn around and walk across the kitchen, then turn to the counter top on your right, just before the microwave. ",
                        "Cut the potato in front of the egg, on the counter, into slices. ",
                        "Turn around and go to the end of the counter, then turn to your left and go to the refrigerator. ",
                        "Place the knife on the top shelf of the refrigerator, in front of the loaf of bread. ",
                        "Turn around and go back to the end of the counter, turn right and go to the counter across from you where the potato  is. ",
                        "Pick up one of the potato slices. ",
                        "Turn around and go to the end of the counter, then turn to your left and go to the refrigerator. ",
                        "Place the tomato slice on the top shelf of the refrigerator, to the right of the head of lettuce, wait a moment for the potato slice to chill, then remove the potato slice from the refrigerator. ",
                        "Move over to your right, to the garbage bin on the floor to the right of the refrigerator. ",
                        "Put the potato slice in the garbage bin on the floor. "
                    ],
                    "task_desc":"Put a knife in the refrigerator and a cold potato slice in the garbage. ",
                    "votes":[
                        1,
                        1,
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3MHW492WW34A07MXCF6R33EU53MMVM",
                    "high_descs":[
                        "Turn around to walk to the counter by the toaster.",
                        "Pick up the knife.",
                        "Turn left to walk back to the counter to the left of the sink.",
                        "Slice the potato on the counter with the knife.",
                        "Turn right to walk to the fridge.",
                        "Place the knife in the fridge.",
                        "Turn left to walk to the counter above the dishwasher.",
                        "Pick up a slice of potato from the counter.",
                        "Make a right and walk to the fridge.",
                        "Chill the potato slice in the fridge, removing it afterwards.",
                        "Make a right to reach the trash can next to the fridge.",
                        "Put the potato slice in the trash can."
                    ],
                    "task_desc":"Chill a potato slice in the fridge to throw away in the trash can.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato",
                "Knife"
            ]
        },
        "train/pick_cool_then_place_in_recep-Mug-None-Cabinet-22/trial_T20190910_111425_326630/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_34HJIJKLP8NUWHXR6B6VH9XUJYNV4U",
                    "high_descs":[
                        "Turn right, go forward to the counter, turn right, go forward to the microwave.",
                        "Take the mug from the cabinet above the microwave on the left.",
                        "Turn around, go forward to the counter, turn left, go forward to the fridge.",
                        "Put the mug in the fridge to the left of the lettuce. Close then open the fridge door. Take the mug from the fridge.",
                        "Turn right, go forward, stop at the start of the oven.",
                        "Put the mug in the cabinet below the sink on the left to the right of the sponge."
                    ],
                    "task_desc":"Put a cold mug in a cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3NQL1CS15UZAUOBBVIU2XY11EZHVYA",
                    "high_descs":[
                        "Turn right and then right again to stand in front of the microwave.",
                        "Open the cabinet above, and to the left side of the microwave and take the mug out.",
                        "Go to the right and stand in front of the fridge.",
                        "Put the mug in the fridge and shut the door and then open the door and take the mug out again.",
                        "Go left and face the lower cabinets below the sink.",
                        "Put the mug in the cabinet under the right side of the sink and close the door."
                    ],
                    "task_desc":"Put a chilled mug in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3QXNC7EIPLMF0M2NK9EXDOIKBUR90F",
                    "high_descs":[
                        "Turn right and cross the room head to the cabinet above the microwave",
                        "Open the cabinet and pick up the mug in the cabinet, then close it",
                        "Turn right walk straight head to the fridge",
                        "Open the fridge put in the mug then take it out and close the fridge",
                        "Turn left then walk straight towards the sink cabinet",
                        "Open the cabinet below the sink and put in the mug and close it"
                    ],
                    "task_desc":"Put a chilled mug in the cabinet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cabinet"
            ]
        },
        "train/pick_cool_then_place_in_recep-Mug-None-Cabinet-22/trial_T20190908_144232_130522/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_37C0GNLMHIUMHN1JYEZG8LB1FJ3D6E",
                    "high_descs":[
                        "Turn left walk forward then head to the left cabinet above the microwave",
                        "Open the cabinet and pick up the mug then close the cabinet",
                        "Turn right then walk forward head to the fridge",
                        "Open the fridge put in and out the mug then close the fridge",
                        "Turn left and head to the cabinet beside the fridge",
                        "Open the cabinet put in the mug then close the cabinet"
                    ],
                    "task_desc":"Put the chilled mug in the cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A16184N1RO5OJV_3F1567XTNZW3OF7M178CSU92OYF9Q3",
                    "high_descs":[
                        "Walk to the left, turn left near the cabinet, walk straight a little bit, turn right to go to the microwave and look up to the cabinet on top of it. ",
                        "Open the cabinet, pick up a cup that is in the cabinet and close the cabinet. ",
                        "Turn around, walk slightly to the front and turn left to go to the fridge. ",
                        "Open the fridge, put the cup on the rack next to the black plate, close the fridge, let it cool for a while, pick it up again and close the fridge. ",
                        "Go slightly to the left to the cabinet beside the fridge. ",
                        "Open the cabinet under the counter top, put the cup in it and close the cabinet. "
                    ],
                    "task_desc":"Store a cold cup in the cabinet under the counter top beside the fridge. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3ZR9AIQJUE0E3GWB3EI6WG74P3P04O",
                    "high_descs":[
                        "Turn left and walk over to the microwave and look up at the upper cabinets.",
                        "Open the left cabinet in front of you and take out the white mug, then close the cabinet.",
                        "Turn around and walk over to the fridge.",
                        "Put the mug in the fridge, after a couple seconds take out the mug and close the fridge.",
                        "Walk over to the section of counter that is to the left of the fridge.",
                        "Open the cabinet door below the counter and put the chilled mug inside, then close the cabinet door."
                    ],
                    "task_desc":"Put a chilled white mug in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_cool_then_place_in_recep-Mug-None-Cabinet-22/trial_T20190910_105639_265144/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_39DD6S19JS2TX3ZUWE7BB1MHKYFZEW",
                    "high_descs":[
                        "Turn to the left, and then the left again. Find the microwave on the right.",
                        "Open the top left cabinet and take out a mug. Close the cabinet.",
                        "Carry the cup and turn to the right. Find the fridge.",
                        "Open the fridge and place the cup inside. Shut the fridge and then open it again. Take out the cup and shut the door.",
                        "Carry the and turn to the left to locate the sink.",
                        "Open the bottom cabinet under the sink and place the cup inside."
                    ],
                    "task_desc":"Chill a cup and place it in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3E4GGUZ1TBI6DSOS3T90MLPFJMTK2A",
                    "high_descs":[
                        "Turn left and walk past the counter on your left then turn left and walk to the microwave that's on the counter in front of you so you're standing in front of it facing it.",
                        "Open the cupboard door that's above and to the left of the microwave and grab the mug that's in there before closing the door.",
                        "Turn right and walk over the the fridge that's in front of you to the right so you're standing in front of it facing it.",
                        "Chill the mug in the fridge then get it back out and close the door.",
                        "Turn left and take two steps towards the counter so you can use the cupboard under the sink.",
                        "Open the cupboard under the right side of the sink and put the mug down there."
                    ],
                    "task_desc":"put a cold mug in the cupboard.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3X08E93BHY9NWEM4ORR22F19YW6663",
                    "high_descs":[
                        "Walk around the table and go up to the microwave.",
                        "Grab a coffee cup out of the top-left drawer.",
                        "Walk to the front of the fridge.",
                        "Put the cup in the fridge, then take it out.",
                        "Walk to the counter where the pan is.",
                        "Store the mug in the second bottom cabinet from the right."
                    ],
                    "task_desc":"Chill a cup and store it in a cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Apple-None-Fridge-22/trial_T20190908_210321_417277/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3HL8HNGX48S6XQHDNRXIGV5OH14F9N",
                    "high_descs":[
                        "Turn right and then right again to face the counter.",
                        "Pick the apple up from the counter.",
                        "Go around the counter and stand in front of the microwave.",
                        "Put the apple in the microwave and shut the door and then open the door and take the apple out.",
                        "Turn around and cross the room to the left to stand in front of the fridge.",
                        "Put the apple in the fridge and shut the door."
                    ],
                    "task_desc":"Put a warmed apple in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3JWH6J9I9V419B9RJZURF69N7S0BN7",
                    "high_descs":[
                        "Turn right then walk forward then face island on your right",
                        "Pick up the apple on the table",
                        "Turn right walk across the room and head to the microwave",
                        "Open the microwave put in and out then close the microwave",
                        "Turn right then cross the room head to the fridge",
                        "Open the fridge then put in the apple then close it "
                    ],
                    "task_desc":"Put the heated apple in the fridge",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3OJSZ2ATDVNAHA0V2IMPGNN5XH057G",
                    "high_descs":[
                        "Take a step forward then turn right and take another step then turn right to face the counter.",
                        "Pick up the apple that's in front of you.",
                        "Turn right and take a step then turn left and walk to the dishwasher then take a couple steps left to stand in front of the microwave.",
                        "Cook the apple in the microwave then take it back out and close the door.",
                        "Turn right and walk to the counter then move to your right until you're in front of the fridge.",
                        "Put the apple in the fridge then close the door."
                    ],
                    "task_desc":"Put a microwaved apple in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple"
            ]
        },
        "train/pick_heat_then_place_in_recep-Apple-None-Fridge-22/trial_T20190908_210352_288346/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_39PAAFCODPRED2CHLC73PH9MZ2ZTVT",
                    "high_descs":[
                        "Walk forward to the wall then turn right and walk to the end of the counter and turn right to face it you should be looking at an apple.",
                        "Pick up the apple that's in front of you.",
                        "Turn right and take a step then turn left and walk to the dishwasher then take a step or two to your left so you're standing in front of the microwave.",
                        "Cook the apple in the microwave then take it back out and close the door.",
                        "Turn right and take a step then turn right and walk to the counter then turn left and walk to the fridge.",
                        "Put the apple in the fridge then close the fridge door please."
                    ],
                    "task_desc":"Put a microwaved apple in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3MHW492WW34A07MXCF6R33EU5TJVM8",
                    "high_descs":[
                        "Walk to the kitchen counter on your right.",
                        "Grab an apple from the counter.",
                        "Walk to the microwave behind the counter.",
                        "Put the apple in the microwave, then grab it.",
                        "Go to the fridge on your right.",
                        "Put the apple in the fridge."
                    ],
                    "task_desc":"Heat an apple and cool it.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3VHHR074H68OJZ3GU52WXCJ2J7Z7L5",
                    "high_descs":[
                        "Walk to the door then turn right and continue forward, then turn right to face the rounded counter top",
                        "Pick up the apple that is on the table",
                        "Turn right  then make a quick left to go around the counter and walk to the microwave across the room",
                        "Open the microwave and place the apple on the plate inside then close the door and turn on the microwave.  Open the microwave and pick up the apple the close the microwave",
                        "Turn around and walk to the counter, at the counter turn left and head to the white fridge",
                        "Open the fridge nd place the apple on the top shelf to the left of the tomato then close the fridge"
                    ],
                    "task_desc":"Place a heated apple into a fridge",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Microwave",
                "Apple",
                "Fridge"
            ]
        },
        "train/pick_heat_then_place_in_recep-Apple-None-Fridge-22/trial_T20190908_210251_592689/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_339ANSOTR8TAOD2USWUS91WW8NKIKN",
                    "high_descs":[
                        "Turn around and walk to the rounded counter on the right.",
                        "Pick up the apple in the middle of the counter.",
                        "Turn right, hang a left around the counter and walk to the microwave on the counter ahead.",
                        "Put the apple inside the microwave, heat it, remove it and close the door.",
                        "Turn around and walk to the white fridge on the left.",
                        "Put the apple inside the fridge on the top shelf to the left of the lettuce and close the door."
                    ],
                    "task_desc":"Place a heated apple in a fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_37M28K1J0T407BDEYN23RO80GRRJAZ",
                    "high_descs":[
                        "Turn around and go to the rounded end of the counter top. ",
                        "Pick up the apple closest to you, on the counter. ",
                        "Turn to your right and go past the counter, then turn to your left to step into the main kitchen area and head to the end of the left counter where the microwave is. ",
                        "Place the apple in the microwave, heat it up, then remove the apple from the microwave. ",
                        "Turn around and walk to the counter, then turn to your left and go to the refrigerator across from you. ",
                        "Place the apple on the top shelf, to the left of the lettuce, in the refrigerator. "
                    ],
                    "task_desc":"Put a warm apple in the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3U84XHCDIF4B512178VY2FAQ7F8Z4P",
                    "high_descs":[
                        "Turn to face the counter with the knife, apple, and tomato.",
                        "Pick the apple up from the counter.",
                        "Cross the room and stand in front of the microwave.",
                        "Put the apple in the microwave and shut the door and then open the door and pick the apple up again.",
                        "Cross the room and turn to stand in front of the fridge.",
                        "Put the apple on the shelf in the fridge and close the door."
                    ],
                    "task_desc":"Put a heated apple in a fridge.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Kettle",
                "Apple",
                "Pan"
            ]
        },
        "train/pick_two_obj_and_place-Cup-None-Microwave-22/trial_T20190907_205445_957867/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_30IQTZXKANNXGTYNRHVUS5K0O8ZX0S",
                    "high_descs":[
                        "Turn to go around the table and go to the kitchen sink.",
                        "Take the brown glass on the right inside the sink.",
                        "Take the brown glass to the microwave on the left.",
                        "Place the brown glass in the microwave and close the door.",
                        "Go back to the sink on the right.",
                        "Take the other brown glass in the sink. ",
                        "Go back to the microwave on the left.",
                        "Place the brown glass on the left of the brown glass inside the microwave "
                    ],
                    "task_desc":"Microwave the glasses.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cup"
            ]
        },
        "train/pick_clean_then_place_in_recep-Spatula-None-Drawer-22/trial_T20190907_145107_155555/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3EJJQNKU9UMOUXI7GQWN9FXT919RH7",
                    "high_descs":[
                        "Go left to stand in front of the counter to the right of the stove.",
                        "Pick the spatula up from the counter.",
                        "Turn around and stand in front of the sink.",
                        "Put the spatula in the sink, turn on the water and then turn it off and pick the spatula up.",
                        "Go to the right and face the drawer to the right of the stove.",
                        "Open the drawer, put the spatula in and shut the drawer."
                    ],
                    "task_desc":"Put a clean spatula in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3FPRZHYEP1O1TWSPAPCV6ILMB2XV3Q",
                    "high_descs":[
                        "Turn left and walk to the counter.",
                        "Pick up the spatula next to the toaster.",
                        "Turn left and go to the sink.",
                        "Wash the spatula in the sink.",
                        "Turn around and open the drawer to the right of the stove.",
                        "Put the spatula in the drawer."
                    ],
                    "task_desc":"Put a washed spatula in the drawer to the right of the stove.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3NPI0JQDARMTNTTN3S9NI302JDAPTH",
                    "high_descs":[
                        "Turn left, walk to eh counter by the stove",
                        "grab the spatula on the counter",
                        "turn left, walk to the sink",
                        "put spatula in the sink, wash it with water, take the spatula out",
                        "turn around, walk to the counter by the stove",
                        "open the first drawer, put the spatula in it"
                    ],
                    "task_desc":"wash the spatula in the sink, put it in the first drawer by the stove",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3LPW2N6LKWJ4UWQTJIQJPTHNBYKU59",
                    "high_descs":[
                        "turn left, walk to the counter by the stove",
                        "grab the spatula on the counter",
                        "turn around, walk to the sink on the right",
                        "put the spatula in the sink, wash it, take the spatula out",
                        "turn around to the counter by the stove",
                        "open the drawer, put the spatula in, close the drawer"
                    ],
                    "task_desc":"wash the spatula in the sink, put it in the drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_3LPW2N6LKWJ4UWQTJIQJPTHNBZP5UR",
                    "high_descs":[
                        "Turn left, move to the counter right of the stove.",
                        "Pick up the spatula from the counter.",
                        "Turn left, move to the counter in front of the sink.",
                        "Put the spatula in the sink, rinse it, pick it back up.",
                        "Turn right, move to the counter right of the stove.",
                        "Put the spatula in the drawer right of the stove."
                    ],
                    "task_desc":"Place a clean spatula into the drawer near the stove.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3NAPMVF0ZZWAXOVAORVAHU0RJDF722",
                    "high_descs":[
                        "Turn left and go to the toaster.",
                        "Pick up the spatula from the counter.",
                        "Turn left and go to the sink.",
                        "Put the spatula in the sink and wash it and take it back out.",
                        "Turn around and go back to the toaster.",
                        "Open the drawer and put the spatula away."
                    ],
                    "task_desc":"Wash and put away the spatula in the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Knife",
                "DishSponge",
                "Drawer",
                "Spatula",
                "Sink"
            ]
        },
        "train/pick_clean_then_place_in_recep-Spatula-None-Drawer-22/trial_T20190907_145132_203684/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3QILPRALQ8CAMOPMKFL0NIZK5D58NG",
                    "high_descs":[
                        "turn around and walk to the end of the room, then hang a right and walk to the end of the room again, turn right to face the kitchen counter",
                        "grab the spatula off of the counter",
                        "move to the end of the room ahead, then take a left and move to the sink at the end of the room",
                        "place the spatula inside of the sink and clean it off, then pick it back up",
                        "back up a bit and face the kitchen stove on your right",
                        "place the spatula inside of the pull out drawer to the right of the stove"
                    ],
                    "task_desc":"place a clean spatula inside of the pull out drawer",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALDWVFR4I0V2D_3R08VXYT7FCW94TH2BKH51GGN927WQ",
                    "high_descs":[
                        "Turn right, and then right again and walk to the door. Turn right  walk towards the white table. Face the table.",
                        "Pick up the metal spatula on the table.",
                        "Walk towards the door again, then turn left and walk towards the sink",
                        "Place the spatula in the sink and turn on the faucet so water fills the sink. Turn off water.",
                        "Take out the spatula, then turn right to face the oven and the stove top. Open the top drawer to the right of the stove",
                        "Place the spatula in the drawer then close it."
                    ],
                    "task_desc":"Find the spatula on the table, clean it, then place it in a drawer.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3L0KT67Y8HXMH7895F0GLPXSLV8YSW",
                    "high_descs":[
                        "Turn around and walk across the room head to the table",
                        "Pick up the turner on the table beside the plate",
                        "Turn to your right, walk a few steps then turn to your left and head to the sink",
                        "Put the turner on the sink, rinse it",
                        "Pick up the turner then turn around walk towards the toaster",
                        "Open the cabinet below the toaster and put the turner inside beside the knife, then close it "
                    ],
                    "task_desc":"Place the clean turner in the cabinet",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge",
                "Spatula"
            ]
        },
        "train/pick_clean_then_place_in_recep-Pan-None-CounterTop-22/trial_T20190907_060222_263381/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3KJYX6QCMCSCEAUEDA4IMP2B7YMJVR",
                    "high_descs":[
                        "Turn around, head towards the toaster, and then turn right towards metal pan on the counter.",
                        "Pick up the metal pan from the counter.",
                        "Take a step to the left to face the sink.",
                        "Place the pan in the sink, wash it, and pick it back up.",
                        "Turn right and head towards the toaster on the counter.",
                        "Place the pan to the left of the toaster."
                    ],
                    "task_desc":"Place a washed pan to the left of the toaster.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_35BLDD71I9E2EPZIVW74AJQ1QWPVZE",
                    "high_descs":[
                        "Turn around to face the counter to the right of the sink.",
                        "Pick the square pan up from the counter.",
                        "Move left to stand in front of the sink.",
                        "Put the pan in the sink, turn the water on and then turn it off and take the pan out of the sink. ",
                        "Turn around and stand to face the counter to the right of the stove.",
                        "Put the pan down on the counter to the left of the stove."
                    ],
                    "task_desc":"Put a clean pan on the counter.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3IXEICO7950LDNBIOWAEC39LO886TG",
                    "high_descs":[
                        "Turn around, then go straight, then turn left to face the counter.",
                        "Pick up the pan from on the counter, to the right of the bowl.",
                        "Go to the sink to your left.",
                        "Wash the pan in the sink.",
                        "Turn around, move forward, then turn left to approach the counter located to the right of the stove.",
                        "Put the pan on the counter to the left of the toaster."
                    ],
                    "task_desc":"Put a clean pan on the counter.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3HOSI13XH25DH7U0CTIDD51R2DQDDP",
                    "high_descs":[
                        "Turn right and approach the stove.",
                        "Pick up the pan on the counter to the left of the stove.",
                        "Move to the left to stand at the sink.",
                        "Wash the pan in the sink.",
                        "Turn right and go back to the stove.",
                        "Put the pan on the counter between the stove and the toaster."
                    ],
                    "task_desc":"Put a washed pan on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OVR4I9USS0U6KFCO4N4A0EK8EYQ44",
                    "high_descs":[
                        "Turn around and walk over to where the toaster is on the counter, then turn left and walk over to the section of counter to the right of the sink.",
                        "Pick up the dirty pan that is on the counter to the right of the butter knife.",
                        "Turn left and take a couple steps forward, then turn right to face the sink.",
                        "Put the dirty pan in the sink basin and turn on the water to clean it, after a couple seconds turn the water off and remove the now clean pan.",
                        "Turn around and take a couple steps, then turn left and walk up to the toaster on the counter.",
                        "Place the clean pan on the counter to the left of the toaster."
                    ],
                    "task_desc":"Put a clean pan on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pan"
            ]
        },
        "train/pick_clean_then_place_in_recep-Pan-None-CounterTop-22/trial_T20190910_161415_317849/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3GS6S824STELCPL4II161Y26NS5NWN",
                    "high_descs":[
                        "Turn to the right, and go to the counter beside the sink.",
                        "Pick up the pan that is on the right side of the counter.",
                        "Take the pan and take a step to the left to the sink.",
                        "Place the pan in the sink, turn the water on and off. Pick up the pan from the sink.",
                        "Turn around to the left, and locate the toaster on the counter.",
                        "Place the pan on the counter between the stove and toaster."
                    ],
                    "task_desc":"Clean a pan and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3X87C8JFV9SD85HNE5JM83UQMQ4QS6",
                    "high_descs":[
                        "Turn right and move to the counter past the stove.",
                        "Pick up the dirty pan on the counter.",
                        "Bring the pan to the sink on the left.",
                        "Clean the dirty pan in the sink with water. ",
                        "Bring the cleaned pan to the counter right of the stove. ",
                        "Put the cleaned pan on the counter right of the stove. "
                    ],
                    "task_desc":"Put a cleaned pan on the counter, right of the stove. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3Z4XG4ZF4B8FYI3QML89LKQI7Y08XZ",
                    "high_descs":[
                        "turn right, walk to the counter by the sink",
                        "grab the pan on the counter",
                        "walk to the left a little to the sink",
                        "put the pan in the sink, wash the pan with water, take the pan",
                        "turn around, walk to the counter by the stove",
                        "put the pan down on the counter"
                    ],
                    "task_desc":"wash the pan from the counter by the sink, put the pan by the stove",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3A7Y0R2P2R54IZZ9DP50AAZWNFXXJN",
                    "high_descs":[
                        "Turn to the right and go back to the sink.",
                        "Pick up the pan from the right side of the counter.",
                        "Take the pan and move a few steps left to the sink.",
                        "Place the pan in the sink. Turn on the water and turn it off. Take the pan out of the sink.",
                        "Carry the pan and move to the right, over to the toast.",
                        "Place the pan on the counter, to the left of the toaster."
                    ],
                    "task_desc":"Clean a pan and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3EJJQNKU9UMOUXI7GQWN9FXT97XHRX",
                    "high_descs":[
                        "Turn and face the counter to the right of the sink.",
                        "Pick the pan up from the counter to the left of the sink.",
                        "Move to the left and face the sink.",
                        "Put the pan in the sink, turn on the water and then turn it off and pick up the pan from the sink.",
                        "Go to the right and face the sink to the left of the stove.",
                        "Put the pan down on the sink to the left of the stove."
                    ],
                    "task_desc":"Put a clean pan on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_3Z7ISHFUH3C43D35N3WUI56TF4MZ8N",
                    "high_descs":[
                        "Move to stand at the counter between the kitchen sink and stove.",
                        "Pick up the pan from the counter next to the stove. ",
                        "Carry the pan to stand directly in front of the kitchen sink. ",
                        "Place the pan in the sink, turn on the water, wash the pan, and remove it from the sink. ",
                        "Carry the pan to the counter space to the right of the stove. ",
                        "Place the pan on the counter between the stove and the toaster. "
                    ],
                    "task_desc":"Place a washed pan on the counter by the toaster.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pan",
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-Pan-None-CounterTop-22/trial_T20190910_161323_966396/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_37ZHEEHM6Z3ZI6RTSR9F045JPQQ73M",
                    "high_descs":[
                        "Turn and go left and then left again and stand in front of the counter to the right of the sink.",
                        "Pick the pan up from the counter.",
                        "Move left and turn to face the sink.",
                        "Put the pan in the sink and turn on the water and then turn it off and pick up the pan.",
                        "Turn and go the the right and stand at the counter to the right of the stove.",
                        "Put the pan down on the counter to the right of the stove."
                    ],
                    "task_desc":"Put a clean pan on the counter.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3HRMW88U197MMHZJDATLHO42H5RM0B",
                    "high_descs":[
                        "Turn around and walk over to the kitchen counter right of the sink",
                        "Pick up the dirty square pan from the counter",
                        "Move slightly left then turn to face the kitchen sink",
                        "Wash the pan under the water in the sink then remove it",
                        "Turn around, walk a few feet, then turn left toward the counter right of the stove",
                        "Put the pan down on the counter"
                    ],
                    "task_desc":"Put the cleaned pan on the kitchen counter",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3T9K2RY06UO14_30LSNF239XC7M8C67IZ78JQ0XMXI21",
                    "high_descs":[
                        "Turn around and go to the counter by the sink.",
                        "Pick up a dirty pan on the counter.",
                        "Turn and go to the sink. ",
                        "Wash the pan in the sink and take the pan out of the sink.",
                        "Turn around and go to the counter by the stove.",
                        "Put the pan on the counter by the stove. "
                    ],
                    "task_desc":"Put the washed pan by the stove. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3EO896NRAZCX1IQP8F43L7EQAD7TJM",
                    "high_descs":[
                        "Turn around and move to the counter right of the sink.",
                        "Pick up the dirty pan on the counter. ",
                        "Turn left, bring the pan to the sink. ",
                        "Clean the pan in the sink with water. ",
                        "Bring the cleaned pan to the counter right of the stove. ",
                        "Put the cleaned pan on the counter right of the stove. "
                    ],
                    "task_desc":"Put a cleaned pan on the counter right of the stove. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AHBWX3WYMAB0E_3MH9DQ757ZT2ATFD0E9ATQ8C105UGK",
                    "high_descs":[
                        "Turn around and go across the room to the counter to the right of the sink.",
                        "Pick up the pan next to the stove.",
                        "Move left a few feet to the sink.",
                        "Wash the pan in the sink.",
                        "Turn right and move to the counter on the right of the stove.",
                        "With the handle facing the wall, put the pan on the counter between the stove and the toaster."
                    ],
                    "task_desc":"Put a clean pan on counter next to the toaster.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pan"
            ]
        },
        "train/pick_clean_then_place_in_recep-AppleSliced-None-CounterTop-22/trial_T20190907_175936_255587/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AT3C00TKZK13L_31LM9EDVOO9Z65L5BJIRC88YL9SJNA",
                    "high_descs":[
                        "Turn right walk forward and turn left towards the counter",
                        "Grab a knife from the counter",
                        "Walk with the knife back to the other side of the counter",
                        "Slice the apple on the counter",
                        "Walk to the other side of the counter and towards the microwave",
                        "Put the knife on the counter next to the microwave",
                        "Walk to the counter next to the stools",
                        "Grab a slice of the apple",
                        "Walk with the slice of the apple towards the sink",
                        "Put the slice of the apple in the sink, open the water and close it",
                        "Walk the the slice of the apple towards the microwave",
                        "Put the slice of the apple next to the knife on the counter"
                    ],
                    "task_desc":"Slice the apple, put it in the sink, fill with water, put it on the counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2V35L3RIRYYXV_34MAJL3QP742ZJ9AQTB8XSL9YRI43N",
                    "high_descs":[
                        "Turn to the left, walk around the counter top to face the knifes.",
                        "Pick up the knife on the right side.",
                        "Turn to the left, walk around the counter top.",
                        "Cut the apple by the square bowl.",
                        "Turn to the right walk around the counter top, walk forward.",
                        " Place the knife on the counter top to the left of the salt.",
                        "Turn around, walk around the counter top.",
                        "Pick up a slice of apple.",
                        "Turn right, walk to face the sink.",
                        "Place the apple in the sink on the right side towards the front. Turn on the water then turn off the water.",
                        "Pick up the apple from the sink.",
                        "Turn to the left, walk forward to face the counter top. Place the apple to the right of the knife on the counter top."
                    ],
                    "task_desc":"Cut the apple, put the knife and slice of apple on the counter top.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AHBWX3WYMAB0E_3BDCF01OG0BZDUDJL63F93JXTFCYLM",
                    "high_descs":[
                        "Turn right and go around the end of the peninsula to the other side of the peninsula.",
                        "Pick up the knife on the right.",
                        "Turn left and go back around to the other side of the peninsula.",
                        "Cut the apple into thirds that sits to the left of the bowl.",
                        "Turn right and go around the end of the peninsula and across the room to the dishwasher across the room.",
                        "Put the knife on the counter above the dishwasher with the blade pointing to the left.",
                        "Turn around and go around the end of the peninsula to the other side.",
                        "Pick up a third of the apple.",
                        "Turn right and go around the end of the island and across the room to the sink.",
                        "Wash the apple in the sink.",
                        "Move a few feet to the left.",
                        "Set the apple piece down on the counter to the right of the knife."
                    ],
                    "task_desc":"Put a piece of apple on the counter with the knife.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple",
                "Knife"
            ]
        },
        "train/pick_clean_then_place_in_recep-AppleSliced-None-CounterTop-22/trial_T20190907_175521_895052/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2NGMLBFZ3YQP5_30ZX6P7VFBC3HJWCP0K7KK50AB0J2C",
                    "high_descs":[
                        "Turn left, turn left, move to end of island, turn right to face island.",
                        "Pick up knife from island.",
                        "Turn left, walk around end of island, face the apple.",
                        "Cut apple on island in thirds.",
                        "Pick up knife from island, proceed around island in a zigzag fashion, walk to counter beside microwave.",
                        "Put knife on counter to right of microwave.",
                        "Turn right, turn right, walk around island to face apple.",
                        "Pick up one third of the apple on island.",
                        "Turn right, walk toward refrigerator, turn left, walk to sink.",
                        "Fill sink, drain sink, take apple out of sink.",
                        "Turn left, walk to counter, turn right to face counter.",
                        "Place apple piece behind knife on the counter."
                    ],
                    "task_desc":"Put rinsed apple behind knife on counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AT3C00TKZK13L_3VJ40NV2QL4B2THMOSW8T3VC9KZOT8",
                    "high_descs":[
                        "Turn right and walk towards the counter",
                        "Grab a knife from the counter",
                        "Walk to the other side of the counter ",
                        "Slice the apple on the counter",
                        "Walk to the counter next to the sink",
                        "Place the knife on the counter",
                        "Walk towards the island counter",
                        "Grab a slice of the apple",
                        "Walk towards the sink",
                        "Put the slice of the apple in the sink, open the water faucet and close it",
                        "Take the slice of apple and walk next the microwave",
                        "Put the slice of apple on the counter"
                    ],
                    "task_desc":"Slice the apple, put it in the sink, open the water faucet put the slice of apple on the counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_3W8CV64QJ5GIQXMLM9W1IUXZ3OY9HF",
                    "high_descs":[
                        "Move to stand at the end of the island closest to the window.",
                        "Pick up the sharp knife with yellow handle from the island.",
                        "Move around the curve of the island to the side with stools while carrying the knife.",
                        "Use the knife to slice the apple on the island.",
                        "Carry the knife over to the dishwasher.",
                        "Place the knife on the counter above the dishwasher.",
                        "Move back around the island to the side with the stools again.",
                        "Pick up a slice of apple from the island.",
                        "Carry the apple slice to the kitchen sink.",
                        "Place the apple in the sink, turn on the water, and then remove once it's washed.",
                        "Carry the apple slice to stand in front of the dishwasher.",
                        "Place the apple slice on the counter behind the knife you previously left there."
                    ],
                    "task_desc":"Move a washed apple slice to the counter by a knife.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Apple",
                "Knife",
                "Sink"
            ]
        },
        "train/pick_heat_then_place_in_recep-Mug-None-CoffeeMachine-22/trial_T20190906_184650_216044/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3A0VPWPASCO9J_3GS6S824STELCPL4II161Y26MY8NW1",
                    "high_descs":[
                        "Go to the end of the counter by the microwave.",
                        "Open the cabinet above the microwave, take out the coffee cup in the cabinet, and close the cabinet.",
                        "Put the coffee cup into the microwave.",
                        "Look down to the microwave under the cabinet,put the coffee cup into the microwave, heat it up, and take it back out of the microwave.",
                        "Turn and go to the coffee maker.",
                        "Put the coffee cup in the coffee maker. "
                    ],
                    "task_desc":"Put a warm coffee cup into the coffee maker.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3S0TNUHWKWZ10CY9VL7XRDNQQMGD85",
                    "high_descs":[
                        "Move to the microwave. ",
                        "Open the cabinet above the microwave and pick up the mug inside it. ",
                        "Bring the mug to the microwave.",
                        "Heat the mug in the microwave. ",
                        "Bring the mug to the coffee machine. ",
                        "Put the mug on the coffee machine."
                    ],
                    "task_desc":"Put a heated mug on the coffee machine. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A002160837SWJFPIAI7L7_3Z7VU45IP1YMSDJKOINF3VJL00TZ1J",
                    "high_descs":[
                        "Turn left then face right to the cabinets.",
                        "Open the left cabinet and grab the mug.",
                        "Look down and face the microwave.",
                        "Warm the mug up in the microwave for 3 seconds.",
                        "Grab the mug and turn around to the coffee machine.",
                        "Place the mug under the coffee machine."
                    ],
                    "task_desc":"Place the warm mug under the coffee machine.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Mug-None-CoffeeMachine-22/trial_T20190906_184715_596294/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3GLB5JMZF0CGTR4REJJLJQ4OE5GDG8",
                    "high_descs":[
                        "Walk straight towards the microwave on the counter.",
                        "Open the left cabinet to the top of the microwave and take out the cup inside of it.",
                        "Bring the cup down in front of the microwave.",
                        "Open the microwave, heat up the cup, and take it out of the microwave.",
                        "Turn around and head towards the coffee maker on the counter.",
                        "Place the cup on the coffee maker."
                    ],
                    "task_desc":"Place a warmed cup on the coffee maker.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3P529IW9K12TD3WOGGBRKICHMWCLFL",
                    "high_descs":[
                        "Go to the cabinet above the microwave.",
                        "Take the mug from the cabinet.",
                        "Place the mug in the microwave.",
                        "Heat the mug in the microwave.",
                        "Go to the counter behind you.",
                        "Place the mug in the coffee maker. "
                    ],
                    "task_desc":"Place a heated mug in the coffee maker. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3TVRFO09GNWADPN9GAHDQPCOQ55XLT",
                    "high_descs":[
                        "Move to the microwave.",
                        "Pick up the mug from the cabinet above the microwave. ",
                        "Bring the mug to the microwave.",
                        "Heat the mug in the microwave. ",
                        "Bring the mug to the coffee machine",
                        "Put the mug on the coffee machine. "
                    ],
                    "task_desc":"Put a heated mug on the coffee machine. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_cool_then_place_in_recep-Plate-None-SinkBasin-22/trial_T20190907_054906_406006/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3IAS3U3I0IXXZ0Y0187QMWMN2SL2BC",
                    "high_descs":[
                        "Turn around and walk to the sink that's on your right so you are standing in front of it facing it.",
                        "Pick up the black plate that's in the sink.",
                        "Turn around and walk to the fridge that's on your left and stand in front of it facing it.",
                        "Cool the plate in the fridge and then take it back out and close the door.",
                        "Walk back to the sink.",
                        "Put the plate in the sink."
                    ],
                    "task_desc":"Put a cold plate in the sink.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3YW4XOSQKT256EPAIVO7M346Z8Z1UY",
                    "high_descs":[
                        "Turn around and walk to the sink that you see on the left. ",
                        "Pick up the dark plate that is sitting in the sink.",
                        "Turn around completely and walk towards the fridge on your left. ",
                        "Open the fridge, sit the plate on the bottom shelf, close the fridge door, and open it a few moments later to take the chilled plate back out. ",
                        "Turn to your left and walk back over to the sink.",
                        "Place the plate back into the sink. "
                    ],
                    "task_desc":"Put a chilled plate back into the sink where it came from. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3Y54SXRO1O26FY1JKE8HS9N1RNZTU0",
                    "high_descs":[
                        "Turn around and stand in front of the sink.",
                        "Take the plate out of the sink.",
                        "Go to the right and stand in front of the fridge.",
                        "Put the plate on the bottom shelf of the fridge, close the door, open the door and take the plate out and shut the door.",
                        "Go left and stand in front of the sink.",
                        "Put the plate in the sink."
                    ],
                    "task_desc":"Put a warmed plate in the sink.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Plate-None-SinkBasin-22/trial_T20190907_054812_362534/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3AZHRG4CU71L0VR97SO6LPVWHYJ03M",
                    "high_descs":[
                        "turn around and walk forwards to the kitchen sink",
                        "grab the black and spotted plate out from inside of the sink",
                        "turn around and walk until you reach the fridge on your left, then turn to face the fridge and approach it",
                        "place the plate inside of the fridge to cool, then take it back out once it has cooled",
                        "turn left and walk back over to the sink",
                        "place the plate inside of the sink"
                    ],
                    "task_desc":"place a cooled plate in the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3KWTYT0873K1B63ZA4YIY6L4YSK5LP",
                    "high_descs":[
                        "Turn around, then go straight towards the sink.",
                        "Pick up the plate in the sink.",
                        "Turn around, then go straight, then turn left to go to the fridge.",
                        "Chill the plate inside the fridge.",
                        "Turn around, then turn right, and go to the sink.",
                        "Put the plate in the sink."
                    ],
                    "task_desc":"Put a cold plate in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3ZPPDN2SLYD66NVJW8OVXR0MBRV9EQ",
                    "high_descs":[
                        "Turn around to your left and head to the sink",
                        "Pick up the plate on the sink",
                        "Turn around, walk across the room then turn to your left",
                        "Open the fridge put the plate inside the fridge beside the cabbage then close the door",
                        "Open the fridge, get the plate, turn to your left then head to the sink",
                        "Put the plate on the sink"
                    ],
                    "task_desc":"Get the plate in the fridge going to the sink",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Plate-None-SinkBasin-22/trial_T20190907_054931_955559/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_31HQ4X3T3VR2H81AM0BQRHVWBBSLS4",
                    "high_descs":[
                        "Turn to your left and go to the sink",
                        "Pick up the plate on the sink",
                        "Turn to your right, head to the fridge on your left",
                        "Open the fridge, put the plate right next to the tomato and close it again",
                        "Open the fridge, pick up the plate then close the fridge. Turn around and head to the sink",
                        "Put the plate on the sink"
                    ],
                    "task_desc":"Putting the plate from the sink to the fridge, putting it back to the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6QFAYKNRSO75_37W3JXSD69PFOOPIPKAHIE0DQ3ZWYT",
                    "high_descs":[
                        "turn left to face the sink",
                        "pick up plate in the sink",
                        "turn around and walk towards the refrigerator and turn left to face it",
                        "open the refrigerator, then put the plate in it, close the door to the refrigerator. now take the plate out the refrigerator and close the door.",
                        "turn left and walk back towards the sink.",
                        "put the plate back in the sink"
                    ],
                    "task_desc":"put a plate in the refrigerator place it back in the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3OVR4I9USS0U6KFCO4N4A0EK8264Q2",
                    "high_descs":[
                        "Take a step forward then turn left and walk to the sink.",
                        "Get the black plate from the sink. ",
                        "Turn around and walk until your even with the fridge on your left then turn left and walk to the fridge.",
                        "Put the plate in the fridge under the tomato and close the door and let it cool down before opening the door and retrieving it making sure to close the door when you're done.",
                        "Walk back to teh sink.",
                        "Put the plate back in the sink."
                    ],
                    "task_desc":"Put a cold plate in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Fridge",
                "Plate",
                "Sink"
            ]
        },
        "train/pick_cool_then_place_in_recep-Lettuce-None-CounterTop-22/trial_T20190908_084626_474201/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_31QTRG6Q2W4XP4EF96L3R6CJSBBPYE",
                    "high_descs":[
                        "Turn left and take one step, then turn right and walk to the counter. ",
                        "Take the lettuce that is on the counter. ",
                        "Turn around and take two steps, then turn left and walk across the room. ",
                        "Open the fridge and put the lettuce inside, then close the fridge door for three seconds, then open the fridge and take the lettuce out. ",
                        "Turn to the left and take one step, then turn right and face the counter. ",
                        "Put the lettuce on the counter to the left of the salt shaker. "
                    ],
                    "task_desc":"To cool the lettuce. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_324G5B4FB6ZBM3EU5CGDZSREG4P70N",
                    "high_descs":[
                        "Go ahead to counter between sink and microwave.",
                        "Pick up lettuce from back of counter.",
                        "Turn right, proceed to refrigerator.",
                        "Open fridge, put lettuce on top shelf.  Close refrigerator door.  Wait four seconds.  Open refrigerator door.  Remove lettuce and close door.",
                        "Turn left, proceed until reach counter next to refrigerator.  Turn right to face counter.",
                        "Place lettuce on counter, in front of toaster and to the left of salt shaker."
                    ],
                    "task_desc":"Move lettuce to refrigerator, cool, move it to counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3OS46CRSLIQ8B415PZZAE7H8FPLV67",
                    "high_descs":[
                        "Turn left, hang a right at the counter and walk to the counter with the dishwasher ahead.",
                        "Pick up the head of lettuce to the right of the microwave on the counter.",
                        "Turn around, hang a left at the counter and walk to the white fridge ahead.",
                        "Put the head of lettuce inside the fridge on the top shelf off to the right side, chill it for seven seconds, remove it and close the door.",
                        "Turn left and walk to the counter on the right next to the fridge.",
                        "Put the chilled head of lettuce in between the green soap bottle and the salt shaker on the counter."
                    ],
                    "task_desc":"Place a chilled head of lettuce on a counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Lettuce"
            ]
        },
        "train/pick_cool_then_place_in_recep-Lettuce-None-CounterTop-22/trial_T20190908_084527_001326/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1SX8IVV82M0LW_31Q0U3WYDS6BTSZC1VKDDXAOLWA715",
                    "high_descs":[
                        "Walk to the kitchen table with the coffee maker on it.",
                        "Grab lettuce off the kitchen table.",
                        "Walk to the front of the fridge on your left.",
                        "Put lettuce in the fridge, then grab it.",
                        "Walk to the kitchen counter between the stove and fridge.",
                        "Put the lettuce on the counter."
                    ],
                    "task_desc":"Chill lettuce and prepare it on a counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3B1NLC6UG2NX3DTFF0ZXK65FNF2GPO",
                    "high_descs":[
                        "Turn around and walk to the counter to the left of the coffee maker. ",
                        "Pick up the head of lettuce to the right of the tomato. ",
                        "Turn left and walk to the fridge. ",
                        "Open the fridge door, place the lettuce on the top shelf of the fridge, close the door, open the door, take the lettuce out of the fridge, and close the door. ",
                        "Turn left and walk to the counter to the right of the stove. ",
                        "Place the head of lettuce on the counter in front of the salt shaker. "
                    ],
                    "task_desc":"To chill lettuce and place it on the counter. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3TXD01ZLD78UJ28R1LWQLNVB5RDU43",
                    "high_descs":[
                        "Turn around and then left. Find the long counter to the right.",
                        "Pick up the lettuce on the counter, to the right.",
                        "Hold the lettuce and turn to the left, a small amount, and move to the fridge.",
                        "Open the fridge and place the lettuce inside. Shut the fridge and then open it again. Take the lettuce out and shut the door.",
                        "Hold the lettuce and take a few steps to the left.",
                        "Place the lettuce on the counter, in front of the salt."
                    ],
                    "task_desc":"Chill lettuce and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ButterKnife",
                "Lettuce",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-Lettuce-None-CounterTop-22/trial_T20190919_002053_011262/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_34FNN24DCP0TWUWWPRCPT0721CYY5R",
                    "high_descs":[
                        "Turn around and walk over to the where the coffee machine is on the counter, then turn left.",
                        "Pick up the head of lettuce off of the counter.",
                        "Walk over to the fridge.",
                        "Put the head of lettuce in the fridge to get cold, after a couple seconds open the fridge and take out the chilled head of lettuce.",
                        "Turn left and walk towards the counter, turn right before the oven to face the counter.",
                        "Put the chilled head of lettuce on the back of the counter to the right of the stove."
                    ],
                    "task_desc":"Put a chilled head of lettuce on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A14IPKOBOPID9H_37ZHEEHM6ZD73VDROZYW1QPLJHY739",
                    "high_descs":[
                        "Turn around and head towards the sink then turn left and go towards the counter and then turn left",
                        "Pick up the lettuce from the counter",
                        "Turn left and make your way to the fridge",
                        "Put the lettuce in the fridge to chill, then take the lettuce out of the fridge",
                        "Turn left to go just past the fridge then turn right",
                        "Put the lettuce at the back of the counter, next to the stove"
                    ],
                    "task_desc":"Put the chilled lettuce on the counter next to the stove",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3KOPY89HMBT0NQETP8NT4GUUAC43JI",
                    "high_descs":[
                        "Turn around and go forward and the turn to the left to face the counter to the left of the coffee maker.",
                        "Pick the lettuce up from the counter.",
                        "Turn left and cross the room to stand in front of the fridge.",
                        "Put the lettuce in the fridge and shut the door and then open the door and take the lettuce out and shut the door again.",
                        "Go left and then turn right to face the counter to the right of the stove.",
                        "Put the lettuce on the counter."
                    ],
                    "task_desc":"Put a chilled head of lettuce on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Lettuce"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-Fridge-22/trial_T20190908_072741_675911/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3TMFV4NEPBV09IY0CGCNJ1CBYM08WS",
                    "high_descs":[
                        "Turn around and go to the kitchen counter, to the right of the sink. ",
                        "Pick up the gold wine glass on the counter top. ",
                        "Turn to your left and go to the microwave at the end of the counter, on your right. ",
                        "Place the wine glass in the microwave, heat it up, and remove the wine glass from the microwave. ",
                        "Turn to your right and go to the refrigerator, across the room. ",
                        "Place the wine glass in the refrigerator, on the top shelf, to the right of the head of lettuce. "
                    ],
                    "task_desc":"Put a warm wine glass in the refrigerator. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3TMSXRD2X9HIYIEFDV384RP3KF4W14",
                    "high_descs":[
                        "move around to the table",
                        "pick up the mug",
                        "head left to the oven ",
                        "heat the mug and take it out",
                        "turn around and head to the fridge",
                        "place the mug in the fridge"
                    ],
                    "task_desc":"place a hot mug in the fridge",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2S96ZZ70YFPSK_3TXD01ZLD7YMYDMT5D79K1B9BHM4U5",
                    "high_descs":[
                        "Turn to the left and go forward to the counter. Turn to the left.",
                        "Go forward to the counter and pick up the wine glass.",
                        "Turn to the left and go forward until you reach the wall. Turn right.",
                        "Open the microwave and place the wine glass inside. Close the microwave. Open the microwave and remove the wine glass.",
                        "Turn right and go forward. Turn right and go forward to the counter. Turn left and go forward to the refrigerator. ",
                        "Open the refrigerator and put the wine glass inside. Close the refrigerator."
                    ],
                    "task_desc":"Move wine glass on counter to the microwave. Move the wine glass from microwave to refrigerator.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-Fridge-22/trial_T20190908_072702_772430/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3F6HPJW4JGHPN3WBWZ3M9AZ8CMI2WT",
                    "high_descs":[
                        "Turn around and walk up to the kitchen sink. ",
                        "Pick up the glass that is to the left of the other glass in the sink. ",
                        "Turn to the left, walk a few steps, then turn right to face the microwave.",
                        "Heat the cup in the microwave before taking it back out. ",
                        "Turn around, walk a few steps, then turn left and head towards the fridge. ",
                        "Place the cup in the fridge, to the right of the egg, and close the door."
                    ],
                    "task_desc":"Place a heated cup inside the refrigerator.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3M81GAB8A30ERJ0L3JXRIEKQIPTQBQ",
                    "high_descs":[
                        "Turn and go to the sink",
                        "Pick up the cup near the center of the sink.",
                        "Turn and take the cup to the microwave.",
                        "Heat the cup in the microwave.",
                        "Take the hot cup to the fridge.",
                        "Put the hot cup in the fridge."
                    ],
                    "task_desc":"Put a hot cup in the fridge.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3RRCEFRB7PT72EDN5MQEFBJLMYOB48",
                    "high_descs":[
                        "turn around and head to the sink",
                        "pick up the cup",
                        "turn left and head to the oven",
                        "heat the cup in the oven",
                        "turn around and head to the fridge",
                        "place the cup in the fridge"
                    ],
                    "task_desc":"place a hot cup in the fridge",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "train/pick_and_place_simple-Cup-None-SinkBasin-22/trial_T20190919_022014_388551/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36DK84J5YJ942_30OG32W0SXSRVPZDXI70FSV6GKOENE",
                    "high_descs":[
                        "Move to the counter to the left of the fridge to the right of the stove.",
                        "Pick up a cup from the counter in front of the toaster.",
                        "Move to the sink in the middle of the counter to your left.",
                        "Place the cup in to the sink."
                    ],
                    "task_desc":"Put a golden cup in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3QRYMNZ7F1YTK8HANDWVEEV7JXETNS",
                    "high_descs":[
                        "Turn and go to the counter directly behind you, to the left of the fridge.",
                        "Pick up the wooden goblet from the counter.",
                        "Turn and go to the sink on your left.",
                        "Stand the goblet in the right front corner of the sink."
                    ],
                    "task_desc":"Put a wooden goblet in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3U088ZLJVNAIRTTXHCZ8QM6TFWQ0WF",
                    "high_descs":[
                        "Turn around and walk to the counter to the left of the fridge.",
                        "Pick up the cup from the counter.",
                        "Turn around and walk to the sink.",
                        "Put the cup in the sink."
                    ],
                    "task_desc":"Put a cup in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cup"
            ]
        },
        "train/pick_cool_then_place_in_recep-BreadSliced-None-CounterTop-22/trial_T20190908_181923_346559/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_3JNQLM5FT7DHXY6AOTL11L2U8RXL2N",
                    "high_descs":[
                        "Turn right then face the sink on your left.",
                        "Take the knife from the sink in front of you.",
                        "Turn left then face the counter to your right.",
                        "Slice the bread on the counter in front of you.",
                        "Turn around and face the sink to your left.",
                        "Place the knife in the fridge and close it.",
                        "Turn around and face the counter with the bread on your right.",
                        "Take a slice of bread from the counter in front of you.",
                        "Turn around then face the fridge to your left.",
                        "Place the bread in the fridge for a bit then take it out.",
                        "Turn around and face the counter to your right.",
                        "Place bread on the counter in front of you."
                    ],
                    "task_desc":"Place cold bread on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3LRLIPTPET0VIVJWG82FS38DVGDAKB",
                    "high_descs":[
                        "Turn right and head to the sink",
                        "Pick up the knife in the sink",
                        "Turn left make step to the left side of the sink counter",
                        "Slice the bread on the counter",
                        "Turn right then head to the fridge",
                        "Open the fridge put in the knife",
                        "Turn left and head to the left side of the sink counter",
                        "Pick up a slice of bread",
                        "Turn right head to the fridge",
                        "Open the fridge put in and out the bread then close the fridge",
                        "Turn left and head to the left side sink counter",
                        "Put the slice bread on the edge of the counter"
                    ],
                    "task_desc":"Put the chilled slice bread on the counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PGUPNMOU5BPW_3VELCLL3GNAO8LEIJEIP1PN5JQA1FW",
                    "high_descs":[
                        "turn right. Go forward a few steps. Turn left. Go to the sink.",
                        "Pick up the knife. Turn left.",
                        "Go straight towards the potato on the right.",
                        "Cut the potato into slices.",
                        "Turn around and go straight a few paces. Turn left and go to the fridge.",
                        "Put the knife inside of the fridge. Close the fridge.",
                        "Go back to the counter where the potato was cut. ",
                        "Pick up a slice of potato.",
                        "Put the slice in the fridge where the knife was put.",
                        "Let the slice cool for a few seconds.",
                        "Take the slice back out of the fridge.",
                        "Put the slice back where the potato was cut."
                    ],
                    "task_desc":"Cut a potato and cool it down.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Potato",
                "Bread",
                "Plate",
                "Knife"
            ]
        },
        "train/pick_cool_then_place_in_recep-BreadSliced-None-CounterTop-22/trial_T20190908_181809_832715/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_34BBWHLWHD21JDWBHADVXCQRVVWIWO",
                    "high_descs":[
                        "Turn right and head to the counter beside the right side of the sink",
                        "Pick up the knife on the counter ",
                        "Turn left head to the left side of the sink counter",
                        "Slice the bread on the counter",
                        "Turn right face the sink on your left",
                        "Put the knife in the sink ",
                        "Turn left face the bread on the counter",
                        "Pick up a slice of bread",
                        "Turn right head to the fridge",
                        "Open the fridge then put in and out the slice bread",
                        "Turn left then face the counter beside the fridge",
                        "Put the slice bread on the counter"
                    ],
                    "task_desc":"Put the chilled slice bread on the counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_3RANCT1ZVI8E41T0G06DT11HFPYBU6",
                    "high_descs":[
                        "Turn right, move to the counter, right of the sink.",
                        "Pick up the knife from the counter.",
                        "Turn left, move to the counter right of the microwave.",
                        "Slice the bread on the counter.",
                        "Turn right, move to the counter in front of the sink.",
                        "Put the knife in the sink.",
                        "Turn left, move to the counter right of the microwave.",
                        "Pick up a slice of bread.",
                        "Turn right, move to in front of the refrigerator.",
                        "Put the slice of bread in the refrigerator, chill it, pick it back up.",
                        "Turn left, move to the counter left of the toaster.",
                        "Put the bread on the counter."
                    ],
                    "task_desc":"Place a slice of chilled bread on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3RKNTXVS3PPA4TUTVGFZLMJHYU6A44",
                    "high_descs":[
                        "Turn around and go to the counter on the right side of the sink. ",
                        "Pick up the gray knife behind the gray square bowl on the counter. ",
                        "Turn left and go to the counter with the round bread.",
                        "Slice a half of the bread on the counter.",
                        "Turn right and go to the sink on the left. ",
                        "Place the gray knife in the sink in front of the spatula. ",
                        "Turn left and go back to the counter with the bread on the right. ",
                        "Pick up one slice of bread",
                        "Turn right and go to the refrigerator across the kitchen.",
                        "Chill the bread slice in the refrigerator and remove it. ",
                        "Move over to the counter with a toaster on the left of the refrigerator. ",
                        "Place the bread slice on the counter on the left of the brown glass. "
                    ],
                    "task_desc":"Put a chilled slice of bread on the counter. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bread",
                "Plate"
            ]
        },
        "train/pick_cool_then_place_in_recep-BreadSliced-None-CounterTop-22/trial_T20190908_181520_195315/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A30M9SZYJKFDS9_3GD6L00D3VOUEV6Z51M2WF7EGSK1M3",
                    "high_descs":[
                        "go left turn to the left towards the counter ",
                        "pick up the knife that is on top of the counter",
                        "turn to the left towards the other side of the counter",
                        "slice a loaf of bread",
                        "turn around to the right go forward turn to the left towards the refrigerator",
                        "put the knife inside the refrigerator ",
                        "turn to the left go right towards the counter",
                        "pick up a slice of bread from the counter",
                        "turn around to the left go left towards the refrigerator ",
                        "put the slice of bread in the refrigerator get it back out ",
                        "turn to the left go right towards the counter",
                        "put the slice of bread on top of the counter"
                    ],
                    "task_desc":"put a slice of bread on top of the counter ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A12HZGOZQD5YK7_3MTMREQS4Y9MDVDD5MLIGE28IOKAW7",
                    "high_descs":[
                        "Turn left, go across the room, turn left and to the counter.",
                        "Pick up the knife from the counter.",
                        "Turn left, pass the sink and turn right to face the counter.",
                        "Cut the bread on the counter.",
                        "Turn around, go across the room, turn left and head to the fridge.",
                        "Put the knife on the top shelf of the fridge.",
                        "Turn around, go across the room, turn right and go to the counter.",
                        "Pick up a slice of bread.",
                        "Turn around and head back to the fridge.",
                        "Put the slice of bread in the fridge, close the fridge, open the fridge and pick it back up.",
                        "Turn around, go across the room, turn right and head to the counter.",
                        "Put the slice of bread on the edge of the counter."
                    ],
                    "task_desc":"Put a cold slice of bread on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_3SLE99ER0Q4VQ0NAMN5LATGWH8RZBZ",
                    "high_descs":[
                        "Turn left, move to the counter right of the sink.",
                        "Pick up the knife from the counter.",
                        "Turn left, move to the counter right of the microwave.",
                        "Slice the bread on the counter.",
                        "Turn right, move to in front of the refrigerator.",
                        "Put the knife in the refrigerator.",
                        "Turn left, move to the counter right of the microwave.",
                        "Pick up a slice of bread from the counter.",
                        "Turn right, move to in front of the refrigerator.",
                        "Put the slice of bread in the refrigerator, chill it, pick it up. ",
                        "Turn left, move to the counter right of the microwave.",
                        "Put the slice of bread on the counter."
                    ],
                    "task_desc":"Place a cooked slice of bread on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bread"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-SinkBasin-22/trial_T20190909_053141_550568/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_392CY0QWG4IPABDR747C2K70B1XI40",
                    "high_descs":[
                        "Turn to the left to face the sink.",
                        "Pick the wine glass up from the sink.",
                        "Go left and turn to the right to face the microwave.",
                        "Put the wine glass in the microwave and shut the door and then open the door and pick up the wine glass.",
                        "Go right and then turn to the left to face the sink.",
                        "Put the wine glass in the sink."
                    ],
                    "task_desc":"Put a heated wine glass in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3S4AW7T80E9R0CLXS74PU0ZSS5UL4K",
                    "high_descs":[
                        "walk to face sink",
                        "pick up golden goblet from sink",
                        "walk to face microwave",
                        "heat goblet inside microwave, pick up goblet from microwave",
                        "walk to face sink",
                        "place goblet inside sink basin"
                    ],
                    "task_desc":"put heated goblet into sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3WQ3B2KGEB7YV422ECWTIZWK4SAB1G",
                    "high_descs":[
                        "Take a step forward then turn left.",
                        "Pick up the orange wine glass that's in front of you in the sink.",
                        "Turn left and walk to the microwave then turn right to face it when you get there.",
                        "Warm the wine glass in the microwave then take it back out and close the door.",
                        "Turn right and walk back to the sink then turn left to face it.",
                        "Put the glass back in the sink."
                    ],
                    "task_desc":"Put a warm wine glass in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ButterKnife",
                "Kettle",
                "Pot",
                "Plate",
                "Spoon"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-SinkBasin-22/trial_T20190909_011654_147289/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ALKQPW0O9C98N_34YB12FSQ1FRIAW2NK7532BKIFNGMY",
                    "high_descs":[
                        "Turn left and head towards the sink",
                        "Pick up the wine glass from the sink",
                        "Turn left and go to the microwave on the right",
                        "Open the microwave door, put the glass in, close the door and turn on the microwave. Open the microwave door and take the glass out of the microwave.",
                        "Turn right and go to the sink on the left",
                        "Place the glass in the sink below the sponge"
                    ],
                    "task_desc":"Put a heated wine glass in the sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_36W0OB37HZ55HDQWMFFHW4JUCJIZHX",
                    "high_descs":[
                        "Move to the gray door in the corner of the room then turn left and move to the sink.",
                        "Pick up the amber wine glass to the right of the drain from the sink.",
                        "Turn to the left and move past the dishwasher then turn right and face the red microwave.",
                        "Open the microwave, place the wine glass on the plate, microwave the glass to warm it, then open the microwave, pick up the wine glass from the microwave, and then close the microwave door.",
                        "Turn right and move towards the range, then turn left and face the sink.",
                        "Place the wine glass in front of the drain in the sink."
                    ],
                    "task_desc":"Place a warmed wine glass in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3EO896NRAZM5M7CN4NTKMTYS4FZTJF",
                    "high_descs":[
                        "Go forward and turn left to stand in front of the sink.",
                        "Pick the wine glass up from the sink.",
                        "Go left and turn to stand in front of the  microwave.",
                        "Put the wine glass in the microwave and shut the door and then open the door and pick up the wine glass.",
                        "Go to the right and turn to stand in front of the sink.",
                        "Put the wine glass in the sink."
                    ],
                    "task_desc":"Put a warmed glass in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Kettle",
                "Cup"
            ]
        },
        "train/pick_heat_then_place_in_recep-Cup-None-SinkBasin-22/trial_T20190909_011624_849664/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3R5F3LQFV5BF9UCJQSA7GDGVO5EOZS",
                    "high_descs":[
                        "Move forward a few steps, then towards the left, then forward again to where the dishwasher is. ",
                        "Pick up the cup that is sitting on the countertop above the dishwasher. ",
                        "Move over to the left a bit, to the microwave that is on the counter. ",
                        "Heat up the cup in the microwave before taking it back out and closing the door. ",
                        "Turn to the right, walk forward a few steps, then turn to the left to face the kitchen sink. ",
                        "Place the cup down in the kitchen sink."
                    ],
                    "task_desc":"Place a heated cup in the kitchen sink. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3U5JL4WY5N0M062M6Q7D5UUFZELX4Z",
                    "high_descs":[
                        "Head across the room to the dishwasher",
                        "Pick up the golden chalice that is sitting on the counter above the dishwasher",
                        "Take a step to the left to stand in front of the microwave",
                        "Open the microwave and place the chalice inside to the right of the tomato, then close the door and turn it on. Open the microwave and pick up the chalice the close the door",
                        "Turn to the right and go to the sink that is on your left",
                        "Place the chalice into the sink in front of the spatula"
                    ],
                    "task_desc":"Place a heated chalice into a sink",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3U84XHCDIF4B512178VY2FAQ7EK4Z4",
                    "high_descs":[
                        "Move to the counter ahead of you, left of the sink.",
                        "Pick up the cup on the counter. ",
                        "Bring the cup to the microwave on the left.",
                        "Heat the cup in the microwave. ",
                        "Bring the heated cup to the sink, right of the microwave.",
                        "Put the heated cup in the sink. "
                    ],
                    "task_desc":"Put a heated cup in the sink. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Kettle",
                "Sink",
                "Cup"
            ]
        },
        "tests_seen/trial_T20190907_070943_599319/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left, go straight, then turn right at the microwave.",
                        "Take the mug from the cabinet to the left, above the microwave.",
                        "Go to the sink to your right.",
                        "Wash the mug in the sink.",
                        "Turn around, move forward, turn right to go to the coffee maker.",
                        "Place the mug at the coffee maker."
                    ],
                    "task_desc":"Put a clean mug at the coffee maker."
                },
                {
                    "high_descs":[
                        "Walk to your left to the end of the room and turn to the right to the cabinet on top of the microwave. ",
                        "Open the cabinet on top of the microwave, pick up a dirty white cup and close the door. ",
                        "Walk to the right and turn to the right to go to the sink. ",
                        "Put the cup in the sink, turn on the water for a few seconds, turn it off and pick up the clean cup. ",
                        "Go to the left and turn to the left to the coffee maker on the counter top and near the wall.  ",
                        "Put the clean cup on the coffee maker. "
                    ],
                    "task_desc":"Put a clean cup on the coffee maker which is near the wall. "
                },
                {
                    "high_descs":[
                        "Turn right and head to the microwave.",
                        "Open the cabinet above the microwave and pick up the dirty mug in there. ",
                        "Turn left and bring the dirty mug to the sink",
                        "Clean the mug in in the sink. ",
                        "Bring the cleaned mug to the coffee machine on the left. ",
                        "Put the mug on the coffee machine."
                    ],
                    "task_desc":"Put a cleaned mug on the coffee machine. "
                },
                {
                    "high_descs":[
                        "Turn to the left, and then the right to face the microwave.",
                        "Open the top cabinet and take out a mug.",
                        "Take the mug and take a few steps to the right towards the sink.",
                        "Place the mug in the sink and turn on the water. Turn off the water and pick up the mug again.",
                        "Carry the mug and turn around and go to the right to the coffee machine.",
                        "Place the mug under the coffee machine."
                    ],
                    "task_desc":"Rinse a mug and place it on the coffee machine."
                },
                {
                    "high_descs":[
                        "Turn left, move to counter in front of microwave.",
                        "Open cabinet on upper left, pick up dirty cup.",
                        "Turn to the right, move to the counter in front of the sink.",
                        "Place dirty cup into the sink, rinse cup, pick cup up.",
                        "Turn to the left, move to the counter in front of the coffee maker.",
                        "Put the cup into the coffee maker."
                    ],
                    "task_desc":"Place a clean cup into the coffee maker."
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "tests_seen/trial_T20190907_173320_166553/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and go to the sink.",
                        "Take the wineglass on the right out of the sink.",
                        "Turn left and go to the microwave.",
                        "Open the microwave, heat the glass and take it out.",
                        "Look up to the cupboards above the microwave.",
                        "Open the cupboard and put the wineglass in the cupboard."
                    ],
                    "task_desc":"Heat the wineglass a little and put it away in the cupboard."
                },
                {
                    "high_descs":[
                        "Turn right, walk to the sink. ",
                        "Grab the wine glass in the back of the sink. ",
                        "Turn left, walk to the end of the counter, face the microwave.",
                        "Put the wine glass in the microwave for a few seconds, take the wine glass out of the microwave. ",
                        "Look up at the cupboard above the microwave. ",
                        "Put the wine glass in the cupboard with the coffee mug. "
                    ],
                    "task_desc":"Put the heated wine glass in the cupboard. "
                },
                {
                    "high_descs":[
                        "Turn right and walk up to the kitchen sink",
                        "Pick up the left most wine glass from the sink",
                        "Turn left and walk over to the microwave",
                        "Warm the glass in the microwave then remove it",
                        "Look up to the cupboard above the microwave",
                        "Put the wine glass into the left cupboard above the microwave"
                    ],
                    "task_desc":"Put the heated wine glass in the kitchen cupboard"
                }
            ],
            "relative_objects":[
                "Cup"
            ]
        },
        "tests_seen/trial_T20190912_105122_111365/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk forward, then hang a left and walk up to the sink.",
                        "Pick up the sponge out of the sink.",
                        "Turn right and walk forward, then turn left to face the sink.",
                        "Put the sponge on the black plate that is in the sink.",
                        "Pick up the black plate with the sponge on it out of the sink.",
                        "Turn around and walk towards the door, then turn left and look up at the upper cabinets above the fridge.",
                        "Open the rightmost cabinet door and put the plate with the sponge on it in the cabinet and close the door."
                    ],
                    "task_desc":"Put a plate with a sponge on it in a cabinet."
                },
                {
                    "high_descs":[
                        "Turn left and walk across the room. ",
                        "Take the green sponge from the left side of the sink. ",
                        "Turn to the right and take one step, then turn left to face the sink. ",
                        "Put the sponge on the black tray in the sink. ",
                        "Pick up the black tray with the sponge on it. ",
                        "Turn around and take three steps, then turn left and look up. ",
                        "Open the cabinet and put the tray with the sponge on it inside the cabinet."
                    ],
                    "task_desc":"To put away the tray and sponge. "
                },
                {
                    "high_descs":[
                        "turn left and head to the sink",
                        "pick up the sponge ",
                        "turn right to the sink ",
                        "place the sponge in the pan in the sink",
                        "pick up the pan",
                        "turn right and move to the overhead shelf",
                        "place the pan in the shelf"
                    ],
                    "task_desc":"place a pan with a sponge in it on the shelf"
                }
            ],
            "relative_objects":[
                "Pan",
                "DishSponge",
                "Plate"
            ]
        },
        "tests_seen/trial_T20190907_081023_514472/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "walk to the counter between the refrigerator and the stove",
                        "grab the golden cup in the back on the counter",
                        "turn around, walk to the sink",
                        "put the golden cup in the sink"
                    ],
                    "task_desc":"move the golden cup from the counter to the sink"
                },
                {
                    "high_descs":[
                        "Move forward to the toaster on the counter.",
                        "Pick up the orange cup on the counter. ",
                        "Turn around and bring the cup to the sink on the right. ",
                        "Put the cup in the sink."
                    ],
                    "task_desc":"Put an orange cup in the sink. "
                },
                {
                    "high_descs":[
                        "Turn to the right, then walk toward the counter on your left. ",
                        "Pick up the golden cup from behind the spatula.\n",
                        "Turn around then walk to the sink on your right.",
                        "Place the golden cup in the sink."
                    ],
                    "task_desc":"Place the golden cup in the sink"
                },
                {
                    "high_descs":[
                        "walk forwards towards the stove, stop to face the counter to the right of the stove",
                        "pick up the wine glass that is on the counter",
                        "turn around, walk forward, turn to face the sink on the right",
                        "put the wine glass in the sink"
                    ],
                    "task_desc":"move a wine glass from the counter to the sink"
                }
            ],
            "relative_objects":[
                "Mug",
                "Cup"
            ]
        },
        "tests_seen/trial_T20190906_181609_688127/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move to the counter above the dishwasher.",
                        "Pick up the butter knife on the counter.",
                        "Move over to the right to the sink.",
                        "Set the butter knife in the cup in the sink.",
                        "Pick up the cup with the butter knife in it.",
                        "Go to the counter to the right of the microwave.",
                        "Set the cup with the butter knife down on the counter."
                    ],
                    "task_desc":"Set a cup with a butter knife inside next to the microwave. "
                },
                {
                    "high_descs":[
                        "Approach the counter in front of you.",
                        "Pick up the the knife on the counter.",
                        "Turn to your right and walk to the the sink.",
                        "Place the knife in the cup in the sink.",
                        "Pick up the the cup in the sink.",
                        "Turn to your left and approach the counter on the left of the sink.",
                        "Place the cup on the counter to the left of the sink."
                    ],
                    "task_desc":"Place a cup with a knife in it on the counter to the left of the sink."
                },
                {
                    "high_descs":[
                        "Turn left and take a step forward, then turn right and walk up to the counter.",
                        "Pick up the butter knife off of the counter.",
                        "Turn right and walk towards the oven, then turn right to face the sink.",
                        "Put the butter knife handle down into the brown cup that is in the sink basin.",
                        "Pick up the brown cup with the butter knife in it.",
                        "Turn left and walk towards the wall, then turn right to face the counter.",
                        "Put the brown cup with the butter knife in it on the counter."
                    ],
                    "task_desc":"Put a brown cup with a butter knife in it on the counter."
                },
                {
                    "high_descs":[
                        "Walked over to the dishwasher. ",
                        "Picked up a knife from the counter",
                        "Took knife to kitchen sink.",
                        "Placed knife in cup in the kitchen sink.",
                        "Removed cup from kitchen sink",
                        "Walked over to dishwasher",
                        "Placed cup on the counter. "
                    ],
                    "task_desc":"Find a cup and put a knife in it. "
                },
                {
                    "high_descs":[
                        "Take a step left.",
                        "Pick the knife up off the counter.",
                        "Take a couple steps right to the sink.",
                        "Put the knife in the brown glass.",
                        "Pick up the glass with the knife in it.",
                        "Take a step left to your original position.",
                        "Place the stack of items on the counter in front of the bread."
                    ],
                    "task_desc":"Place a knife in a glass on a table."
                },
                {
                    "high_descs":[
                        "Look around then stand in front of the knife on the counter.",
                        "Pick up the knife from the counter.",
                        "Walk over to the sink.",
                        "Put the knife inside the glass in the sink.",
                        "Pick up the glass from the sink.",
                        "Walk over to the counter near the loaf of bread.",
                        "Place the glass on the counter."
                    ],
                    "task_desc":"Put a glass with a knife inside it on the counter."
                }
            ],
            "relative_objects":[
                "Knife",
                "Cup"
            ]
        },
        "tests_seen/trial_T20190909_041655_003868/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and go to the counter top to the right of the sink. ",
                        "Pick up the butter knife from the counter top. ",
                        "Turn to your left and go to the counter top just past the sink, on your right. ",
                        "Cut the potato, in front of the bread, on the counter top into slices. ",
                        "Turn around and walk across the kitchen, to the counter top, then turn left and go to the refrigerator in front of you. ",
                        "Place the knife on the right of the top shelf, in front of the egg, in the refrigerator. ",
                        "Turn to your left and go back to the counter top, then turn right and go back to the counter where the potato is. ",
                        "Pick up one of the potato slices. ",
                        "Turn around and go back to the counter, make a left and g back to the refrigerator. ",
                        "Place the potato slice on the top shelf, to the left of the knife, in the refrigerator, wait a moment for it to chill, then remove the potato slice from the refrigerator. ",
                        "Go to the garbage can on the floor of the right side of the refrigerator. ",
                        "Place the potato slice in the garbage bin. "
                    ],
                    "task_desc":"Place a knife in the refrigerator, and a potato slice in the garbage. "
                },
                {
                    "high_descs":[
                        "Turn left, go forward, turn left go to the counter",
                        "Pick up the knife on the counter",
                        "Turn left, go forward, turn right at the counter",
                        "Slice the potato on the counter",
                        "Turn around, go forward, turn left and go to the fridge",
                        "Put the knife in the fridge",
                        "Turn around, go forward, turn right and go to the counter",
                        "Pick up a potato slice from the counter",
                        "Turn around, go forward, turn left and go to the fridge",
                        "Put the potato slice in the fridge, wait, pick up the potato slice from the fridge",
                        "Move a bit to the right",
                        "Put the potato slice in the basket"
                    ],
                    "task_desc":"Slice a potato, cool a slice, put it in the bin"
                },
                {
                    "high_descs":[
                        "Turn left and walk forward to the counter.",
                        "Turn left again and walk forward to the other counter.",
                        "Pick up the butter knife from the counter top.",
                        "Turn left, move forward, and then turn right and move to the dishwasher.",
                        "Slice the small potato above the dishwasher with the butter knife.",
                        "Turn around, move forward, and then turn and move towards the refrigerator on the left.",
                        "Open the refrigerator, put the knife on the top shelf inside the refrigerator, and close the refrigerator.",
                        "Turn around, move forward, then turn right and move to the dishwasher.",
                        "Pick up one slice of potato from the counter top above the dishwasher, turn around, move forward, and then turn and move towards the refrigerator on the left.",
                        "Place the potato slice in the refrigerator next to the butter knife on the top shelf, close the door, wait until it is chilled, then take the potato slice out of the refrigerator and close the refrigerator.",
                        "Move to the garbage can on the right side of the refrigerator.",
                        "Put the slice of potato into the garbage can."
                    ],
                    "task_desc":"Slice the small potato above the dishwasher, chill it in the refrigerator, and throw the potato slice into the garbage can by the refrigerator."
                }
            ],
            "relative_objects":[
                "Potato",
                "Knife"
            ]
        },
        "tests_seen/trial_T20190909_043449_781045/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left to face the counter.",
                        "Pick up the knife on the counter.",
                        "Turn around and walk forward and turn left to face the fridge.",
                        "Cut the lettuce in the fridge into slices.",
                        "Look up to face the fridge.",
                        "Place the knife in the fridge.",
                        "Look up to face the fridge.",
                        "Pick up the slice of lettuce in the fridge.",
                        "Turn left and walk forward to face the sink.",
                        "Wash the lettuce slice in the sink and remove it.",
                        "Turn around and walk to face the fridge.",
                        "Place the slice of lettuce in the fridge."
                    ],
                    "task_desc":"To wash a slice of lettuce and place it in the fridge."
                },
                {
                    "high_descs":[
                        "Turn left and face the counter in front of you.",
                        "Take the knife off of the counter in front of you.",
                        "Turn around and face the fridge to your left.",
                        "Slice the lettuce in the fridge in front of you.",
                        "Close the fridge in front of you.",
                        "Open the fridge in front of you, place the knife inside and close it.",
                        "Face the fridge in front of you.",
                        "Take a lettuce slice out of the fridge in front of you.",
                        "Turn left and face the sink in front of you.",
                        "Wash the lettuce in the sink in front of you and take it out.",
                        "Turn around and face the fridge to your left.",
                        "Place the lettuce slice in the fridge and close it."
                    ],
                    "task_desc":"Place a clean lettuce slice in the fridge."
                },
                {
                    "high_descs":[
                        "Turn left, go to the counter",
                        "Pick up the knife on the counter",
                        "Turn around, go to the fridge",
                        "Slice the lettuce in the fridge",
                        "Turn down to the fridge",
                        "Put the knife in the fridge",
                        "Turn up to the fridge",
                        "Pick up a slice of lettuce from the fridge",
                        "Turn around, go forward, turn right, go to the sink",
                        "Put the lettuce slice in the sink, wash the lettuce slice with water, pick up the lettuce slice from the sink",
                        "Turn around go forward turn left to the fridge",
                        "Put the lettuce slice in the fridge"
                    ],
                    "task_desc":"Wash a slice of lettuce"
                }
            ],
            "relative_objects":[
                "Lettuce",
                "DishSponge"
            ]
        }
    }
}