{
    "scene_name":"FloorPlan323",
    "trials":{
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Dresser-323/trial_T20190908_022708_274581/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_324G5B4FB6P31ESW94RWY67CMO3708",
                    "high_descs":[
                        "Turn around and walk to the desk across the room. ",
                        "Pick up the pencil on the desk, closest to the edge. ",
                        "Move closer to the desk. ",
                        "Place the pencil in the black coffee cup, behind the other pencil, on the desk.",
                        "Pick up the coffee cup with the pencil inside it. ",
                        "Turn around and walk across the room to the dresser in the right corner of the room. ",
                        "Place the coffee cup, with the pencil inside it, on the right side of the dresser, close to the edge. "
                    ],
                    "task_desc":"Put a cup containing a pencil on the dresser. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3NJM2BJS4ZNC1CRCH6EXTT0YV7KCPR",
                    "high_descs":[
                        "Turn around to your right walk forward then head to the desk",
                        "Pick up the pencil in front of the bowl ",
                        "Look for the mug on the desk",
                        "Put the pencil in the mug",
                        "Pick up the mug with pencil",
                        "Turn to your right then walk forward turn right head to the drawer",
                        "Put the mug with pencil on top of the right side of the drawer"
                    ],
                    "task_desc":"Put the mug with pencil on the drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3UJ1CZ6IZK6OFJYPUDVJASZZQAQ5SD",
                    "high_descs":[
                        "Turn around, walk past the sofa on your left, turn left to the wall, and then turn right to the desk.",
                        "Pick up the pencil closest to you.",
                        "Look for the black cup on the desk.",
                        "Place the pencil in the black cup.",
                        "Pick up the cup with the pencil from the desk.",
                        "Turn around, walk to the wall, and turn right towards the tall dresser.",
                        "Place the cup to the right of a credit card on the dresser."
                    ],
                    "task_desc":"Place a black cup with a pencil on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Dresser-323/trial_T20190908_022633_257511/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A18X8ZAS0QDLKJ_3I0BTBYZA02MGYOXWDHWBJR9QNWY0K",
                    "high_descs":[
                        "Turn all the way around, then walk towards the sofa, turn right, then head for the desk against the wall.",
                        "Pick up the pencil located behind the black cup on the desk.",
                        "Take a step right towards the alarm clock on the desk.",
                        "Place the pencil inside the black cup located near the alarm clock.",
                        "Pick up the black cup with the pencil inside. ",
                        "Turn all the way around and walk towards the couch, turn right, then walk towards the brown dresser.",
                        "Place the cup on the dresser."
                    ],
                    "task_desc":"Place a cup with a pencil inside, on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3LRLIPTPETQNX6XYK0DYRHOB1U0KA3",
                    "high_descs":[
                        "move to the desk to the right of the couch",
                        "pick up a pencil from the desk",
                        "move to the right side of the desk",
                        "put the pencil in a cup",
                        "pick up the cup from the desk",
                        "move to the dresser behind you",
                        "put the cup on the dresser"
                    ],
                    "task_desc":"Put a cup with a pencil on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3QAVNHZ3EPLYHCFG50PZ6H1QQUYLA0",
                    "high_descs":[
                        "Turn around and walk over to the couch, then turn right and walk up to the wooden desk.",
                        "Pick up the pencil off of the wooden desk.",
                        "Turn right and walk towards the bed, then turn left and walk up to the wooden desk.",
                        "Put the pencil in the rightmost black mug on the wooden desk.",
                        "Pick up the black mug with the pencil in it.",
                        "Turn right and begin walking across the room, then hang a right and walk over to the wall, turn right again and walk up to the wooden dresser.",
                        "Put the mug with the pencil in it on top of the wooden dresser."
                    ],
                    "task_desc":"Put a mug with a pencil in it on top of a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Dresser"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Dresser-323/trial_T20190908_022729_383819/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3GA6AFUKOR5WBVX550VRRHUD3293HP",
                    "high_descs":[
                        "Turn to the right and locate the chair.",
                        "Pick up the pencil from the back of the desk.",
                        "Carry the pencil and move a few steps to the right and turn left to still face the desk.",
                        "Place the pencil in a cup on the close side of the desk.",
                        "Pick up the cup from the desk.",
                        "Carry the cup and turn left. Go back and then turn right to find the tall dresser.",
                        "Place the cup and pencil on the top right of the dresser."
                    ],
                    "task_desc":"Move a cup and pencil to a dresser.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3ON104KXQNDZQHBY0DMA2PW6WQ0W4L",
                    "high_descs":[
                        "move to the desk at the foot of the bed",
                        "pick up a pencil from the desk",
                        "move to the right of the desk",
                        "put the pencil in the mug on the desk",
                        "pick up the mug from the desk",
                        "move to the dresser behind you",
                        "put the mug on the dresser"
                    ],
                    "task_desc":"Put a mug with a pencil on the dresser.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3OF2M9AATJ5OYE56WSTX8AFKAEFKZA",
                    "high_descs":[
                        "Turn right and walk to the desk.",
                        "Pick up the pencil to the right of the lamp.",
                        "Turn right and walk to the other end of the desk.",
                        "Place the pencil in the black mug.",
                        "Pick up the mug.",
                        "Turn around and walk past the bed to the dresser at the other side.",
                        "Place them on on the dresser in front of the keys."
                    ],
                    "task_desc":"Place a mug on a dresser.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        },
        "train/look_at_obj_in_light-Pen-None-DeskLamp-323/trial_T20190908_125547_889154/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3VBEN272MNQUG5977H3RFBAQAZPSGW",
                    "high_descs":[
                        "turn right, take two steps, turn left, walk to wall, turn right, walk to the small table",
                        "pick up the pen that is on the table",
                        "turn around, walk past bed, turn left, walk past bed, turn left, walk to small table in front of you",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine a pen with a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3VFJCI1K42QIFQ9USS3MP15UOX0RG1",
                    "high_descs":[
                        "Turn right at the wooden desk and walk to the wooden nightstand to the left of the bed.",
                        "Pick up the red pen on the desk.",
                        "Circle around the bed to the nightstand on the right side of the bed.",
                        "Turn on the lamp on the nightstand."
                    ],
                    "task_desc":"Pick up the red pen and turn on the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3ZPPDN2SLYNERCHHSGDCYDKO5VME9R",
                    "high_descs":[
                        "turn right, head across the room to the night stand",
                        "take the red pen from the night stand",
                        "turn around, walk around the bed to the other night stand",
                        "turn on the lamp"
                    ],
                    "task_desc":"take the red pen from the night stand, turn on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "AlarmClock",
                "Pen"
            ]
        },
        "train/look_at_obj_in_light-Bowl-None-DeskLamp-323/trial_T20190908_024052_230550/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3I02618YA3N8N68C3XZXNZM426HUP7",
                    "high_descs":[
                        "Turn right and head across the room to the desk in the corner of the room",
                        "Pick up the square bowl that is sitting on the desk",
                        "Turn around and head forward, take a left at the couch and head forward to the night stand on the right side of the bed",
                        "Turn on the lamp that is sitting on the night stand"
                    ],
                    "task_desc":"Look at a bowl by the light of a lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3QAVNHZ3EPLYHCFG50PZ6H1QQTPALE",
                    "high_descs":[
                        "Turn right then head straight back to the left hand side of the desk",
                        "Pick up the grey bowl on top of the desk",
                        "Carry the grey bowl to the right side of the bed where the night stand is with the lamp on top of it",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry a bowl while turning on a lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3H7Z272LXAO54GLIUJ7WWCQLPFQLP6",
                    "high_descs":[
                        "Turn around and walk to the desk to your left.",
                        "Grab the bowl on the desk.",
                        "Carrying the bowl, turn around and walk to the small table next to the bed to your left.",
                        "Carrying the bowl still, turn on the lamp on the small table."
                    ],
                    "task_desc":"With a bowl in hand, turn on the lamp on the small table.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "Pencil",
                "AlarmClock",
                "TeddyBear",
                "Bowl",
                "Mug",
                "CD",
                "Pillow",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-Laptop-None-DeskLamp-323/trial_T20190908_014226_839563/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_35K3O9HUAEUF7XMWZUON7NMXED8FEI",
                    "high_descs":[
                        "turn to the right and go forward past clear the bed and turn to the left and go to the middle of the bed and turn to the left facing the bed",
                        "close the notebook computer and pick up the notebook computer from the bed",
                        "turn to the right twice and take a step and turn to the left and go to the lamp",
                        "turn on the lamp on the night stand"
                    ],
                    "task_desc":"Examine a notebook computer by the light of a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3907X2AHF3MZ3UZAKDPRHGRCJG8P2W",
                    "high_descs":[
                        "Move to the right side of the bed where the laptop is sitting on top of the bed",
                        "Pick up the laptop on top of the bed",
                        "Carry the laptop over to the night stand where the lamp is",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry a laptop while turning on a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3IHR8NYAMAI968EXOR8FAVOA3U54P8",
                    "high_descs":[
                        "Turn right, go past the bed on the left, and turn to face the bed.",
                        "Pick up the laptop on the bed.",
                        "Turn right and go to the nightstand by the head of the bed.",
                        "Turn on the light on the nightstand."
                    ],
                    "task_desc":"Examine the laptop by the light of the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "Book",
                "Laptop",
                "AlarmClock",
                "Mug",
                "Pencil",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-Laptop-None-DeskLamp-323/trial_T20190908_014241_887170/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_35USIKEBNUXNIA6YR0O2343TZ5ZN63",
                    "high_descs":[
                        "go to the side of the bed closest to you standing in front of the nightstand",
                        "pick up the computer from the bed",
                        "turn to the right to face the nightstand",
                        "turn on the lamp while holding the computer"
                    ],
                    "task_desc":"take the computer from the bed to turn on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3I3WADAZ9TL9HR6WNWEAQNPYTKT5OK",
                    "high_descs":[
                        "Turn left, proceed to nightstand.  Turn left to face bed.",
                        "Close laptop on the lower right hand corner of the bed, pick the laptop up.",
                        "Turn right to face the nightstand.",
                        "Turn on lamp on nightstand."
                    ],
                    "task_desc":"Pick up laptop, turn on lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3KOPY89HMBJS21SVT0YC3UASGUT3JA",
                    "high_descs":[
                        "Move to the right side of the bed closest to the night stand facing the laptop",
                        "Pick up the laptop on top of the bed",
                        "Carry the laptop to the right facing the lamp on the night stand",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry a laptop while turning on a lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "CellPhone",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-CD-None-Dresser-323/trial_T20190908_005542_694744/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ACSS93E03ZUGX_37XITHEISZQXDP7RUYIMYO0DWOARCY",
                    "high_descs":[
                        "Turn around and face the end of the brown desk.",
                        "Pick the the CD from the end of the desk.",
                        "Turn to the left and walk across the room, then turn right to face the dresser in the corner.",
                        "Place the CD on top of the dresser."
                    ],
                    "task_desc":"Move the CD from the desk to the top of the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3KOPY89HMBJS21SVT0YC3UASGU33JK",
                    "high_descs":[
                        "Turn around and walk to the desk.",
                        "Pick up the CD closest to the side of the desk you're facing.",
                        "Turn left and walk to the far wall, then turn right and face the dresser.",
                        "Put the CD on the dresser to the right of the safe."
                    ],
                    "task_desc":"Place a CD on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3Z7VU45IP1YMSDJKOINF3VJL183Z1A",
                    "high_descs":[
                        "Turn around, go to desk.",
                        "Pick up cd from bottom left hand corner of desk.",
                        "Turn left, go across room.  Turn right, go to dresser.",
                        "Place cd on top of dresser, to the right of the white object."
                    ],
                    "task_desc":"Move cd from desk to dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CD-None-Dresser-323/trial_T20190908_005459_168199/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ACSS93E03ZUGX_3IKZ72A5B7XJ13Z9STR6XAG6S3PFNJ",
                    "high_descs":[
                        "Turn around, go straight and go to the left to face the chair in in front of the desk.",
                        "Pick the CD up from off of the desk.",
                        "Turn around, go left to walk around the couch, then to the right to face the tall dresser in the corner.",
                        "Place the CD on top of the dresser."
                    ],
                    "task_desc":"Move the CD that's on top of the desk to on top of the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A27AK750Y9M9KH_3IO1LGZLKCE2F3JULYZJL7DYAA9869",
                    "high_descs":[
                        "Turn right and head towards the wooden desk with a chair. ",
                        "Grab the CD from the wooden desk. ",
                        "Turn around and head towards the tall wooden cabinet on the right. ",
                        "Place the CD on top of the tall wooden cabinet. "
                    ],
                    "task_desc":"Fetch a CD and place in on top of a cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3JZLYQ606HJJR_3SITXWYCNYQY0G1XPXSJCMGJFKYBXA",
                    "high_descs":[
                        "Turn around and cross the room to the brown desk with a chair in front of it. ",
                        "Pick up the CD that is behind the black coffee mug toward the front of the desk. ",
                        "Turn around and move to the brown dresser with 4 drawers in the far left corner of the room. ",
                        "Put the CD on top of the dresser next to the white safe. "
                    ],
                    "task_desc":"Move a CD from the desk to the top of the dresser. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Dresser",
                "CD",
                "Desk"
            ]
        },
        "train/pick_and_place_simple-CD-None-Dresser-323/trial_T20190908_005514_476729/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3L70J4KAZJ3FJ0ROSJRBN4TLHL0DAG",
                    "high_descs":[
                        "Turn left and face the bin.",
                        "Pick up the CD out of the bin.",
                        "Turn around and walk past the bed and veer right to the dresser.",
                        "Place the CD on the dresser to the right of the book."
                    ],
                    "task_desc":"Place a CD on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OB0CAO74K6XRYUTULOHHBQQC4TYHH",
                    "high_descs":[
                        "Turn left and look down at the silver bin.",
                        "Pick up the disc out of the silver bin.",
                        "Turn around begin walking across the room, then turn right and walk up the wooden dresser to the left of the couch.",
                        "Put the disc on top of the dresser in the front right corner."
                    ],
                    "task_desc":"Move a disc to a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3XC1O3LBOV33W8EPB0GG1MRIEJOTLY",
                    "high_descs":[
                        "Turn left to face garbage can on floor.",
                        "Pick up cd from garbage can.",
                        "Turn around, proceed to wall.  Turn right, proceed to dresser.",
                        "Place cd on top of dresser all the way to the right, to the right of the book."
                    ],
                    "task_desc":"Take cd out of garbage and put on dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Safe-323/trial_T20190907_001319_237371/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36DK84J5YJ942_3HVVDCPGTH9NW7LOUF56VUTEMTTTYG",
                    "high_descs":[
                        "Move to the desk to the right of the grey couch",
                        "Pick up credit card from the desk",
                        "Move to the safe to the left of the grey couch",
                        "Open safe door and place card inside and close the door",
                        "Move the the desk to the right of you and to the right of the grey couch",
                        "Pick up credit card from the desk",
                        "Move to the safe to the left of the grey couch",
                        "Open safe door and place card inside and close the door"
                    ],
                    "task_desc":"Put the credit cards from the desk in the corner into the safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Safe-323/trial_T20190907_001424_961488/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_308Q0PEVBBUIMSX5SREMI6YE2XP9IB",
                    "high_descs":[
                        "Move to the brown dresser with a safe on it. ",
                        "Pick up the credit card on the far right of the dresser. ",
                        "Move to the left in front of the safe. ",
                        "Put the credit card inside the safe. ",
                        "Move back to the right side of the dresser. ",
                        "Pick up the other blue credit card that is on the dresser.",
                        "Move back to the right in front of the safe.",
                        "Place the credit card inside.  Shut the door."
                    ],
                    "task_desc":"Secure credit cards in safe. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Desk-323/trial_T20190907_074743_568636/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3T9K2RY06UO14_3M81GAB8A30ERJ0L3JXRIEKQIZMBQO",
                    "high_descs":[
                        "Turn around and go to the waste basket by the desk. ",
                        "Take the pencil out of the waste basket. ",
                        "Turn right and go to the night stand by the bed. ",
                        "Put the pencil in the coffee cup on the night stand. ",
                        "Pick up the coffee cup on the night stand. ",
                        "Turn around and go to the desk. ",
                        "Put the coffee cup in front of the clock on the desk. "
                    ],
                    "task_desc":"Take the coffee cup from the night stand to the desk. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_317HQ483IA93BU1ZT1XR07TY8GVINX",
                    "high_descs":[
                        "Head straight towards the grey bin to the right of the desk in front of you.",
                        "Pick the pencil out of the bin.",
                        "Turn right and head towards the night stand.",
                        "Place the pencil in the left cup on the night stand.",
                        "Pick up the cup from the night stand.",
                        "Turn around and head towards the desk.",
                        "Place the cup with the pencil in front of the alarm clock on the desk."
                    ],
                    "task_desc":"Place the cup with the pencil in front of the alarm clock on the desk.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_384PI804XVIPKCCOX7P7TX389QD0SX",
                    "high_descs":[
                        "Turn left, hang a right at the couch, and walk to the silver container on the floor across the room.",
                        "Pick up the pencil from inside the silver container.",
                        "Turn right and head past the window to the side table next to the bed.",
                        "Place the pencil inside the black mug in between the keys and the cell phone.",
                        "Pick up the mug with the pencil inside.",
                        "Turn around, hang a left at the end of the bed and walk to the wooden desk on your right.",
                        "Place the mug in front of the clock on top of the desk."
                    ],
                    "task_desc":"Place a mug with a pencil on a wooden desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Safe-323/trial_T20190918_181136_220658/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_3FDJT1UU77ZYCP7FLCBYKSSR3WYK5P",
                    "high_descs":[
                        "Walk across the room to the brown desk.",
                        "Pick up the keys from the top of the desk.",
                        "Turn around, walk past the couch to the brown dresser.",
                        "Put the keys in the white safe on top of the cd."
                    ],
                    "task_desc":"Move the keys from the desk to the safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3RRCEFRB7P3FN3ZL1UFVGX3NG6TB4Q",
                    "high_descs":[
                        "walk to the desk",
                        "pick up the keys from the desk",
                        "take the keys over to the dresser where the safe is.",
                        "set the keys on the dresser."
                    ],
                    "task_desc":"get the keys from the desk and put them on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A14IPKOBOPID9H_3VELCLL3GNAO8LEIJEIP1PN5JKBF1Z",
                    "high_descs":[
                        "Turn right and go just past the bed then turn left then right and head to the desk",
                        "Pick up the keys from the desk",
                        "Turn right, then turn right and go past the sofa, then turn right and go to the tall dresser",
                        "Put the keys in the safe that is on the dresser"
                    ],
                    "task_desc":"Put the keys in the safe",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Safe-323/trial_T20190918_181154_498986/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_30ZX6P7VFBMB28IAL89OL6P24XVJ2C",
                    "high_descs":[
                        "Turn white and walk across the room to the right of the bed. Turn right after the rug and go to the brown dresser.",
                        "Pick up the car keys on the brown dresser.",
                        "Turn around and go in a circle going back to the brown dresser.",
                        "Open the white safe and put the car keys inside of it."
                    ],
                    "task_desc":"Pick up the car keys and put them in the white safe.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3IGI0VL64ABLS5Y0N4ZDLQ9MEMTNON",
                    "high_descs":[
                        "Turn and go to the dresser that is to the left of the couch.",
                        "Pick up the keys that are on the dresser.",
                        "with the keys in hand turn so you are now on the other side of the dresser where the white safe is.",
                        "Open the safe that is on the dresser.  Place the keys in the safe and shut the safe."
                    ],
                    "task_desc":"Move keys to the safe.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3HMIGG0U4OXCJCFYNPJS5KHT31NY8F",
                    "high_descs":[
                        "Go to the cabinet next to the sofa",
                        "Pick up the keys from the top of the cabinet",
                        "Turn around and face the cabinet again",
                        "Place the keys in the safe"
                    ],
                    "task_desc":"Place keys in a safe",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Safe-323/trial_T20190908_115121_030635/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_35USIKEBNU7V3ZSWN8DJ4QNVTMC6NU",
                    "high_descs":[
                        "Look down at the top of the dresser that is directly in front of you. ",
                        "Pick up the keys that are sitting on the dresser.",
                        "Move back from the dresser a bit, but still face it.",
                        "Place the keys inside of the safe that sits on top of the dresser and close the door."
                    ],
                    "task_desc":"Move a set of keys to a safe.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_36PW28KO42NSWVRMKMRCU8V8BDCEAE",
                    "high_descs":[
                        "Step back from the dresser with a safe on it. ",
                        "Pick up the keys behind the CD, on the dresser. ",
                        "Step back from the dresser with the keys. ",
                        "Place the keys on the safe, on the right side of the dresser. "
                    ],
                    "task_desc":"Put the keys in the safe. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3BDCF01OG0L7YJZHHESWAP3ZN15LY7",
                    "high_descs":[
                        "look down at the dresser",
                        "pick up the keys that are on the dresser",
                        "take a few steps to the left, face the safe ",
                        "open the safe, put the keys inside, close it"
                    ],
                    "task_desc":"move keys from the dresser to the safe",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-Mug-None-DeskLamp-323/trial_T20190907_041046_628363/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_36WLNQG782RPUGAGUS2ROXVCZ7YEB1",
                    "high_descs":[
                        "turn to the left twice and go to the wall and turn to the right and go the desk chair",
                        "turn on the lamp on the desk",
                        "pick up the dark mug from the desk"
                    ],
                    "task_desc":"Examine a mug by the light of a desk lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3PZDLQMM0W2G95Q6F83LXGS5KPZ2CL",
                    "high_descs":[
                        "Turn completely around and walk over to the desk that is now on your right. ",
                        "Turn on the lamp that is on the desk.",
                        "Pick up the black mug that is to the right of the gray bowl."
                    ],
                    "task_desc":"Inspect a black mug using the light of a lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3IGI0VL64A1D7GC2RWAWK4PKKQOONU",
                    "high_descs":[
                        "turn to the left and turn to the left and go forward to the wall and turn to the right and go forward to the desk",
                        "turn on the lamp light on the desk ",
                        "pick up the mug on the desk"
                    ],
                    "task_desc":"examine a mug by the light ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3Z3ZLGNNSLB9OOW8OQIL0VMEUA3Q3C",
                    "high_descs":[
                        "Turn around, walk straight to the wall, turn right to face the desk and walk to the desk.",
                        "Turn on the lamp on the desk.",
                        "Pick up the cup on the desk."
                    ],
                    "task_desc":"Pick up a cup with the lamp on.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PGS1Q1XAY79I_3ZSY5X72N0SYME4UK3RDTOUULN0OR5",
                    "high_descs":[
                        "Turn around from facing the bed, walk towards the wall opposite the bed and hang a right and walk to the desk.",
                        "Turn on the lamp located at the left rear of the desk top.",
                        "Pick up the black mug located to the right of the gray bowl."
                    ],
                    "task_desc":"Go to the desk, turn on the lamp, pick up a mug",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3QRYMNZ7F1YTK8HANDWVEEV7J6ONTE",
                    "high_descs":[
                        "Turn around and then to the right to find the desk.",
                        "Turn on the lamp to the left side of the desk.",
                        "Pick up the mug from the back up the desk."
                    ],
                    "task_desc":"Turn on the lamp and pick up a mug.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Mug"
            ]
        },
        "train/pick_and_place_simple-CD-None-Safe-323/trial_T20190908_030027_358974/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3180JW2OT7TVGGFZ7JM5IR8CUJVJ5D",
                    "high_descs":[
                        "Turn left, go straight, turn left around the couch, then turn right to go to the desk.",
                        "Pick up the CD on the desk, next to the clock.",
                        "Turn around, go straight past the couch, then turn right to go to the dresser with the safe on it.",
                        "Put the CD inside of the safe."
                    ],
                    "task_desc":"Put a CD in the safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A4CHLWPHZIP7Y_3KGTPGBS602CVZ761ZOLRMEBRPX2UM",
                    "high_descs":[
                        "Turn left, go toward the trash can, turn left, go toward the wall, turn right, and go to the brown desk.",
                        "Take the CD from the brown desk.",
                        "Turn left, go to the wall, turn right, and go to the brown dresser.",
                        "Open the white safe, put the CD in the white safe, and close the white safe."
                    ],
                    "task_desc":"Put a CD in the safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3VAR3R6G1SIS49PYLULD27ZPV2S8O7",
                    "high_descs":[
                        "Turn to the left and then the right to find the desk.",
                        "Pick up the CD from the back of the desk.",
                        "Take the CD and turn around. Go to the other side of the room and turn right to locate the tall dresser.",
                        "Open the safe on top of the dresser and place the CD inside. Shut the safe."
                    ],
                    "task_desc":"Move a CD from the desk to a safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "CD",
                "Desk"
            ]
        },
        "train/pick_and_place_simple-CD-None-Safe-323/trial_T20190907_211140_841572/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3DHE4R9OCZSTQH6BHUZ4N7DKIHF2GJ",
                    "high_descs":[
                        "Turn to your right and walk forward until you reach the dresser that is on the left side of the couch. ",
                        "Pick up the CD that is on the dresser. ",
                        "Open the white safe that is sitting on the dresser. ",
                        "Place the CD in the safe and close the door. "
                    ],
                    "task_desc":"Move a CD to the safe. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3LEP4MGT3JHK2AWGYXR7IFDRZUADBI",
                    "high_descs":[
                        "Turn right and go all the way to the dresser and face it.",
                        "Pick up the CD from the dresser.",
                        "Turn all the way around until you see the safe.",
                        "Open the safe and put the CD inside and close the door."
                    ],
                    "task_desc":"Put the CD inside the safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3WYP994K1A8HU9ACY2XDKK103I76Y2",
                    "high_descs":[
                        "turn right, walk to the cabinet",
                        "grab the disc on the cabinet",
                        "turn around, turn around",
                        "open the safe, put the disc in , close the safe"
                    ],
                    "task_desc":"put the disc on the cabinet to the safe",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "CD"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-Desk-323/trial_T20190907_190012_475054/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3FIUS151DYJJ5BEIG9KTPB7LRXUGGJ",
                    "high_descs":[
                        "Go forward and slightly right to the trash canister.",
                        "Pick up the pen out of the canister.",
                        "Turn around and veer left to the cabinet on the right side of the bed.",
                        "Put the pen in the mug on the counter.",
                        "Pick up the mug.",
                        "Go forward and veer right to the desk.",
                        "Put the mug on the desk in front of and to the right of the pencil."
                    ],
                    "task_desc":"Put a mug with a pen in it on a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3FUI0JHJP0FHHNQ6QF6PNNT3JMG33K",
                    "high_descs":[
                        "Move to the trash can right of the desk. ",
                        "Take the pen out of the trash can.",
                        "Bring the pen to the night stand on the right of the bed.",
                        "Put the pen in the mug on the night stand. ",
                        "Pick up the mug from the night stand. ",
                        "Bring the mug to the desk.",
                        "Put the mug on the desk. "
                    ],
                    "task_desc":"Put the mug with pen on the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3TXWC2NHN277G601X380M841BVGS9B",
                    "high_descs":[
                        "Walk across the room to the trash can.",
                        "Take the pen out of the trash can.",
                        "Turn and walk across the room, hang a left after the bed and go to the nightstand next to the bed.",
                        "Put the pen in the coffee cup.",
                        "Pick up the coffee cup with the pen in it.",
                        "Walk across the room, take a right at the sofa, and go to the desk.",
                        "Set the cup with the pen in it down near the front edge of the desk."
                    ],
                    "task_desc":"Take the coffee cup with the pen inside to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Safe-323/trial_T20190907_234431_849819/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_3NQL1CS15UP29ZPDZA5LWCHZKI2YV3",
                    "high_descs":[
                        "Head across the room to the desk",
                        "Take the cell phone from the desk",
                        "turn around, head across the room to the dresser",
                        "Put the phone in the white safe, close the door to the safe"
                    ],
                    "task_desc":"Put the cell phone in the white safe, close the door",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3XLBSAQ9Z7T03ZYMDY4O45AY4TFZ7H",
                    "high_descs":[
                        "Move forward to the couch, turn right and go to the desk.",
                        "Pick up the phone on the desk.",
                        "Turn around, bring the phone past the couch to the tall dresser on the right. ",
                        "Put the phone in the safe on the dresser. "
                    ],
                    "task_desc":"Put a phone in a safe on the dresser. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3YHH42UU5EW2GZHYDYS6HBPDH69L0S",
                    "high_descs":[
                        "Go forward to go to the couch, then turn right and approach the desk.",
                        "Pick up the cell phone on the desk.",
                        "Turn around, go straight past the couch, then turn right to face the dresser.",
                        "Put the cell phone inside of the safe, on the dresser."
                    ],
                    "task_desc":"Put a cell phone in the safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "Dresser",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Safe-323/trial_T20190907_234526_733036/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"APXNY64HXO08K_34PGFRQONRSPTZUJ3K9E8RLPEM3WJN",
                    "high_descs":[
                        "Go to the dresser in front of you.",
                        "Pick up the cell phone on the edge of the dresser behind the coffee cup. ",
                        "Turn around and go towards the wall on your left to the safe sitting on the dresser.",
                        "Open the safe between the wall and clock. Place the phone in the safe next to the keys and close the safe."
                    ],
                    "task_desc":"Put the cellphone in the safe. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_386CSBG1O238L7JQ7SGJ7YYY4FGQ6L",
                    "high_descs":[
                        "Walk forward to the dresser.",
                        "Pick up the cell phone from the dresser.",
                        "Walk slightly to the left to the safe on the dresser.",
                        "Put the cell phone in the safe and close it."
                    ],
                    "task_desc":"Place a cell phone inside a safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3M1CVSFP63M989VTX5XVN30K0Y7QAC",
                    "high_descs":[
                        "Go straight ahead to the brown dresser.",
                        "Pick up the cell phone from the back rear of the dresser.",
                        "Hold the cell phone and take a step to the left.",
                        "Open the safe and put the cell phone inside. Shut the safe."
                    ],
                    "task_desc":"Place a cell phone in the safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Safe-323/trial_T20190907_234512_145231/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3PMBY0YE2AKR9PB50HI0730JQ1CC92",
                    "high_descs":[
                        "Turn around and cross the room then hang right and walk to the dresser",
                        "Pick up the cell phone that is on the right; the one that is closer to the right edge of the dresser",
                        "Take a step to the left and continue to face the dresser",
                        "Open the white safe that is sitting on top of the dresser and place the phone inside then close the safe"
                    ],
                    "task_desc":"Place a phone in a safe",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3SNLUL3WO74IWLTEB56Q6IDKXVLULC",
                    "high_descs":[
                        "Turn around and go to the dresser next to the couch.",
                        "Pick up the phone on the far right.",
                        "Move slightly to your left.",
                        "Put the phone in the safe and close the safe."
                    ],
                    "task_desc":"Put a phone in the safe on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3WI0P0II6497IHD5UUDXIUIVHNHDRD",
                    "high_descs":[
                        "Turn around and go to the back of the room then turn right.",
                        "Pick up the cell phone from the back right of the dresser.",
                        "Hold the cell phone and take a step to the left.",
                        "Open the white safe on top of the dresser and place the cell phone inside. Shut the door."
                    ],
                    "task_desc":"Place a cell phone in a safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "CellPhone"
            ]
        },
        "tests_seen/trial_T20190908_220343_347903/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "turn left and walk to the garbage can next to the desk",
                        "pick up the pencil from the garbage can",
                        "look up turn right and walk to the bed side table in the corner of the room",
                        "place the pencil into the black mug",
                        "pick up the black mug with the pencil in it",
                        "turn right ninety degrees and then walk to the desk",
                        "place the black mug with a pencil in it on to the desk next to the note pad"
                    ],
                    "task_desc":"place a black mug with a pencil in it on to the desk"
                },
                {
                    "high_descs":[
                        "turn left, move forward and make a right in front of the sofa and go towards the trash can next to the right of the desk",
                        "remove the pencil from the bottom of the trash can",
                        "turn to the right and move towards the night stand table to the left of the bed",
                        "put the pencil inside of the black coffee mug on the left upper corner of the night stand",
                        "pick up the coffee mug with the pencil inside of it",
                        "turn around and move towards the desk, turning to face the desk",
                        "put the coffee mug with the pencil inside of it on the front edge of the desk to the right of the book"
                    ],
                    "task_desc":"put a coffee mug with a pencil inside of it on the desk"
                },
                {
                    "high_descs":[
                        "Turn around and then go right to face the trash bin.",
                        "Pick the pencil up from the trash bin.",
                        "Go right and stand in front of the night stand to the left of the bed.",
                        "Put the pencil in the cup.",
                        "Pick the cup up from the night stand.",
                        "Turn around and face the desk.",
                        "Put the cup on the desk."
                    ],
                    "task_desc":"Put a cup with a pencil in it on a desk."
                },
                {
                    "high_descs":[
                        "Move left and then walk all the way right until you reach a trash can",
                        "Pick up a pencil from inside the trash can",
                        "Walk all the way right until you reach a bedside table",
                        "Place the pencil inside the coffee mug that is sitting on the table",
                        "Pick up the coffee mug with the pencil inside it",
                        "Turn around and maneuver until you are facing the right side of the bedroom desk",
                        "Place the coffee mug with the pencil inside of it down on the table"
                    ],
                    "task_desc":"Move a coffee mug with a pencil inside of it from a table to a bedroom desk"
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil"
            ]
        }
    }
}