{
    "scene_name":"FloorPlan216",
    "trials":{
        "train/look_at_obj_in_light-Vase-None-DeskLamp-216/trial_T20190906_200458_622810/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_36ZN444YTUFLTF1BUGX4FWT3XV1OIS",
                    "high_descs":[
                        "Move to the stand under the TV on the wall. ",
                        "Pick up the vase from the stand. ",
                        "Bring the vase to table left of the couch.",
                        "Turn the light on on the table. "
                    ],
                    "task_desc":"Examine the vase in the light by the couch. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_39GXDJN2OWVNUTYVM67RXZTXQS2V82",
                    "high_descs":[
                        "Turn right, go to the middle of the sofa, turn left, walk to the tv cabinet",
                        "Grab the white vase on the right side",
                        "Turn right, walk to the end, turn right, walk to the corner",
                        "Turn on the lamp on the end table"
                    ],
                    "task_desc":"Grab the white vase on the right side, turn on the lamp on the end table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3RKNTXVS3PF2J48VZ8QIK0ZF3WEA4I",
                    "high_descs":[
                        "walk over to the brown cabinet below the television",
                        "grab the white dish off of the middle part of the middle shelf",
                        "walk over to the brown nightstand",
                        "turn on the lamp on the nightstand"
                    ],
                    "task_desc":"turn on the lamp on the nightstand while holding a white dish",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "train/pick_two_obj_and_place-Newspaper-None-ArmChair-216/trial_T20190907_074201_426995/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2JBNDG0U9IA6I_3U4J9857OHS4L1V67KOLIN3VD9S7BK",
                    "high_descs":[
                        "Turn to the left and walk to the end of the room, face the small desk on the left",
                        "Pick up the paper on the desk",
                        "Turn to the left and walk to the end of the room and face the chair on your left",
                        "Place the newspaper on the arm of the chair",
                        "Turn around and walk to the TV stand that has the remote on it",
                        "Pick up the newspaper on the stand",
                        "Turn around and walk back the chair and face it",
                        "Place the newspaper on the seat cushion of the chair"
                    ],
                    "task_desc":"Putting newspapers on the chair",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Chair"
            ]
        },
        "train/pick_two_obj_and_place-Newspaper-None-ArmChair-216/trial_T20190907_074138_151478/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2CT57W84KXX25_3HL8HNGX48IYC1VFRJ81F9LMN0Z9FD",
                    "high_descs":[
                        "Walk to the shelf",
                        "Grab the newspaper from the shelf",
                        "Carry it to the chair",
                        "Place the newspaper down on the chair",
                        "Walk over to the table ",
                        "Grab the other newspaper that is on top of it",
                        "Carry it to the chair",
                        "Sit the newspaper down on the chair cushion"
                    ],
                    "task_desc":"Getting the newspaper ready to be read",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-ArmChair-216/trial_T20190909_054954_990241/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_33SA9F9TR0LP38UPLRN4CXSZ357WEH",
                    "high_descs":[
                        "Move forward to the wall, turn left, move to the trash can, turn left to face the credit card on the round table.",
                        "Pick up the credit card on the table. ",
                        "Turn left, go to the wooden table on the left, turn right, go to the chair.",
                        "Put the credit card on the chair. "
                    ],
                    "task_desc":"Put a credit card on a chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3BEFOD78W9KB6U3ISJ54UDEHSE04MT",
                    "high_descs":[
                        "Walk ahead to the wall, then turn left to the garbage bin, then turn left and face the table.",
                        "Pick up the gray credit card on the table.",
                        "Turn left and take a few steps, then turn right and walk to the brown chair with the cushion on it.",
                        "Put the credit card on the chair in front of the pillow."
                    ],
                    "task_desc":"Place a credit card on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3WJ1OXY92D7BNUHV7J5C2YZM0J7A8M",
                    "high_descs":[
                        "Take a left at the wall and walk left to face the round table.",
                        "Pick up the blue credit card near the edge of the round table.",
                        "Turn left, hang a right at the wooden dresser and walk to the brown chair ahead.",
                        "Put the credit card on the left side of the chair in front of the pillow."
                    ],
                    "task_desc":"Place a credit card on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Chair"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Sofa-216/trial_T20190907_014811_569477/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_33OOO72IVK2AT4KJYNNHY31VJUPTC0",
                    "high_descs":[
                        "Turn around and head to the desk.",
                        "Close the laptop and pick it up.",
                        "Turn around and head to the sofa.",
                        "Put the laptop in the center of the sofa."
                    ],
                    "task_desc":"Move the laptop from the desk to the center of the sofa.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_36WLNQG782RPUGAGUS2ROXVCYZAEBW",
                    "high_descs":[
                        "Turn left and walk to the wall then turn left and walk to the laptop.",
                        "Close the laptop then pick it up.",
                        "Turn left and walk until you are even with the couch on your left and then turn and walk to the couch so you are facing the right side of it.",
                        "Place the laptop in the middle of the couch."
                    ],
                    "task_desc":"Place a laptop on the couch cushions.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3TY7ZAOG5I1RWTZGSYG52BCYRSZK0Q",
                    "high_descs":[
                        "Turn around and walk towards the laptop on the desk.",
                        "Close the laptop lid and pick it up from the desk.",
                        "Turn left, head towards the white vase on the right, and then turn left towards the sofa.",
                        "Place the laptop in the middle of the long sofa."
                    ],
                    "task_desc":"Move the laptop from the desk to the sofa.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-Sofa-216/trial_T20190909_150024_719377/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2TBXASXZIRNNW_3JPSL1DZ5VQWQ14ZDLUVKVPHPMXANH",
                    "high_descs":[
                        "Walk over to the desk.",
                        "Grab the remote",
                        "Head over to the couch",
                        "Put the remote on the couch."
                    ],
                    "task_desc":"Put the remote on the couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OONKJ5DKFAJRW93KEU4UV9SXEOBOT",
                    "high_descs":[
                        "Turn around and walk forward, then hang a right and walk up to the wooden table below the television.",
                        "Pick up the remote off of the right side of the wooden table.",
                        "Walk over to the couch against the wall behind you.",
                        "Put the remote on the right side of the couch seat."
                    ],
                    "task_desc":"Move a remote to the couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_3ZPPDN2SLYNERCHHSGDCYDKO5B2E93",
                    "high_descs":[
                        "turn around and walk straight then turn right towards the desk",
                        "pick up the remote off of the desk",
                        "turn left and walk straight then turn left again towards the couch",
                        "put the remote down on the couch"
                    ],
                    "task_desc":"move the remote from the desk to the couch",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        }
    }
}