{
    "scene_name":"FloorPlan218",
    "trials":{
        "train/pick_two_obj_and_place-Newspaper-None-GarbageCan-218/trial_T20190907_225437_969645/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A23HZ18KTCK2DA_39U1BHVTDO8MG4O05UCG50X1EXI3TF",
                    "high_descs":[
                        "Turn and go to the table so you are facing where the newspaper is.",
                        "Pick up the newspaper that is on the table.",
                        "With the newspaper in hand turn and go to the trash can that is in the corner.",
                        "Place the newspaper in the trash can that is in the corner.",
                        "Go to the left side of the couch to the table on the side.  ",
                        "Pick up the newspaper on the table.",
                        "With the newspaper in hand turn and go to the trash can that is in the corner.",
                        "Place the newspaper in the trash can."
                    ],
                    "task_desc":"Place the newspapers in the trash.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/look_at_obj_in_light-WateringCan-None-DeskLamp-218/trial_T20190906_182650_151382/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3DBQWDE4Y9FRZ66KMHEXBYPS0FV5NH",
                    "high_descs":[
                        "Turn around and walk to the left side of the fireplace.",
                        "Pick up the pitcher on the floor.",
                        "Turn around and walk straight to the circular table.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a pitcher by the light of a lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3LUY3GC632H6PVWGQP6MD78JR0UP7F",
                    "high_descs":[
                        "Turn right and walk over to the left side of the fireplace",
                        "Pick up the tea pot from the floor just left of the fireplace",
                        "Turn left and walk over to the small table in the corner near the chair",
                        "Turn on the table lamp that's on the table"
                    ],
                    "task_desc":"Examine the tea pot under light of the lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_32SCWG5HIKLNLVIB7F1U7T8OZJWP6V",
                    "high_descs":[
                        "Turn around and move towards the fireplace then turn left and move to the area between the TV stand and the hearth.",
                        "Pick up the tea kettle on the ground.",
                        "Turn left and move past the television to the small wooden table in the corner of the room.",
                        "Turn on the lamp to the right of the credit card on the table."
                    ],
                    "task_desc":"Examine a tea kettle using the light from a table lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3PDJHANYK8XV8EKNO2TPYK6XDSO6H9",
                    "high_descs":[
                        "Turn around and walk to the right side of the TV stand.",
                        "Pick up the pitcher on the floor.",
                        "Turn left and go past the TV to the small wooden table in the corner of the room.",
                        "Turn on the table lamp."
                    ],
                    "task_desc":"Look at a pitcher with the illumination of a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3C2NJ6JBKDYZ09NX4YCZDRMGG4QN2I",
                    "high_descs":[
                        "Turn around, walk to the fireplace and turn left to face the teapot on the floor.",
                        "Pick up the teapot on the floor.",
                        "Turn around to face the white couch, walk forward slightly, then turn right to cross the room, turn right at the white chair, face the small wooden table on your left and walk to it.",
                        "Turn on the lamp on the right side of the wooden table."
                    ],
                    "task_desc":"Examine a teapot near the light of a small lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3S0TNUHWKWZ10CY9VL7XRDNQRV8D8G",
                    "high_descs":[
                        "Turn around and walk forward to the watering can on the floor by the fireplace.",
                        "Pick up the watering can from the floor.",
                        "Turn left and walk to the lamp on the desk to the right of the chair.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a watering can by the light of a desk lamp.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan"
            ]
        },
        "train/look_at_obj_in_light-WateringCan-None-DeskLamp-218/trial_T20190906_182706_439184/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_323Q6SJS8LXRR7DYPVWTSQJ93X3FH4",
                    "high_descs":[
                        "Walk forward and turn left by the left side of the fireplace",
                        "Pick up the pot from the floor just left of the fireplace",
                        "Turn left and walk over to the small table near the chair in the corner",
                        "Turn on the lamp on the table"
                    ],
                    "task_desc":"Examine the tea pot under light of the table lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3RRCEFRB7PT72EDN5MQEFBJKJULB4S",
                    "high_descs":[
                        "Move towards the fireplace and turn left and face the watering can on the ground.",
                        "Pick up the watering can from the floor.",
                        "Turn left and move towards the small table in the corner of the room that has a lamp on it.",
                        "Turn on the lamp on the table."
                    ],
                    "task_desc":"Examine a watering can using the light of a table lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_32XVDSJFP2ETIR2XSXXZ0CXHEABM29",
                    "high_descs":[
                        "Move forward to the fire place, turn left, move to the vase on the floor. ",
                        "Pick up the vase on the floor. ",
                        "Turn left, bring the vase to the small square table in the corner.",
                        "Turn on the lamp on the table."
                    ],
                    "task_desc":"Examine a vase in the light of the lamp on the table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3KRVW3HTZQ2MNQJVMCC5RUALC3AMSA",
                    "high_descs":[
                        "Walk forward to the watering can on the floor by the fireplace.",
                        "Pick up the watering can from the floor.",
                        "Turn left and walk forward to the lamp on the desk to the right of the chair.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a watering can by the light of a desk lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3RXPCZQMQSSM1WOFYQZQIO3FQHVG1M",
                    "high_descs":[
                        "go forward to the front of the fireplace and turn to the left and go to the tea pot on the floor",
                        "pick up the tea pot from the floor",
                        "turn to the left twice and take a step and turn right and go past the TV stand and turn right and go to the wall and turn to the left and go to the small table",
                        "turn on the lamp on the small table."
                    ],
                    "task_desc":"Examine a tea pot by the light of a table lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ANPTDUX6LOGYY_3IX2EGZR7E0KL3DX4QZ8LSD7JDEJR4",
                    "high_descs":[
                        "Walk forward toward the white chimney then turn to your left and walk closer to the white tea pot. ",
                        "Pick the white tea pot on the floor in front of you. ",
                        "Turn to your back walk a few steps and then turn to your right, walk towards the white chair and wooden table turn left walk a few steps turn left again and face the table. ",
                        "Turn on the lamp that is on the top right corner. "
                    ],
                    "task_desc":"Grab a tea pot next to a fireplace taking it to the wooden table turning the lamp on.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-Dresser-218/trial_T20190906_200605_664317/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_37FMASSAYF81ALC2QBSI9CT4QV2IB0",
                    "high_descs":[
                        "Turn around and walk over to the small wooden table in the corner of the room to the right of the white chair.",
                        "Pick up the white phone off of the small wooden table.",
                        "Turn around and take a step, then turn right and begin walking across the room, the walk around the dining room table to the corner with the grey plate.",
                        "Place the white phone on the grey plate standing up.",
                        "Pick up the grey plate with the phone on it.",
                        "Turn right and walk over to the wooden dresser with the television on it.",
                        "Place the grey plate with the phone on it onto the wooden dresser to the left of the television."
                    ],
                    "task_desc":"Place a grey plate with a white phone on it onto the dresser.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3TE3O85733PKF7FPX5TGMBRRJL8R2B",
                    "high_descs":[
                        "Turn around to your right and go to the TV screen, then turn left and go to the table in the corner.",
                        "Pick up the cell phone that is in front of the lamp.",
                        "Turn to your left to go to the dining table, then left again to go around to the left end of the table. Turn to your right to face the end of the table with a plate near the edge.",
                        "Put the phone standing vertically on the back right edge of the plate.",
                        "Pick up the plate with the phone on it.",
                        "Turn right to go behind the sofa to the far wall, then turn right to face the cabinet that is holding the TV screen.",
                        "Put the plate in the open space at the end of the cabinet, with the phone facing you at the front edge of the plate."
                    ],
                    "task_desc":"Place a plate with a cellphone standing upright on it next to a television screen.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_39N5ACM9HH4A3EK95M46R3ZQPD5P9T",
                    "high_descs":[
                        "Turn around and go to the left to find the small table in the corner.",
                        "Pick up the cell phone from the right side of the table.",
                        "Hold the cell phone and turn to the left, then the right and go straight back. Turn to the left and then the right again the find the large table.",
                        "Place the cell phone on the plate on the table.",
                        "Pick up the plate and cell phone from the table.",
                        "Carry the plate and turn right, then left to go past the table. Turn right to go to the other side of the room and find the short dresser.",
                        "Place the plate and cell phone on the dresser."
                    ],
                    "task_desc":"Move a cell phone to a plate and move both to a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3BXQMRHWK2F223BZBH756VS9WDNUMF",
                    "high_descs":[
                        "turn right and walk towards the tv and then turn left and walk towards the small table with the lamp on it",
                        "Pick up the phone from the table",
                        "turn left and walk towards the dining table and then turn left. walk to the end of the table and turn right and face the end of the table",
                        "put the phone on the plate",
                        "pick up the plate on the table",
                        "turn right and then turn left, turn right after the couch and then walk towards the tv stand and then face the tv stand",
                        "set the plate down on the tv stand, next to the tv"
                    ],
                    "task_desc":"take a phone on a plate and set it next to the tv",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Dresser",
                "Plate",
                "CellPhone",
                "Television"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-Dresser-218/trial_T20190906_200527_066733/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_39DD6S19JSSLCEDW06IUAF2FPDWEZO",
                    "high_descs":[
                        "Turn right, go to the wall, turn right, go straight to the white chair, turn right, go to the coffee table, turn to face the couch near the coffee table.",
                        "Take the phone on the couch cushion.",
                        "turn right, go back to the white chair, turn left, go to the dining table.",
                        "Put the phone on the gray plate on the dining table.",
                        "Take the plate from the dining table.",
                        "Turn around, go straight to the left side of the wooden dresser with the TV.",
                        "Put the plate on the left side of the wooden dresser."
                    ],
                    "task_desc":"Put a plate with a phone on it on a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A143XRCI1YXAFE_3TY7ZAOG5I1RWTZGSYG52BCYR610K0",
                    "high_descs":[
                        "Turn around 180 degrees, walk to the opposite side of the room, turn 90 degrees to the left when you reach the other end, and walk over to the sofa.",
                        "Pick up the phone on the couch.",
                        "Turn to the right 90 degrees, then to the left 90 degrees, and walk over to the table.",
                        "Put the phone on the plate.",
                        "Pick up the plate on the table.",
                        "Turn around 180 degrees and walk back over to the other side of the room.",
                        "Place the plate on the top of the bookshelf."
                    ],
                    "task_desc":"Put a phone on a plate before placing the place on a shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3YMU66OBIQPX579T0F2BABJM647GHW",
                    "high_descs":[
                        "Turn right and begin walking to the wall, then turn right again and walk across the room to the front of the couch.",
                        "Pick up the white phone off of the couch cushion.",
                        "Turn around and take a step, then turn left and begin walking across the room, hang a left and walk up to the large wooden table.",
                        "Put the phone on the grey plate that is on the large wooden table.",
                        "Pick up the grey plate with the phone on it.",
                        "Turn around and walk across the room to the large wooden dresser with the television on it.",
                        "Place the grey plate with the phone on it on the wooden dresser to the left of the television."
                    ],
                    "task_desc":"Put a grey plate with a phone on it on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Box-Sofa-218/trial_T20190906_195517_392225/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_31T4R4OBOVXNV6NCLKKGT79DU43C7Q",
                    "high_descs":[
                        "Turn around and head towards the square table in front of the couch.",
                        "Pick up the phone to the left of the silver plate.",
                        "Turn left, walk towards the tv stand, turn right walk towards the table on your right, and turn right to look at the table.",
                        "Place the phone inside the box on the table.",
                        "Pick up the box from the table.",
                        "Turn right, head towards the edge of the table, turn left and head towards the sofa.",
                        "Place the box behind the tv remote on the sofa."
                    ],
                    "task_desc":"Place the box with one of the phones on the sofa.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_35DR22AR5G1TXLXKA4DDU3I7QNB3XQ",
                    "high_descs":[
                        "turn around and walk forwards to the coffee table in front of the couch",
                        "pick a cellphone up from the coffee table there",
                        "move over to the other side of the coffee table",
                        "place the cellphone inside of the box on the coffee table",
                        "pick up the box off of the coffee table",
                        "move around to the other side of the coffee table again, then face the couch",
                        "place the box down on the couch"
                    ],
                    "task_desc":"place a box with a cellphone in it down on the couch",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3I33IC7ZWIJSGQT8VU7URL2HJQ22AE",
                    "high_descs":[
                        "Turn around and go to the coffee table.",
                        "Pick up the cell phone that is on the coffee table the one that is between the box and the plate on the table.",
                        "Move around the table to be in front of the box while holding the cell phone.",
                        "Put the cell phone in the box.",
                        "Pick up the box that has the cell phone in it. ",
                        "With the box take it to the couch the side that has the remote on the cushion.",
                        "Put the box with the cell phone on the couch between the remote and the arm of the couch."
                    ],
                    "task_desc":"Put the cell phone in the box.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Sofa",
                "Box",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-Plate-None-Dresser-218/trial_T20190907_013555_841038/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_386PBUZZXIE9I5IKZ62CZG49F4LLJI",
                    "high_descs":[
                        "Turn around and walk to the end table by the white chair",
                        "Grab the grey plate on the end table",
                        "Turn around, walk to the TV cabinet",
                        "Put the plate on the cabinet"
                    ],
                    "task_desc":"Move the grey plate on the end table to the TV cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3B2X28YI3ZWLH1H1OAJTC93ZH44B6W",
                    "high_descs":[
                        "Walk over to the fireplace, then turn left and walk up to the small wooden table in the corner of the room with a plate and lamp on it.",
                        "Pick up the grey plate off of the small wooden table.",
                        "Turn around and walk over to the dresser with the television on it.",
                        "Place the grey plate onto the dresser to the left of the television."
                    ],
                    "task_desc":"Place a grey plate onto the dresser in the living room.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3Y54SXRO1O26FY1JKE8HS9N1QZCUT1",
                    "high_descs":[
                        "Go to table in corner with white chair and lamp",
                        "Pick up black plate from table with lamp",
                        "Turn right, go to cabinet with television",
                        "Place black plate on end of cabinet to the right side of the television"
                    ],
                    "task_desc":"Move black plate from table to television cabinet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_and_place_simple-Plate-None-Dresser-218/trial_T20190907_013614_368009/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3137ONMDKJMLLXIRAEU5P8M9EE5EGK",
                    "high_descs":[
                        "Turn around and walk towards the door and then turn right towards the table on your right.",
                        "Pick up the plate from the table.",
                        "Turn right and walk towards the tv stand.",
                        "Place the place on the left side of the tv stand."
                    ],
                    "task_desc":"Place the plate from the table on the tv stand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3PIWWX1FJMN3NFUKWLQZJ1RHBC6JJY",
                    "high_descs":[
                        "Turn around, head towards the door with windows, turn right, go behind the dining room table chair.",
                        "Take the dark plate from the table.",
                        "Turn right, go past the couch to the left side of the TV stand.",
                        "Put the plate on the TV stand."
                    ],
                    "task_desc":"Put the dark plate on the left side of the TV stand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2L22HZ50T83UK_3TK8OJTYM4280LXC8N92JLONF00PVA",
                    "high_descs":[
                        "Turn around and stand at the end of the table in front of the grey plate",
                        "Pick up the grey plate from the table",
                        "Turn right, then left and walk forward until you reach the table that the TV set is on. ",
                        "Leave the grey plate on the table to the left of the TV set."
                    ],
                    "task_desc":"Pick the grey plate up from the kitchen table and leave it over on the television table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-SideTable-218/trial_T20190908_172146_877162/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_3F6HPJW4JGRX8SI9S7S3AWJA6YH2WD",
                    "high_descs":[
                        "Turn around completely and walk forward.Make a left at the chair and walk to the table. ",
                        "Pick up cell phone from the table. ",
                        "Turn to the left walk forward then make a left again to face the end of the table. ",
                        "Place the cell phone on top of the plate on the table. ",
                        "Pick up the plate and cell phone off of the table. ",
                        "Turn completely around and walk forward. Turn and make a right and head toward the fireplace. Turn and make another right and face the coffee table. ",
                        "Place the phone and plate on the coffee table. "
                    ],
                    "task_desc":"Move a phone and plate to a coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3R6BYFZZPA3WYMZBQ73WWYR6O5XXFS",
                    "high_descs":[
                        "Turn around then left and move to the large table.",
                        "Pick up the cell phone from the edge of the table.",
                        "Carry the phone and turn to the left a few steps.",
                        "Place the phone on the plate on the left side of the table.",
                        "Pick up the plate from the table.",
                        "Hold the plate and turn  around. Move to the other room and turn right. Turn right past the coffee table and face the small table.",
                        "Place the plate on the small table, to the left of the box."
                    ],
                    "task_desc":"Move a plate and cell phone to a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3SEPORI8WQQQ7QIIG95PFIWQZPOZAK",
                    "high_descs":[
                        "Turn right then walk straight head to the table",
                        "Pick up the cell phone on the table",
                        "Turn left then face plate on the table",
                        "Put the cell phone on the plate",
                        "Pick up the plate with cell phone",
                        "Turn left then head to the side table beside the chair",
                        "Put the plate with cell phone on the side table"
                    ],
                    "task_desc":"Put the plate with cell phone on the side table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-SideTable-218/trial_T20190908_172058_228056/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3O7L7BFSHHG72DAKWAJPB6JROQMIE1",
                    "high_descs":[
                        "turn right and walk to the end of the room, then turn left and walk over to the center of the dining table on the left",
                        "grab the cell phone off of the dining table there",
                        "turn right and walk past the table, the turn left and walk around to the other side of the table",
                        "place the cell phone down on top of a plate on the table",
                        "pick the plate up off of the table",
                        "turn around and walk over to end of the room, then turn right and walk over to the small table in between the two chairs on the right, towards the end of the room",
                        "place the plate down on the table there"
                    ],
                    "task_desc":"place a plate with a cell phone on it on top of the table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3TVRFO09GN6IYE97CI6URBWQL09XLL",
                    "high_descs":[
                        "Look down, and walk to the table to your right to the side where an empty box sits and look down.",
                        "Grab the phone on the table.",
                        "With the phone, look up, and walk to the side of the table where the gray plate sits and look down.",
                        "Place the phone on the plate standing.",
                        "Grab the plate with the phone on it and look up.",
                        "Carrying the phone, turn around, walk straight, turn right when you reach the television stand, walk straight, turn right when you reach the fireplace and walk straight to the table between the chair and couch.",
                        "Place the plate with the phone on it on the table."
                    ],
                    "task_desc":"Place a plate with a phone on it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3U5NZHP4LUTB39OQZ6HF56HG2K6HPP",
                    "high_descs":[
                        "Turn around to the right and go forward. Walk forward to the table then turn right and then right again to go around to the other side of the table. ",
                        "Pick the phone up from the table. ",
                        "Turn to the right and then turn to the left then turn left again to go around the table to the other side. ",
                        "Place the phone on the plate on the table. ",
                        "Pick up the plate and the phone from the table. ",
                        "Turn around and go to the left. Go to the far wall and then turn to the right. Go forward to the fireplace then turn to the right then go around the coffee table and make a left to face the side table. ",
                        "Place the plate and phone on the side table. "
                    ],
                    "task_desc":"Move the plate and phone to the side table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Plate"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Sofa-218/trial_T20190907_231953_945601/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_34S6N1K2ZY0DRZNUB6ZRN3OU3QVHLG",
                    "high_descs":[
                        "Turn around to face the table in front of the couch.",
                        "Pick up the media device on the table in front of the couch.",
                        "Turn to the right to face the couch.",
                        "Place the media device on the right side of the couch.",
                        "Turn left and walk across the room to the TV stand.",
                        "Pick up the media device on the TV stand.",
                        "Turn around and walk forward to face the couch.",
                        "Place the media device next to the first media device."
                    ],
                    "task_desc":"To gather 2 media devices and place them on the right side of the couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-CoffeeTable-218/trial_T20190909_060746_550958/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_34BBWHLWHD21JDWBHADVXCQRVYDWIP",
                    "high_descs":[
                        "Turn right and then right again at the end of the table. Then face the table.",
                        "Pick up the closest cell phone.",
                        "Take two steps left.",
                        "Place the phone on the black plate.",
                        "Pick up the plate.",
                        "Turn around and walk along the left side of the couch, then turn right and walk to the side of the coffee table closest to the fireplace.",
                        "Place the plate on the coffee table, to the right of the credit card and newspaper."
                    ],
                    "task_desc":"Place a plate with a cell phone on it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_34T446B1C35HYK9QWTOOFEJSHOCC0Z",
                    "high_descs":[
                        "turn right and walk past the table on your right, then turn right and walk over to the right side of that table and turn to face it",
                        "grab the cellphone off of the table",
                        "move over to the left side of the table",
                        "place the cellphone down on top of the plate on the left side of the table",
                        "pick up the plate with the cellphone on it",
                        "turn around and walk over to the coffee table in front of the sofa ahead on the right",
                        "place the plate down on top of the coffee table"
                    ],
                    "task_desc":"place a plate with a cellphone on it on top of the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3NQL1CS15UZAUOBBVIU2XY11E89VYK",
                    "high_descs":[
                        "Turn around to face the wooden table with the chairs around it.",
                        "Pick up the smartphone closest to the corner of the wooden table.",
                        "Walk to the middle of the table.",
                        "Put the smartphone down on the plate in the middle of the table.",
                        "Pick up the plate with the smartphone on it.",
                        "Walk around the couches, hanging a right to reach the coffee table.",
                        "Set the plate with the smartphone on it down on the coffee table."
                    ],
                    "task_desc":"Put a smartphone on a plate to set on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CoffeeTable",
                "Plate",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-CoffeeTable-218/trial_T20190909_060543_022173/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3OB0CAO74KG5CNGRQTDYIXAS6SHYHE",
                    "high_descs":[
                        "Turn left walk forward turn right and head to the center table",
                        "Pick up the phone on the center table",
                        "Turn left then head to the dinning table ",
                        "Put the phone on the plate on the dinning table",
                        "Pick up the plate with phone ",
                        "Turn left then head to the center table across the room ",
                        "Put plate with phone on the center table"
                    ],
                    "task_desc":"Put the plate with phone on the center table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3ZWMVK6GNTJ8_3RANCT1ZVI8E41T0G06DT11HFSLBUZ",
                    "high_descs":[
                        "Turn to your left and walk around the couch to the end of the coffee table.",
                        "Pick up the black and white cell phone off the top of a coffee table.",
                        "Turn around and go back around the couch to the end of the kitchen table with the plate sitting on it.",
                        "Place phone on the plate sitting on top of the table.",
                        "Pick up the plate off the table.",
                        "Turn around and head back towards the couch to the coffee table.",
                        "Place the plate on the end of the table to the right of the remote control."
                    ],
                    "task_desc":"Put a plate under the phone that is sitting on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_3S4AW7T80E9R0CLXS74PU0ZSS8JL4F",
                    "high_descs":[
                        "turn left and walk straight then turn right and walk straight towards the table and turn right then left",
                        "pick up the phone off of the table",
                        "turn left then walk straight a little bit then turn left again and walk straight towards the wall and turn left and walk straight towards the table and turn left then walk straight towards the window then turn right then right again towards the table",
                        "put the phone down on the plate on the table",
                        "pick up the plate and the phone on the table",
                        "turn around and then turn left and walk straight towards the couch and turn left and walk straight then turn right and walk straight towards the couch then turn right towards the table then right again and look down",
                        "put the plate and the phone down on the table"
                    ],
                    "task_desc":"clean up a plate and a phone and put them onto the table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "CellPhone"
            ]
        }
    }
}