{
    "scene_name":"FloorPlan406",
    "trials":{
        "train/pick_two_obj_and_place-Candle-None-CounterTop-406/trial_T20190908_045930_816994/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3AAJC4I4FJ9TNUZOE7TL7VF7VZUZJP",
                    "high_descs":[
                        "Turn right and walk up to the toilet",
                        "Pick up the candle from the top of the toilet",
                        "Turn right and walk a couple feet to the left side of the bathroom counter",
                        "Put the candle on the counter just in front of the sink",
                        "Turn right and walk over to the bathtub",
                        "Pick up the left most candle from the bathtub",
                        "Turn around and walk back to the left sink",
                        "Put the candle down on the counter next to the other candle"
                    ],
                    "task_desc":"Put the candles on the bathroom counter",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Candle"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-Toilet-406/trial_T20190909_145737_829825/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2YUCJ28XANFOX_373ERPL3YRZMKVV0CS2TOKKJE8HRTH",
                    "high_descs":[
                        "cross the bathroom to the vanity",
                        "pick up the soap bottle sitting on the vanity beside the sink",
                        "cross over to the toilet",
                        "set the soap bottle on the back of the toilet",
                        "go back to the vanity and open the cabinet underneath it",
                        "take out a soap bottle from the cabinet",
                        "go back to the toilet ",
                        "set the soap bottle on the back of the toilet with the other soap bottle"
                    ],
                    "task_desc":"move both soap bottles to the back of the toilet ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SoapBar"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-Toilet-406/trial_T20190909_145919_337726/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A11IIS435RPN2O_3YJ6NA41JE77UFJGN6K0HJXVG3DPJO",
                    "high_descs":[
                        "Turn right take on step then turn right and go towards the counter.",
                        "Pick up the hand soap bottle from the counter.",
                        "Turn around take one step then turn right go to the end of the counter and then turn right at the corner of the counter.",
                        "Put the soap bottle on top of the toilet tank beside the green spray bottle.",
                        "Turn around walk to the end of the bathroom then turn left and walk towards the bath tub.",
                        "Pick up the hand soap bottle from the bath tub.",
                        "Turn around walk towards the door then turn right and go to the counter.",
                        "Put the Soap bottle on toilet tank behind the existing bottles."
                    ],
                    "task_desc":"Move the Soap bottles to the Toilet Tank.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-406/trial_T20190908_122840_498444/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3GGAI1SQEYPE1YGXLYBMDBQ5KIECMT",
                    "high_descs":[
                        "Turn right and walk over to the wall, then turn left and walk up to the tub.",
                        "Pick up the toilet paper roll off of the tub.",
                        "Walk over to the toilet and look down.",
                        "Put the toilet paper roll on the toilet paper holder that is on the wall to the left of the toilet."
                    ],
                    "task_desc":"Put a toilet paper roll on the toilet paper holder.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3LKC68YZ3DUBFZ7EF5Q0H9MD7Y5OWN",
                    "high_descs":[
                        "Turn right, walk to the wall, then turn left and walk up to the bathtub.",
                        "Pick up the roll of toilet paper that is sitting on the side of the bathtub. ",
                        "Turn around, walk all the way to the door, then turn right and walk up to the toilet.",
                        "Place the roll of toilet paper on the toilet paper holder on the wall next to the toilet."
                    ],
                    "task_desc":"Place a roll of toilet paper on the toilet paper holder.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3MAOD8E57T18MECSOVM9430FQQCXNG",
                    "high_descs":[
                        "walk to the sink",
                        "pick up the toilet paper from the counter",
                        "take the toilet paper over to the holder near the toilet",
                        "put the toilet paper on the holder."
                    ],
                    "task_desc":"get the toilet paper from the bathroom sink and put it on the toilet paper holder.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-406/trial_T20190908_122807_136741/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_30IQTZXKANX51IKLNPKBTR42IXIX0M",
                    "high_descs":[
                        "Turn left and walk to the sink. ",
                        "Pick up the toilet paper roll from the counter to the right of the sink. ",
                        "Walk to the toilet on the right and face the toilet paper dispenser on the wall to the left of the toilet. ",
                        "Put the toilet paper roll on the toilet paper dispenser. "
                    ],
                    "task_desc":"To move a toilet paper roll to the toilet paper dispenser. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_37U1UTWH9YD3MB3C9URYXOOW0ED8RS",
                    "high_descs":[
                        "Take two steps then turn left and walk to the counter. ",
                        "Pick up the toilet paper that is sitting to the right of the sink. ",
                        "Turn around and take one step, then turn right and walk across the room, then turn right to face the toilet. ",
                        "Put the toilet paper on the toilet paper holder on the wall to the left of the toilet."
                    ],
                    "task_desc":"Put the toilet paper away.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_378XPAWRUF44C0T8G5H3FNT036UIA2",
                    "high_descs":[
                        "walk forward a few steps, turn left, walk forward to the sink",
                        "pick up the toilet paper roll that is next to the sink",
                        "turn left, walk across the room, turn right to face the toilet",
                        "put toilet paper roll on the holder"
                    ],
                    "task_desc":"put toilet paper roll on the holder",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-Cabinet-406/trial_T20190909_145628_658348/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2DN53DIE3049T_3W8CV64QJ5QQBM8JIHLIJGH1XS4H9Y",
                    "high_descs":[
                        "Turn to the right, walk to the sink on the right",
                        "Pick up the perfume bottle from the sink",
                        "Turn to the right, walk to the cabinet under the sink",
                        "Open the cabinet, put the perfume bottle in it",
                        "Turn around, walk to the bath tub",
                        "Pick up the perfume bottle from the bath tub",
                        "Turn around, walk back to the sink",
                        "Open the cabinet, put the perfume bottle in it"
                    ],
                    "task_desc":"Collect perfume bottles, store under sink",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-406/trial_T20190907_183616_578160/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1AKL5YH9NLD2V_34YB12FSQ15JXLA4RCIO2GRIOL4GMU",
                    "high_descs":[
                        "Walk to the rag on the left side of the tub.",
                        "Pick up the leftmost rag in the tub.",
                        "Turn around and walk to the sink on the left.",
                        "Rinse the rag in the sink on the left and then pick up the rag from the sink.",
                        "Turn right and walk to the tub.",
                        "Place the rag in the middle of the tub."
                    ],
                    "task_desc":"Place a clean rag in the middle of the tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_36PW28KO42DKB65OOE2VTMB6HMFEA2",
                    "high_descs":[
                        "Walk towards the tub",
                        "Pick up the dirty cloth on the left side of the tub",
                        "Turn to your left and head to the sink ",
                        "Rinse the cloth on the sink with water",
                        "Turn right and head to the tub",
                        "Put the clean cloth on the left side of the tub"
                    ],
                    "task_desc":"Clean the dirty cloth put back on the tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_36V4Q8R5ZNHAAA4IU8N0WUVKU6LQM3",
                    "high_descs":[
                        "Go straight ahead to the bath tub.",
                        "Pick up the washcloth on the left side of inside the tub.",
                        "Take the washcloth and turn around. Find the sink on the right side.",
                        "Place the washcloth in the sink, on the left side and turn the water on. Turn the water off and pick up the washcloth.",
                        "Turn to the right and go back to the bath tub with the washcloth.",
                        "Place the washcloth in the bath tub, around the middle."
                    ],
                    "task_desc":"Rinse a washcloth and take it to the bath tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "SoapBottle",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-406/trial_T20190907_183646_891246/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_3QIYRE09Y6YSBO51LUCL88CCRMM1N6",
                    "high_descs":[
                        "turn around, walk to the tub",
                        "grab the dirty cloth in the tub",
                        "turn around, walk to the sink",
                        "put the cloth in the left sink, wash the cloth with water",
                        "turn right, walk to the tub",
                        "put the cloth in the tub"
                    ],
                    "task_desc":"wash the cloth from the tub in the sink, put it back in the tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_3TUI152ZZE4DELIT1M42C27HWXOQ1X",
                    "high_descs":[
                        "turn to the left and move forward towards the bath tub",
                        "take the dirty cloth out of the bath tub",
                        "turn around and move across the room and turn to the right and move toward the sinks",
                        "put the dirty cloth into the sink under the faucet on the left side of the sink, turn on the water to clean the cloth and remove the cloth from the sink",
                        "turn to the right and move to the bath tub",
                        "put the cloth back in to the bath tub"
                    ],
                    "task_desc":"put a clean cloth in to the bath tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3UNH76FOCVMJJCV4LI4U9GYMTH4MY8",
                    "high_descs":[
                        "Move to the tub to the left of the window",
                        "Pick up a rag from the tub",
                        "Move to the sink to the left",
                        "Clean the rag in the sink",
                        "Move to the tub to the left of the window",
                        "Put a rag in the tub"
                    ],
                    "task_desc":"Put a cleaned rag in the tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-Plunger-None-Cabinet-406/trial_T20190906_200314_364296/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_31QNSG6A5UALJ3XZ484BRLDU4FX87Z",
                    "high_descs":[
                        "Move to the toilet. ",
                        "Pick up the plunger from the ground. ",
                        "Bring the plunger to the sink.",
                        "Put the plunger in the cabinet under the sink. "
                    ],
                    "task_desc":"Put the plunger in the cabinet under the sink. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_32Q90QCQ1V2QNJEA05FKN0E2L3YEKF",
                    "high_descs":[
                        "Turn around to go to the toilet.",
                        "Pick up the plunger that is on the left side of the toilet.",
                        "Turn and go to the sink with the plunger.",
                        "Open the cabinet door under the left side under the sink.  Place the plunger in the front middle of the cabinet.  Shut the cabinet door."
                    ],
                    "task_desc":"Move the plunger to the cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3OVR4I9USS0U6KFCO4N4A0EK7J54QY",
                    "high_descs":[
                        "Turn right, walk to the door, turn right, walk to the toilet",
                        "Take the toilet plunger on the floor",
                        "Turn right and walk to the cabinet by the toilet",
                        "Open the cabinet, put the plunger in, close the cabinet"
                    ],
                    "task_desc":"Move the plunger from the floor to the cabinet by the toilet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Plunger"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-BathtubBasin-406/trial_T20190908_122630_364862/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3HMVI3QICMJU8CVDO4ADQAULPWY1YH",
                    "high_descs":[
                        "Go to the right and face the counter at the back of the tub.",
                        "Pick the soap up from the counter behind the tub.",
                        "Turn around and cross to face the sink.",
                        "Put the soap in the sink and turn the left faucet on and then off and pick up the soap again.",
                        "Turn around and go left to face the tub.",
                        "Put the soap in the tub."
                    ],
                    "task_desc":"Put a clean soap in the tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3PJUZCGDJ97XIB7QFDRC63O2UTQ89Q",
                    "high_descs":[
                        "Turn around and walk to the window then turn left and walk to the counter.",
                        "Pick up the pink bar of soap that's in front of you.",
                        "Turn around and walk until you're even with the middle of the sink that's on your right and turn right and walk to it when you are.",
                        "Get the bar of soap wet in the left sink and then pick it back up and shut off the water.",
                        "Turn around and take a step then turn left and walk to the tub.",
                        "Put the soap in the tub under the wash cloth and slightly to the left of it."
                    ],
                    "task_desc":"Put a wet bar of soap in the tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3LKC68YZ3DUBFZ7EF5Q0H9MD7Z7WOZ",
                    "high_descs":[
                        "Go to the right of the tub",
                        "Pick up the bar of soap",
                        "Go to the sink",
                        "Wash the soap with the left sink",
                        "Go to the tub",
                        "Put the soap in the tub"
                    ],
                    "task_desc":"Put a washed bar of soap in the tub",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cloth",
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-BathtubBasin-406/trial_T20190908_122722_722735/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_30OG32W0SX2ZGELBTQWHGEF8AL2ENR",
                    "high_descs":[
                        "Move to the right sink on the right, to the right cabinet under the sink.",
                        "Pick up the soap in the right cabinet under the sink. ",
                        "Bring the soap to the middle of the sink. ",
                        "Put the soap in the middle of the sink, turn on the water. ",
                        "Bring the soap to the tub on the left. ",
                        "Put the soap in the tub. "
                    ],
                    "task_desc":"Put a soap in the tub. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3L2IS5HSFD9G5AIXJQBMKW1BW93NUO",
                    "high_descs":[
                        "Turn right head to the sink cabinet",
                        "Open the cabinet below the sink on the right, pick up a soap then close it ",
                        "Move to the front then turn left move a little then turn right to the sink",
                        "Put the soap in the left side of the sink and rinse it",
                        "Turn right then head to the tub",
                        "Put the soap in the tub"
                    ],
                    "task_desc":"Put the clean soap in the tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3QXNC7EIPLMF0M2NK9EXDOIKBW409N",
                    "high_descs":[
                        "Turn to your right and walk towards the bathtub, then turn right at the second bathroom sink on your left. ",
                        "Open the cabinet under the right sink and remove the bar of soap inside. ",
                        "Move over to the sink on your left. ",
                        "Place the bar of soap in the sink, turn the water on, rinse the bar of soap off, turn the water off, and remove the bar of soap from the sink. ",
                        "Turn to your right and go to the bath tub across from you.",
                        "Place the bar of soap into the bath tub. "
                    ],
                    "task_desc":"Put a clean bar of soap in the bath tub. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-BathtubBasin-406/trial_T20190908_123913_183838/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_3WT783CTPE8II7C0U9LDZVFB8KICBE",
                    "high_descs":[
                        "Head towards the door ahead and walk to the sink on the right.",
                        "Open the lower left cabinet under the sink, pick up the bar of soap on the right and close the door.",
                        "Look up at the sink of the vanity.",
                        "Put the bar of soap inside the left sink, rinse it for a few seconds and pick it back up.",
                        "Turn around and walk to the tub on the left.",
                        "Put the rinsed bar of soap inside the tub in the middle area."
                    ],
                    "task_desc":"Place a rinsed bar of soap inside a tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_32VNZTT0AAV23AGAXR1LGC8RYTER43",
                    "high_descs":[
                        "Take two steps forward then turn right and walk to the sink.",
                        "Open the cabinet under the sink to your left and get the bar of pink soap that's on the right.",
                        "Look up at the sink.",
                        "Get the bar of soap wet in the sink and then pick it back up and shut off the water.",
                        "Turn around and take a step then turn left and walk to the tub.",
                        "Put the bar of soap in the tub near the wall that you're near."
                    ],
                    "task_desc":"Put a wet bar of soap in the tub.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3CPLWGV3MRQILIUULFGVO0EXJP6N9C",
                    "high_descs":[
                        "Turn to the right and face the sink.",
                        "Open the bottom left cabinet and take out a bar of soap.",
                        "Hold the bar of soap and look up.",
                        "Place the bar of soap in the sink and turn on the water. Turn of the water and pick up the soap.",
                        "Carry the soap and turn to the right to find the bath tub.",
                        "Place the soap inside the bath tub."
                    ],
                    "task_desc":"Rinse a bar of soap and place it in the bath tub.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Candle",
                "SoapBar"
            ]
        },
        "train/pick_and_place_simple-SoapBottle-None-Toilet-406/trial_T20190909_104251_851374/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_30LSNF239XMF7XY43QOO95A2RZDI24",
                    "high_descs":[
                        "Turn around and walk forward to the bottle of soap on the counter by the green towel.",
                        "Pick up the bottle of soap from the counter.",
                        "Turn around, walk forward to the door, then turn right and walk to the toilet.",
                        "Put the bottle of soap on the top of the toilet, behind the spray bottle."
                    ],
                    "task_desc":"Move a bottle of soap from a counter to the top of a toilet.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3CFJTT4SXWHMTYVA925J5WRA2F07IA",
                    "high_descs":[
                        "Turn around and cross the room to the area to the right of the bathtub",
                        "Pick up the soap bottle that is sitting to the right of the bathtub",
                        "Turn around and cross the room then make a right and walk to the counter top that is on the left of the sink",
                        "Place the bottle of soap on the back of the toilet to the right of the spray bottle"
                    ],
                    "task_desc":"Put a bottle of soap on the back of a toilet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_31QTRG6Q2W4XP4EF96L3R6CJSSVPYW",
                    "high_descs":[
                        "Walk over to the right side of the tub.",
                        "Pick up the bottle of soap off of the tub.",
                        "Walk over to the left side of the sink counter.",
                        "Put the bottle of soap on the toilet tank that is to the left of the counter."
                    ],
                    "task_desc":"Move a bottle of soap to the toilet tank.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-SoapBottle-None-Toilet-406/trial_T20190909_104226_709618/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3NXNZ5RS1DOTIX2758Z6S3S7JPN973",
                    "high_descs":[
                        "Take a step to your right then walk to the sink.",
                        "Open the cabinet under the left side of the left sink and grab the bottle of liquid soap under there then close the door.",
                        "Take a small step backwards then a step to your left.",
                        "Put the soap on the back of the toilet."
                    ],
                    "task_desc":"Put liquid soap on the toilet.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2AWDI13UN5SBU_3VSOLARPKE0BHE1K3WWGFMGRENV93S",
                    "high_descs":[
                        "Head toward the sink across the room.",
                        "Open the left-side cabinet under the sink and take out the bottle of soap.",
                        "Turn to the left and head toward the toilet on the right.",
                        "Put the bottle of soap on top of the toilet next to the spray bottle."
                    ],
                    "task_desc":"Put a bottle of soap on top of a toilet.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3R2PKQ87NZZ5E12XD878OEO0X43IM4",
                    "high_descs":[
                        "go to the sink",
                        "pick up the pump bottle from the counter",
                        "take the bottle to the toilet",
                        "put the bottle on the back of the toilet"
                    ],
                    "task_desc":"take the pump bottle from the sink to the toilet",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "Plunger",
                "ToiletPaper",
                "SoapBar"
            ]
        },
        "train/pick_and_place_simple-SoapBottle-None-Toilet-406/trial_T20190909_104206_052441/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CY7IOJ9YH136_338JKRMM29Q4G5IOANZIFBSL397AHP",
                    "high_descs":[
                        "go to counter to the left of sink with toilet paper",
                        "pick up bottle from behind toilet paper on counter",
                        "go to toilet to the left",
                        "place bottle on center of toilet tank"
                    ],
                    "task_desc":"place bottle on toilet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3EFE17QCRFW8G14IRNL90BMRPFGHSU",
                    "high_descs":[
                        "Take a small step to your left then walk forward to the counter.",
                        "Pick up the pump bottle of soap that's by the wall.",
                        "Back up a small amount.",
                        "Put the soap on the back of the toilet."
                    ],
                    "task_desc":"Put a soap dispenser on the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3EO896NRAZM5M7CN4NTKMTYS4Q6JTY",
                    "high_descs":[
                        "Walk forward to the counter.",
                        "Pick up the soap bottle on the counter.",
                        "Take a step left.",
                        "Place the bottle on the toilet tank lid, to the left of the soaps."
                    ],
                    "task_desc":"Place a soap bottle on a toilet tank lid.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SprayBottle"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Toilet-406/trial_T20190908_102552_835735/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3GU1KF0O4LS1CWL4ZE7JJVEI72HBP9",
                    "high_descs":[
                        "Turn  left and walk up to the left sink",
                        "Open the left cabinet below the left sink and remove the dirty rag",
                        "Walk slightly right then turn back left to face the left sink",
                        "Wash the rag in the sink and remove it",
                        "Turn left and walk over to the toilet left of the counter",
                        "Put the rag on top of the back of the toilet"
                    ],
                    "task_desc":"Put the washed rag on the toilet",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OB0CAO74KG5CNGRQTDYIXAS6KDHYD",
                    "high_descs":[
                        "Turn around and walk towards the tub, then turn left and walk up to the counter.",
                        "Open the leftmost cabinet door below the counter and take out the dirty rag, then close the cabinet door.",
                        "Turn right and walk forward, then turn left to face the sink.",
                        "Put the dirty rag in the left side of the sink and turn on the water, after a couple seconds turn the water off and remove the now clean rag.",
                        "Walk over to the toilet that is to the left of the counter.",
                        "Put the clean rag on top of the toilet tank."
                    ],
                    "task_desc":"Put a clean rag on the toilet tank.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3T9K2RY06UO14_3U0SRXB7CGWOPIQGFWGHFLERP95RNS",
                    "high_descs":[
                        "Turn and go to the sink.",
                        "Take a rag out of the cabinet under the sink.",
                        "Turn and go to the sink.",
                        "Wash the rag in the sink. ",
                        "Turn and go to the toilet",
                        "Put the rag on the toilet."
                    ],
                    "task_desc":"Move a washed rag to the toilet.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Toilet-406/trial_T20190908_102735_461565/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3IAEQB9FMHBKB2GPPWCK6FAE3KBDWS",
                    "high_descs":[
                        "Turn around and go to the bathroom sink.",
                        "Open the cabinet under the left sink and take out the dirty rag.",
                        "Move towards the right of the sink. ",
                        "Wash the towel in the left sink under running water and take it out.",
                        "Turn left and go to the right side of the toilet.",
                        "Place the rag on the top of the toilet tank."
                    ],
                    "task_desc":"Put the washed rag on the top of the toilet tank.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3OVHNO1VE9SO5XLU0JWR5J4WKMLZDA",
                    "high_descs":[
                        "Turn around and locate the sink.",
                        "Open the cabinet below the sink and pick up the cloth.",
                        "Hold the cloth and look around.",
                        "Place the cloth in the sink and turn on the water. Turn off the water and pick up the cloth.",
                        "Carry the cloth and take a step to the left.",
                        "Place the cloth on the tank of the toilet."
                    ],
                    "task_desc":"Rinse a cloth and put it on the toilet tank.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3YJ6NA41JE77UFJGN6K0HJXVFK7JP9",
                    "high_descs":[
                        "Turn around and walk to the left sink on the vanity.",
                        "Open the left cabinet under the sink, pick up the dirty towel inside and close the door.",
                        "Turn right and walk to the middle of the two sinks on the vanity.",
                        "Put the dirty towel inside the left sink, rinse it off and pick it back up.",
                        "Turn around, take a right and walk to the counter next to the white toilet.",
                        "Put the clean towel on the right side of the toilet tank."
                    ],
                    "task_desc":"Place a clean towel on a toilet tank.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Toilet-406/trial_T20190908_102709_492098/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_35USIKEBNU7V3ZSWN8DJ4QNVTMFN6E",
                    "high_descs":[
                        "Turn to the left, and then right to go to the sink.",
                        "Open the bottom left cabinet below the sink. Pick up the cloth from inside and shut the door.",
                        "Hold the cloth and look up at the sink.",
                        "Place the cloth in the sink and turn on the water. Turn off the water and pick up the cloth.",
                        "Carry the cloth and take a step to the left, look up to the mirror.",
                        "Place the cloth on the back of the toilet."
                    ],
                    "task_desc":"Rinse a cloth and place it on the toilet tank.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A35C0II2FFV18S_3NXNZ5RS1DOTIX2758Z6S3S7J8A97S",
                    "high_descs":[
                        "Turn to the right, turn to the left and head to the left part of the sink",
                        "Open the cabinet door, remove the dirty cloth from inside and close the door.",
                        "Move slightly to the right and face the middle of the sink",
                        "Place the cloth on the left side of the sink, turn on the water to fill the sink and remove the cloth when it is clean.",
                        "Turn right three times and head to the toilet at the end of the sink",
                        "Place the cloth on top of the toilet's water tank."
                    ],
                    "task_desc":"Place a cleaned cloth on top of the toilet's water tank",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_37Z929RLGCZYLAVDRH2YEUPF0T4TSD",
                    "high_descs":[
                        "Walk ahead to the left basin of the sink.",
                        "Take the rag out of the cabinet on the bottom left.",
                        "Walk right a step.",
                        "Wash the towel in the sink.",
                        "Take a few steps left.",
                        "Place the rag on top of the toilet tank."
                    ],
                    "task_desc":"Place a clean rag on a toilet tank.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-ToiletPaper-None-CounterTop-406/trial_T20190909_060814_395978/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3M1CVSFP63WHTYHRTDMCOPKMUP3QAN",
                    "high_descs":[
                        "turn right and walk to the toilet paper holder, and look at the floor below it. ",
                        "Pick up the empty roll of toilet paper from the floor. ",
                        "Walk over to the left side of the counter. ",
                        "Put the empty roll in front of the sink. ",
                        "Walk over to the tub. ",
                        "Pick up the roll of toilet paper from the back corner of the tub. ",
                        "Walk back over to the left side of the counter. ",
                        "Put the toilet paper roll to the left of the sink on the counter. "
                    ],
                    "task_desc":"To move a full and empty roll of toilet paper to the sink. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3WETL7AQWWZSGRZ806JZ36BPSJM35P",
                    "high_descs":[
                        "walk to face toilet",
                        "pick up toilet roll from ground to the left of toilet",
                        "walk to face sink",
                        "put toilet roll on counter next to sink",
                        "walk to face top of bath tub",
                        "pick up toilet paper from tub edge",
                        "walk to face sink",
                        "put toilet paper on counter next to sink"
                    ],
                    "task_desc":"put toilet roll and paper on sink counter",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_two_obj_and_place-Cloth-None-BathtubBasin-406/trial_T20190907_125825_765067/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A23HZ18KTCK2DA_3L4PIM1GQWXAGS8WQQ0BVFSWZ1XRYP",
                    "high_descs":[
                        "Turn and go to the right side of the tub.",
                        "Pick up the wash rag that is on the right side of the tub.",
                        "With the wash rag in hand turn and go to the center of the tub.",
                        "Place the wash rag in the center of the tub.",
                        "Turn and go to the sink.  ",
                        "Open the cabinet on the right under the sink. Grab the wash rag. Shut the cabinet door.",
                        "Turn and go to the center of the bath tub with the wash rag.",
                        "Place the wash rag to the left of the wash rag that is already in the tub."
                    ],
                    "task_desc":"Put wash rags in the tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-Cloth-None-BathtubBasin-406/trial_T20190907_125806_237559/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3T9K2RY06UO14_3OCHAWUVGR1ZTJ5RVA5CBPZ92YSXK5",
                    "high_descs":[
                        "Turn around and go to the sink.",
                        "Pick up a dirty towel from the counter.",
                        "Turn and go to the bathtub. ",
                        "Put the dirty towel in the bathtub. ",
                        "Turn right and go to the counter by the bathtub.",
                        "Pick up a dirty towel from the counter. ",
                        "Turn left and go to the bathtub.",
                        "Put the dirty towel in the bathtub. "
                    ],
                    "task_desc":"Move dirty towels to the bathtub. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-Cloth-None-BathtubBasin-406/trial_T20190907_125848_021769/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2JBNDG0U9IA6I_39GXDJN2OWVNUTYVM67RXZTXRLP8VP",
                    "high_descs":[
                        "Walk straight towards the tub and face the right end of it",
                        "Pick up a tissue from the tub top",
                        "Turn to the left and face the middle of the tub",
                        "Place the tissue in the bottom of the tub",
                        "Turn to the right and face the right end of the tub",
                        "Pick up a tissue from the tub top",
                        "Turn to the left and face the middle of the tub",
                        "Place the tissue in the bottom of the tub"
                    ],
                    "task_desc":"Collecting tissues to put in the bath tub",
                    "votes":[
                        1,
                        1,
                        0,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1Y5WTDFRII0EJ_3PW9OPU9PT1WM2G8ZBE1GK9EGH4124",
                    "high_descs":[
                        "Walk forward to tub.",
                        "Pick up tissue closest to tub rim.",
                        "Turn left walk to middle of tub then right.",
                        "Drop tissue in tub.",
                        "Turn right walk to wall then left at counter.",
                        "Pick up tissue closest to rear wall.",
                        "Turn left walk to middle of tub then right.",
                        "Drop tissue in tub."
                    ],
                    "task_desc":"Pick up tissues, drop them in the tub.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        0,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-Candle-None-Cabinet-406/trial_T20190908_165628_335781/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1E0WK5W1BFPWR_3GNA64GUZHVKNS5AYHVVGE4027EQ5L",
                    "high_descs":[
                        "Turn to the left and move towards the counter left of the sink.",
                        "Pick up the candle off the counter.",
                        "Turn around to back up from the counter and turn around again to face the cupboard underneath the counter.",
                        "Place the candle inside the cupboard.",
                        "Turn to the left and move toward the toilet on the right.",
                        "Pick up the candle on the middle of the toilet tank.",
                        "Turn around and move toward the cupboard beside the toilet.",
                        "Place the candle inside the cupboard."
                    ],
                    "task_desc":"Organize some of the candle sticks into the cupboard under the counter.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Candle",
                "ToiletPaper",
                "HandTowel",
                "Plunger",
                "ScrubBrush",
                "SoapBar",
                "SoapBottle",
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-406/trial_T20190907_015923_805044/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3S3AMIZX3XM3CFOMCXN2TZJ9G9HDCJ",
                    "high_descs":[
                        "Go to the sink behind you.",
                        "Take the soap bar nearest to you.",
                        "Take the soap bar to the sink next to you.",
                        "Wash the soap bar in the sink.",
                        "Take the soap bar to the trash bin to your right.",
                        "Place the soap bar in the trash bin."
                    ],
                    "task_desc":"Place a washed soap bar in the trash.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3SITXWYCNYQY0G1XPXSJCMGJEADXBQ",
                    "high_descs":[
                        "Move to the sink.",
                        "Pick up the soap in the back by the sink. ",
                        "Bring the soap to the sink.",
                        "Put the soap in the middle of the sink, turn on the water, keeping the soap dry. ",
                        "Pick up the soap and bring it to the trash can.",
                        "Put the soap in the trash can. "
                    ],
                    "task_desc":"Put a soap in the trash can. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3Z4XG4ZF4B8FYI3QML89LKQI623X8Y",
                    "high_descs":[
                        "Turn left and left, walk to the side of the vanity",
                        "Grab the pink sponge in the back",
                        "Turn left and walk to in between the two sinks",
                        "Put the pink sponge in between the two sinks, turn on the faucet on the left, turn off the faucet, take the sponge",
                        "Turn right, walk to the trash bin",
                        "Put the sponge in the trash bin"
                    ],
                    "task_desc":"Take the pink sponge near the mirror, wash it in the sink, put the sponge in the trash bin",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-406/trial_T20190907_015904_010057/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A10LHOXLUO2WBA_3JBT3HLQFBJP952M9KY54R1J3EWZPG",
                    "high_descs":[
                        "Looks down at the toilet moves right towards the sink",
                        "Picks up the soap from the sink",
                        "turns left then moves forward and turns right to the tap",
                        "places the soap on the sink and turns on the tap, then put it off\n\n\n",
                        "Moves right and left and searches for the waste bin",
                        "drops the soap on the waste bin and dispose it"
                    ],
                    "task_desc":"The ro",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3S3AMIZX3XM3CFOMCXN2TZJ9GCACDH",
                    "high_descs":[
                        "Turn right and walk to the tub in front of you.",
                        "Take the soap from in the tub.",
                        "Turn around and go to the sink to the right.",
                        "Wash the soap in the left sink.",
                        "Turn to the right and go to the trash bin by the tub.",
                        "Put the soap in the trash bin."
                    ],
                    "task_desc":"Put clean soap in the trash bin.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3T3IWE1XG94EN5U235OCI8QCNEGQT2",
                    "high_descs":[
                        "Turn right and head towards the bath tub.",
                        "Pick up the pink bar soap from the tub.",
                        "Turn around and head towards the sink on your left.",
                        "Place the bar soap on the left sink, rinse it, and pick it back up .",
                        "Turn right and head towards the bin in front of the bath tub.",
                        "Place the bar soap inside the bin."
                    ],
                    "task_desc":"Rinse the bar soap from the tub to place it in a bin.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-406/trial_T20190907_015846_164761/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A002160837SWJFPIAI7L7_3IUZPWIU1ROK4J01L59Q96L2SZSWKM",
                    "high_descs":[
                        "Turn around and walk to the right side of the sink.",
                        "Pick up the soap from the right side of the sink.",
                        "Turn left and walk to the face the middle of the sink.",
                        "Rinse the soap off in the sink. ",
                        "Turn left and walk to the trash can.",
                        "Place the soap in the trash can."
                    ],
                    "task_desc":"Place the rinsed off soap into the trash can.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3N4BPTXIOB97CFBWQ5UPRI057IBUKD",
                    "high_descs":[
                        "Turn around and move to the sink.",
                        "Pick up the bar of soap to the right of the sink.",
                        "Turn left and move towards the toilet then turn right and face the sink.",
                        "Place the bar of soap in the left side sink, turn on the faucet, turn off the faucet, and pick up the bar of soap from the sink.",
                        "Turn around, move towards the window, then turn left and move towards the bathtub.",
                        "Place the bar of soap into the rubbish bin in front of the bathtub."
                    ],
                    "task_desc":"Place a rinsed bar of soap into the rubbish bin.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3QECW5O0KKIPUJB4JD09KXVLRD1T5Q",
                    "high_descs":[
                        "Turn around and walk to the sink.",
                        "Pick up the pink soap.",
                        "Take a step left.",
                        "Wash the soap in the left sink.",
                        "Turn right and walk towards to the trash can.",
                        "Place the soap in the trash can."
                    ],
                    "task_desc":"Place a washed bar of soap in a trash can.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "valid_seen/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-406/trial_T20190908_122858_883968/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3DH6GAKTY1GR38GLWFJ5I4EX2BOYZG",
                    "high_descs":[
                        "Turn left and then left again to stand in front of the tub.",
                        "Pick the empty toilet paper roll up from the side of the tub.",
                        "Turn around and cross the room and then go right to face the toilet paper holder on the wall to the left of the toilet.",
                        "Put the empty roll on the toilet paper holder."
                    ],
                    "task_desc":"Put an empty toilet paper roll on a toilet paper holder.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3Q5C1WP23PSW6OLTD25GFDWSURV516",
                    "high_descs":[
                        "Turn left keeping the black door on your right and go to the sink across the room from it.",
                        "Pick up the toilet paper roll in the sink.",
                        "Turn around and go towards the black door turning right to get to the toilet.",
                        "Put the toilet paper roll on the hanger next to the toilet on the left."
                    ],
                    "task_desc":"Pick up the toilet paper roll and put it by the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3RWE2M8QWK10PO6HLJX2VPD4GK80N7",
                    "high_descs":[
                        "Turn around and go across the bathroom to the bathtub. ",
                        "Pick up the empty toilet paper roll on the edge of the bathtub. ",
                        "Turn back around and go to the toilet paper holder, on the wall, to the left of the toilet. ",
                        "Place the empty toilet paper roll on the toilet paper holder, hanging from the wall."
                    ],
                    "task_desc":"Put an empty toilet paper roll on the toilet paper dispenser. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper",
                "Cloth"
            ]
        },
        "valid_seen/pick_and_place_simple-Plunger-None-Cabinet-406/trial_T20190906_200341_074379/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AKW57KYG90X61_32KTQ2V7RGW4IBNWD6CEAZ5VJ2X9M7",
                    "high_descs":[
                        "turn right towards the door and then right towards the water closet",
                        "pick up the plunger by the water closet ",
                        "turn right towards the cupboard under the wash",
                        "put the plunger inside the cupboard "
                    ],
                    "task_desc":"put the plunger inside the cupboard",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3RXCAC0YIU64CW80XB85XYQN3CQ8G0",
                    "high_descs":[
                        "Turn around and walk over to the toilet",
                        "Pick up the plunger from the left side of the toilet",
                        "Turn right and walk up to the left side of the bathroom counter",
                        "Open the bottom left cabinet and put the plunger in it"
                    ],
                    "task_desc":"Put the plunger into the bathroom cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3TXMY6UCAH5X1OSRHJTMTYQ8ZPZQCW",
                    "high_descs":[
                        "Move over to the toilet.",
                        "Pick up the plunger next to the toilet. ",
                        "Bring the plunger over to the cabinet under the sink.",
                        "Put the plunger in the cabinet. "
                    ],
                    "task_desc":"Put the plunger in the cabinet. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plunger"
            ]
        },
        "tests_seen/trial_T20190906_200329_245495/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right, head towards the wall, and then turn right to face the toilet.",
                        "Pick up the plunger on the floor.",
                        "Take a few steps to the right to face the sink.",
                        "Open the cabinet below the sink and place the plunger in it."
                    ],
                    "task_desc":"Place the toilet plunger in the cabinet below the sink."
                },
                {
                    "high_descs":[
                        "Turn right and walk towards the toilet",
                        "Take the plunger with your hand",
                        "Take the plunger towards the vanity dresser",
                        "Set the plunger inside the dresser drawer"
                    ],
                    "task_desc":"Take the plunger set it inside the dresser drawer "
                },
                {
                    "high_descs":[
                        "Turn right and walk over to the toilet and face it.",
                        "Pick up the plunger to the left of the toilet.",
                        "Walk over to the sink so you are slightly to the left of it and face it.",
                        "Open the cupboard under the sink and place the plunger in it before closing it again."
                    ],
                    "task_desc":"Place a plunger in a cabinet."
                }
            ],
            "relative_objects":[
                "Plunger"
            ]
        },
        "tests_seen/trial_T20190909_060729_595106/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and move toward the wall, then turn right to face the toilet.",
                        "Take the empty toilet paper roll from the back of the toilet.",
                        "Turn right and move forward, then turn left to face the counter adjacent to the toilet.",
                        "Put the empty toilet paper roll on the counter.",
                        "Turn around, go to the wall, then turn right to face the toilet.",
                        "Take the toilet paper roll from the hook on the wall.",
                        "Turn right and move forward, then turn left to face the counter adjacent to the toilet.",
                        "Put the toilet paper roll on the counter, in front of the sink."
                    ],
                    "task_desc":"Move a toilet paper roll and an empty toilet paper roll to the counter."
                },
                {
                    "high_descs":[
                        "Turn left, then turn right step up towards the door and then turn right and face the toilet.",
                        "Pick up the roll from the back of the toilet.",
                        "Turn right then turn left and face the counter",
                        "Place the roll onto the counter above the soap to the left.",
                        "Turn right, then turn left, then turn right again walk towards the walk turn right again and face the toilet.",
                        "Take the toilet paper off of the toilet paper holder.",
                        "Turn right then turn left walk toward the counter",
                        "Place the toilet paper next to the soap on the right."
                    ],
                    "task_desc":"To add the roll and the toilet paper onto the counter"
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "tests_seen/trial_T20190909_060702_609931/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "walk to face trash bin on floor",
                        "pick up toilet paper from bin",
                        "walk to face left side of sink",
                        "put toilet paper on counter to left of sink",
                        "walk to face left side of toilet",
                        "pick up toilet roll on left of toilet",
                        "walk to face left side of sink",
                        "put toilet roll on counter to left of sink"
                    ],
                    "task_desc":"put toilet paper and roll on sink counter"
                },
                {
                    "high_descs":[
                        "turn and walk to the bin next to the tub. ",
                        "Pick up the roll of toilet paper from the bin. ",
                        "Turn left and walk to the left side of the sink. ",
                        "Put the roll down on the front edge of the sink. ",
                        "Move to face the toilet paper holder to the left of the toilet and look at the floor below. ",
                        "Pick up the empty roll on the floor. ",
                        "Turn right and walk back over to the left side of the counter. ",
                        "Put the empty roll down on the counter to the left of the full roll. "
                    ],
                    "task_desc":"To move a full roll and an empty roll of toilet paper to the sink counter. "
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        }
    }
}