{
    "scene_name":"FloorPlan201",
    "trials":{
        "train/pick_two_obj_and_place-Newspaper-None-Sofa-201/trial_T20190918_190347_937339/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3QY5DC2MXU1WWTJIPU3SB580ZCCFUU",
                    "high_descs":[
                        "Turn around and walk to the table that is in the middle of the room in front of you",
                        "Pick up the newspaper that is on the second shelf.",
                        "Walk over to the couch that is in front of you",
                        "Place newspaper on the right couch cushion",
                        "Turn around and walk to the TV that is directly in front of you",
                        "Pick up the newspaper that is on the bottom shelf",
                        "Turn around and walk to the couch that is in front of you",
                        "Place newspaper on the right couch cushion above the newspaper that's already there."
                    ],
                    "task_desc":"Place newspapers on a couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/pick_two_obj_and_place-Newspaper-None-Sofa-201/trial_T20190906_190045_063430/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A17TKHT8FEVH0R_3LYA37P8IT4SGG2QQEDUMS8HIY3KBN",
                    "high_descs":[
                        "Turn right and walk to the front of the sofa and face the table",
                        "Grab the newspaper that is on the table",
                        "Turn around and face the sofa",
                        "Place the newspaper on the sofa",
                        "Turn left and walk around the sofa and face the dinner table behind it",
                        "Grab the newspaper that is on the dinner table.",
                        "Turn left and walk around the sofa and face the front of the sofa",
                        "Place the newspaper on top of the other newspaper"
                    ],
                    "task_desc":"Placing newspaper onto the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3YW4XOSQKT256EPAIVO7M346YFH1UT",
                    "high_descs":[
                        "Turn right, go to the side of the coffee table closest to the couch.",
                        "Pick up the newspaper on the coffee table.",
                        "Turn around to face the couch.",
                        " Put the newspaper on the couch close to the edge and between the pillow and the computer.",
                        "Go around to behind the couch and face the dining table.",
                        "Take the newspaper from the dining table.",
                        "Turn around, go around to the front of couch and face the couch.",
                        "Put the newspaper above the other newspaper next to the computer."
                    ],
                    "task_desc":"Put the newspapers on the couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Sofa",
                "Newspaper"
            ]
        },
        "train/pick_and_place_simple-Bowl-None-CoffeeTable-201/trial_T20190907_171714_885383/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3G2UL9A02GVYFPEBBT7D77H3ZIE76G",
                    "high_descs":[
                        "Turn right and walk to the TV.",
                        "Pick up the bowl from the TV stand.",
                        "Turn around and face the coffee table.",
                        "Set the bowl down on the coffee table."
                    ],
                    "task_desc":"Set the bowl on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3JMSRU9HQLB43U8MZ9TRP9PJ2YREVI",
                    "high_descs":[
                        "Turn to your right and walk to the chair at the end of the room, then turn right again and go to the TV. ",
                        "Pick up the grey bowl on the left corner of the entertainment stand. ",
                        "Turn around and walk to the right side of the coffee table. ",
                        "Place the grey bowl on the left side of the yellow vase, on the coffee table. "
                    ],
                    "task_desc":"Place a grey bowl next to the yellow vase, on the coffee table. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3M81GAB8A30ERJ0L3JXRIEKQIA9QBC",
                    "high_descs":[
                        "Cross the room and go to the right to face the television.",
                        "Pick the gray bowl up from in front of the television.",
                        "Turn around to face the glass and black table.",
                        "Put the bowl down on the table."
                    ],
                    "task_desc":"Put a table on a bowl.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Vase"
            ]
        },
        "train/pick_and_place_simple-Bowl-None-CoffeeTable-201/trial_T20190907_171756_784651/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_39DD6S19JSSLCEDW06IUAF2FQ6JZEJ",
                    "high_descs":[
                        "Turn right, walk across the room to the side table to the right of the dining table, and face the side table. ",
                        "Pick up the white bowl to the left of the sculpture.",
                        "Turn right and walk around the couch to the glass coffee table. ",
                        "Place the bowl on the coffee table behind the plate. "
                    ],
                    "task_desc":"To move a bowl from the side table to the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3F6HPJW4JGHPN3WBWZ3M9AZ8C2AW2B",
                    "high_descs":[
                        "Turn right and walk to the small black table which is against the wall.",
                        "Pick up the bowl from the table.",
                        "Turn around and walk around the dining table to the coffee table by the sofa.",
                        "Put the bowl on the top of the coffee table."
                    ],
                    "task_desc":"Move a bowl from a small table to a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3QY5DC2MXU1WWTJIPU3SB5800PHUF5",
                    "high_descs":[
                        "Turn right and begin walking cross the room, then hang a left and walk over to the small black table against the wall.",
                        "Pick up the grey bowl that is on the small black table.",
                        "Turn right and start walking across the room, then hang a right and walk over to the chair in the corner of the room, hang a right before you get there and walk up to the glass coffee table.",
                        "Put the grey bowl on the coffee table near the middle."
                    ],
                    "task_desc":"Move a grey bowl to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CoffeeTable",
                "SideTable"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-CoffeeTable-201/trial_T20190908_192028_568473/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1M682B2WUSYJP_3HVVDCPGTHJVHW7MQNUNWGDGHDBYT5",
                    "high_descs":[
                        "Turn right, walk forward one step, then turn left to face the table. ",
                        "Pick up the credit card from the table.",
                        "Place the card in the bowl.",
                        "Pick up the bowl with the card. ",
                        "Turn right, walk across the room, turn right again, walk to the chair, then turn right and walk until you hit the table.",
                        "Place the bowl on the table. "
                    ],
                    "task_desc":"Move the bowl and the credit card to the coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3UXUOQ9OKHO7NGCCXED6OY3RPQ4A7K",
                    "high_descs":[
                        "Turn and go to the right side of the table you are currently facing.",
                        "Pick up the red credit card that is on the table.",
                        "Place the credit card in the grey bowl that is in front of you on the table.",
                        "Pick up the bowl with the credit card in it.",
                        "With the bowl with the credit card in hand turn and go to the coffee table with the couch on your left side face the coffee table.",
                        "Place the bowl with the credit card behind the object that is on the left side."
                    ],
                    "task_desc":"Move bowl with credit card to coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3JC6VJ2SAEAS0CYT9LY9QEPVYK5A51",
                    "high_descs":[
                        "Take a step ahead and right.",
                        "Pick up the red credit card.",
                        "Place the credit card in the bowl.",
                        "Pick up the bowl.",
                        "Turn right and walk to the garbage, then turn right again. Walk to the chair in the corner then turn right and walk to the coffee table.",
                        "Place the bowl on the coffee table to the left of the tissues."
                    ],
                    "task_desc":"Place a bowl with a credit card in it on a coffee table.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Bowl-CoffeeTable-201/trial_T20190908_192000_302714/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1K5ILJMG439M5_354P56DE9NUBNCY6EEZX9YXXBWJS76",
                    "high_descs":[
                        "Cross the room between the back of the couch and the table, then face the black table with the yellow lamp on it.",
                        "Pick up the closest red credit card to you from on the table.",
                        "Turn to your right and go between the dining table and the wall, then face the table.",
                        "Put the credit card in the gray bowl on the table.",
                        "Pick up the bowl from the table top.",
                        "Bring the bowl with you and turn left and make your way around the couch, move to face the coffee table.",
                        "Put the bowl down on the table to the left of the tissues."
                    ],
                    "task_desc":"Put a bowl with a credit card on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_379J5II41R79SEIQHDG23MBJ5OLEL4",
                    "high_descs":[
                        "Walk to the dresser on the other side of the room.",
                        "Grab a card from the dresser.",
                        "Walk around to the dining table on the left side.",
                        "Place the card in a bowl.",
                        "Grab the bowl with the card.",
                        "Go to the coffee table in front of the sofa.",
                        "Place the bowl in the middle of the table."
                    ],
                    "task_desc":"Put a card in a bowl and move them to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3HYA4D452UAVX6WE2II368XABQMF2D",
                    "high_descs":[
                        "Go to the lamp table",
                        "Pick up a credit card from the table",
                        "Go to the large main table",
                        "Put the credit card in a bowl on the large main table",
                        "Pick up the bowl with the credit card in it",
                        "Move to the glass table",
                        "Put the bowl on the glass table"
                    ],
                    "task_desc":"Move a credit card and bowl to a different table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "train/pick_two_obj_and_place-Plate-None-CoffeeTable-201/trial_T20190918_172828_710071/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1K5ILJMG439M5_3TXWC2NHN277G601X380M841CCS9S3",
                    "high_descs":[
                        "Turn right and go between the dining table and the black console table, then turn left to face the dining table.",
                        "Pick up the leftmost white plate from the table.",
                        "Bring the plate with you and cross the room, then face the glass coffee table in front of the sofa.",
                        "Put the plate down on the bottom platform of the coffee table.",
                        "Go back to the same spot at the dining table and turn left to face it again.",
                        "Pick up the white plate closest to the table's edge.",
                        "Bring the plate with you and move back to the glass coffee table.",
                        "Put the plate down on the top part of the table in the center."
                    ],
                    "task_desc":"Move some plates to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Plate-SideTable-201/trial_T20190911_041620_392517/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3MAOD8E57TR01PQUSNXS3HGDW71XN6",
                    "high_descs":[
                        "Walk straight towards the door and turn left towards the black table on your right.",
                        "Pick up the watch on the right side of the table.",
                        "Turn around to face the dining table.",
                        "Place the watch on the white plate to the left of the book.",
                        "Pick up the plate with the watch from the table.",
                        "Turn right, take a step forward, and then turn right to face the black table.",
                        "Place the plate to the left of the tissue box."
                    ],
                    "task_desc":"Place the watch on the table on a white plate.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2V35L3RIRYYXV_3QECW5O0KKIPUJB4JD09KXVLSSGT50",
                    "high_descs":[
                        "Walk forward, cross the room, turn left. Walk forward, turn right to face the black table along the wall.",
                        "Pick up the watch on the right side of the table.",
                        "Turn around to face the glass table.",
                        "Place the watch on the white plate to the left of the painting.",
                        "Pick up the watch and plate on the table.",
                        "Turn around to face the black table.",
                        "Place the plate and watch on the black table to the left of the tissue box."
                    ],
                    "task_desc":"Place a watch and a plate on the black table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2ALWT2BUSXD83_3TVSS0C0E4HJ72QOFENIAX8YCP8TW5",
                    "high_descs":[
                        "Walk across the room to the black table against the wall.",
                        "Pick up the watch from the table.",
                        "Turn around and approach the rectangular table.",
                        "Place the watch on a white plate on the table.",
                        "Pick up the white plate on the table.",
                        "Turn around and approach the black table.",
                        "Place the plate on the left side of the black table."
                    ],
                    "task_desc":"Place a plate with a watch on it on the black table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Plate-SideTable-201/trial_T20190908_025806_491499/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_30MVJZJNHPUEH3HBA9ZMU7DEGMM9JG",
                    "high_descs":[
                        "Walk around the left side of the couch to face the left side of the living room table.",
                        "Pick up the watch on the living room table.",
                        "Walk past the right side of the couch and turn left to face the end of the table.",
                        "Put the watch on the plate on the table.",
                        "Pick up the plate with a watch on it on the table.",
                        "Walk straight past the left side of the table and turn left to face a black end table.",
                        "Place the plate with a watch on it on the black end table."
                    ],
                    "task_desc":"Place a watch on a plate as well as place it on the black end table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ACSS93E03ZUGX_3JCG6DTRV671VP2AM1UHD3FP4HHQQ9",
                    "high_descs":[
                        "Turn left then right to go around the sofa and face the end of the glass coffee table.",
                        "Pick up the watch off of the coffee table.",
                        "Turn around then go to the left then to the left again to face the end of the glass dining table.",
                        "Place the watch on the white plate.",
                        "Pick up the plate with the watch on it.",
                        "Turn left then right to walk behind the sofa and face the end of the black lamp table.",
                        "Place the white dish on the table."
                    ],
                    "task_desc":"Place the white dish with the watch on it on the black lamp table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3PIWWX1FJMN3NFUKWLQZJ1RHCYNJJO",
                    "high_descs":[
                        "Walk to the glass coffee table.",
                        "Grab the watch off the table.",
                        "Walk to the edge of the dining table.",
                        "Place the watch on the plate.",
                        "Grab the plate with the watch on it.",
                        "Walk to the small table in front of the curtains.",
                        "Place the plate and watch on the table."
                    ],
                    "task_desc":"Place a watch on a plate to present it on a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-Vase-Box-DiningTable-201/trial_T20190907_052958_989613/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A16184N1RO5OJV_3TE3O85733PKF7FPX5TGMBRRKIRR2P",
                    "high_descs":[
                        "Walk towards the glass door, turn right, then walk straight towards the lamp, make a right turn and face the dining table. ",
                        "Pick up the yellow vase on top of the dining table. ",
                        "Go to the right, turn left, walk straight and turn left to the couch in the living room. ",
                        "Put the vase in the white box on the couch. ",
                        "Pick up the white box from the couch. ",
                        "Walk to the left, turn right at the back of the couch, walk straight to the lap top on the dining table. ",
                        "Put the box beside the lap top on the dining table. "
                    ],
                    "task_desc":"Put the white box  with yellow vase in it beside the lap top on the dining table. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3X4MXAO0BJ56RNDWBPINAI7GOOIRW1",
                    "high_descs":[
                        "Move to dining table on the back side of the couch near the door.",
                        "Pick up golden vase from the table.",
                        "Move to front of couch on left hand side.",
                        "Place vase inside box on top of the couch.",
                        "Pick up box with vase from the couch.",
                        "Move to other side of couch on the right side of the table before the door.",
                        "Place box on top of table on right hand side."
                    ],
                    "task_desc":"Put a box with a vase inside on the dining table near the door.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3DYGAII7POPGVD1VMOFSDYPFZCLQPQ",
                    "high_descs":[
                        "Turn right, turn right at the sliding door, walk towards the lamp and turn right, turn right to face the right side of the table. ",
                        "Pick up the yellow vase that's behind the white plate. ",
                        "Turn right, turn left at the curtain, walk across the room and turn left after the couch, turn left to face the box on the couch.  ",
                        "Put the vase in the box to the right of the book. ",
                        "Pick up the box from the couch. ",
                        "Turn left and walk behind the couch and face the laptop on the table",
                        "Put the box down on the table to the left of the laptop. "
                    ],
                    "task_desc":"To put a vase in a box on the table. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3WJEQKOXABJLR5BCCQ7GM2SCSGP1AQ",
                    "high_descs":[
                        "turn to the right and take a few steps toward the window and turn to the right and go to the lamp and turn to the right and go to the side chair and turn to the right",
                        "pick up the golden vase from the table",
                        "turn to the right and take a few steps forward to clear the table and turn left and go to the front of the sofa and turn left and take a few steps forward and turn to the left",
                        "put the golden vase in the box on the sofa",
                        "pick up the box with the golden vase from the sofa",
                        "turn to the left and take a few steps to clear the sofa and turn right and go a few steps to clear the sofa and turn right and go to the last side chair and turn to the left",
                        "place the box with the golden vase on the table left of the notebook computer"
                    ],
                    "task_desc":"Place a box with the golden vase on a table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A11LSO6D7BMY99_3IHR8NYAMAI968EXOR8FAVOA3DVP4L",
                    "high_descs":[
                        "turn to your right then walk to the lamp and turn to your right again",
                        "turn to your right and face the dining table with blue chairs around it",
                        "pick up the yellow vase go around the table to the left and turn left at the sofa",
                        "face the sofa and place the yellow vase inside the box on the sofa",
                        "pick up the box after you close the lid",
                        "turn to your left and go back to the dining table walk to the end of it",
                        "place the box on the end of the table next to the lap top computer"
                    ],
                    "task_desc":"carry a box containing a yellow vase to the table",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3N8OEVH1FU7VP1CESBA9ZTPPA7YOOS",
                    "high_descs":[
                        "Turn right and right again and walk to the dining table.",
                        "Pick up the funnel from the table.",
                        "Walk back around the table to the front of the couch.",
                        "Set the funnel in the box.",
                        "Pick up the box from the couch.",
                        "Take the box and the funnel back to the dining table.",
                        "Set the box onto the table."
                    ],
                    "task_desc":"Store the funnel in the box on the dining table.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Vase",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-Vase-Box-DiningTable-201/trial_T20190907_052921_753275/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3AAPLD8UCFY1ACVZKF1I9UYBXGRTHV",
                    "high_descs":[
                        "walk forwards just past the end of the sofa on the left, then turn left and walk over to the dining table on the right",
                        "grab a yellow object off of the dining table",
                        "you're on the back side of the couch right now so, maneuver around to the front side of the couch and face it",
                        "place this yellow object inside of the box on the couch",
                        "pick up the box with the yellow object inside",
                        "walk back around to the back side of the couch and face the dining table",
                        "place the box down on the table"
                    ],
                    "task_desc":"place a box with a yellow object inside on top of the dining table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3S3AMIZX3XM3CFOMCXN2TZJ9H49DC2",
                    "high_descs":[
                        "Take a step forward, turn left, and walk towards the yellow vase on the dining table on your right side.",
                        "Pick up the yellow vase on the table.",
                        "Turn left towards the curtain, turn left towards the lamp, and then turn left to find the box on the couch to your left.",
                        "Place the vase inside the box on the couch.",
                        "Pick up the box from the couch.",
                        "Walk towards the dining table in front of your.",
                        "Place the box behind the computer on the table."
                    ],
                    "task_desc":"Place a yellow vase in the box on the table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3RGU30DZTDPTON05ZI3RZTJYGYPMJE",
                    "high_descs":[
                        "Head towards the door, hang a left then face the table on your right",
                        "Pick up the yellow vase on the table ",
                        "Head towards the window, turn to your left, pass the first box on the sofa then stop on the second box",
                        "Put the vase inside the box",
                        "Pick up the box from the sofa",
                        "Turn to your left and head back to the table",
                        "Face the table and drop the box on the floor"
                    ],
                    "task_desc":"Put the yellow vase in the box",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Vase"
            ]
        },
        "train/pick_and_place_with_movable_recep-Vase-Box-DiningTable-201/trial_T20190907_053028_584525/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3QECW5O0KKIPUJB4JD09KXVLS5IT5S",
                    "high_descs":[
                        "Turn around and take a step forward, then turn left and begin walking across the room, hang another left and walk up to the yellow vase on the glass table.",
                        "Pick up the yellow vase that is just below the white plate on the glass table.",
                        "Turn right and walk around the couch over to the cardboard box that is on the couch seat.",
                        "Place the yellow vase inside the cardboard box.",
                        "Pick up the cardboard box with the yellow vase inside of it.",
                        "Turn right and begin walking to the wall, the hang a left and walk back over to the glass table.",
                        "Place the cardboard box with the yellow vase inside of it on the end of the glass table."
                    ],
                    "task_desc":"Put a cardboard box with a yellow vase inside of it on the glass table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3ATPCQ38JBRIHBMFOFEP0P3MZREAYT",
                    "high_descs":[
                        "Walk behind the couch that is to the right and stop at the table to the right in front of the yellow bowl. ",
                        "Pick up the yellow bowl from the edge of the table. ",
                        "Turn right, walk to the front of the couch, and stop ion front of the box. ",
                        "Put the yellow bowl inside of the box that's on the couch. ",
                        "Pick the box up from the couch. ",
                        "Walk behind the couch and turn to face the table. ",
                        "Put the box down on the table behind the envelope closest to the right. "
                    ],
                    "task_desc":"Put a box with a yellow bowl in it on the table. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3NG53N1RLY0AP91Z0UYSR74F50PP8S",
                    "high_descs":[
                        "Turn around, then turn left, then go straight then turn around the back of the couch, then turn right to face the dining table.",
                        "Pick up the yellow vase on the table, in front of the plate.",
                        "Turn right, go around the couch, then turn right to face the box on the couch.",
                        "Place the vase in the box on the couch.",
                        "Pick up the box with the vase in it.",
                        "Go around the couch, then turn right to face the dining table.",
                        "Put the box on the table, behind the right most newspaper."
                    ],
                    "task_desc":"Put a vase in a box on the table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3S0TNUHWKWZ10CY9VL7XRDNQRM48DP",
                    "high_descs":[
                        "Turn around and go to the table to where the yellow vase is.",
                        "Pick up the yellow vase that is on the table.",
                        "With the vase in hand go to the couch where the box is on the couch.",
                        "Put the vase in the box.",
                        "Pick up the box with the vase in it.",
                        "With the vase with the box in go to the table where the grey bowl is.",
                        "On the table put the box to the right of the bowl behind the card that is the one all the way to the right."
                    ],
                    "task_desc":"Put vase in box to put on table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Box",
                "Vase",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Plate-CoffeeTable-201/trial_T20190909_051356_394008/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_31UV0MXWNT376UHRL9QM7CDEBXNI50",
                    "high_descs":[
                        "Move forward and go to the front of the black end table on the right.",
                        "Pick up the wrist watch on the top of the end table. ",
                        "Turn around go to the left front corner of the dining table. ",
                        "Place the wrist watch on the white plate on the table. ",
                        "Pick up the white plate with the wrist watch on it. ",
                        "Go around the dining table past the sofa to the glass coffee table. ",
                        "Place the plate with the wrist watch on it on the middle shelf of the table. "
                    ],
                    "task_desc":"Move the white plate with a wrist watch to the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3MD9PLUKKL5XR9C7PDAU1OGQYVKZNZ",
                    "high_descs":[
                        "Turn left and walk forward, then turn right and walk over to the black table against the wall on your right.",
                        "Pick up the watch off of the black table.",
                        "Turn right and walk forward, then turn right to face the glass table.",
                        "Put the watch on the white plate that is on the corner of the glass table.",
                        "Pick up the white plate with the watch on it off of the glass table.",
                        "Turn left and walk forward, then hang a right and walk around the black couch to the glass coffee table.",
                        "Put the white plate with the watch on it on the middle shelf of the coffee table."
                    ],
                    "task_desc":"Put a white plate with a watch on it on a coffee table shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3PEIJLRY6WKY98L6GWDW0MD6J87WX9",
                    "high_descs":[
                        "Go forward and turn to the right to face the black table.",
                        "Pick the watch up from the black table.",
                        "Turn around and face the glass table behind.",
                        "Put the watch down on the white plate on the table.",
                        "Pick the white plate up from the table.",
                        "Cross the room and turn to the right to face the glass table in front of the couch.",
                        "Put the plate on the table."
                    ],
                    "task_desc":"Put a plate with a watch on it on a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-CoffeeTable-201/trial_T20190908_021332_546301/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3LBXNTKX0UCFCNM0RDENLGLTRLH9XM",
                    "high_descs":[
                        "Turn left and go to the black trash can in the right corner.",
                        "Pick up the pencil in the trash can.",
                        "Turn around and go to the left side of the dining table. ",
                        "Place the pencil in the bowl towards the corner.",
                        "Pick up and bowl with the pencil in it.",
                        "Go around the table and go into the living room and to the left side of the coffee table. ",
                        "Place the bowl with the pencil in it on the table. "
                    ],
                    "task_desc":"Put the pencil in the bowl on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3ND9UOO81NJVOPIJ65LRO6YHIBMLWS",
                    "high_descs":[
                        "Turn left and go to the black wastebasket in the corner to your right.",
                        "Take the pencil out of the wastebasket.",
                        "Turn right and go to the nearest corner of the dining table.",
                        "Put the pencil into the bowl nearest that corner.",
                        "Pick up the bowl with the pencil in it.",
                        "Go around the left side of the table and sofa, to the coffee table that is in front of the sofa.",
                        "Put the bowl on top of the coffee table on the side closer to the sofa."
                    ],
                    "task_desc":"Put a bowl holding a pencil onto a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OE22WJIGL5TNI9R3AEMN4CE73WUQT",
                    "high_descs":[
                        "Turn left and walk to the door, then turn right and walk up to the black bin.",
                        "Pick up the pencil out of the black bin.",
                        "Turn around and walk around the small table to the large glass dining table.",
                        "Put the pencil in the grey bowl that is on the closest corner of the glass dining table.",
                        "Pick up the grey bowl with the pencil in it off of the glass table.",
                        "Turn left and walk towards the wall, then turn right and walk over to the coffee table.",
                        "Put the grey bowl with the pencil in it on top of the glass coffee table."
                    ],
                    "task_desc":"Put a grey bowl with a pencil in it on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil",
                "CoffeeTable"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-ArmChair-201/trial_T20190908_124445_444943/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_31Z0PCVWUN6C2CBL3E4NJ3TJDGU7T9",
                    "high_descs":[
                        "Turn around and then face the couch to the left.",
                        "Pick the credit card up from the couch.",
                        "Turn around and face the brown chair in the corner.",
                        "Put the credit card on the chair."
                    ],
                    "task_desc":"Put a credit card on a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3SB4CE2TJYM12VI3FRH4IXGFRKAAX8",
                    "high_descs":[
                        "Turn right to find a black couch on your left behind a black coffee table.",
                        "Pick up the credit card next to the laptop on the black couch.",
                        "Turn around to find a brown chair in the corner directly across from the black couch.",
                        "Put the credit card down on the brown chair."
                    ],
                    "task_desc":"Pick up the credit card and put it on the brown chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3DUZQ9U6SPFDY2Z2WC2DFCD0XFCSVM",
                    "high_descs":[
                        "turn around, take a few steps, turn left to face couch",
                        "pick up the credit card that is on the couch",
                        "turn around, walk to the chair",
                        "put the credit card on the chair"
                    ],
                    "task_desc":"move a credit card from couch to chair",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Plate-CoffeeTable-201/trial_T20190906_165356_709641/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A27AK750Y9M9KH_36V4Q8R5ZNHAAA4IU8N0WUVKUHIMQI",
                    "high_descs":[
                        "Turn left and head towards the television against the far wall.",
                        "Pick up the pen that is inside the stand upon which the television rests. ",
                        "Turn around and head towards the near right corner of the dining table behind the sofa.",
                        "Place the pan on the plate that is placed on the near right corner of the dining table. ",
                        "Pick up the plate with the pen. ",
                        "Turn around and head towards the three-shelf glass table in front of the sofa. ",
                        "Place the pen and plate on the middle shelf of the glass table. "
                    ],
                    "task_desc":"Gather a pen and plate and put them on a table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A18X8ZAS0QDLKJ_3KAKFY4PGXJW7Q8PBIDCRTVS3GP3IL",
                    "high_descs":[
                        "Turn right, then walk towards the chair, then left, then walk towards the television.",
                        "Pick up the pen from underneath the television stand in front of the Kleenex. ",
                        "Turn all the way around, walk towards the door, then head towards the glass table.",
                        "Place the pen onto the plate near the edge of the table.",
                        "Pick the plate up with the pen on it.",
                        "Turn around then walk towards the green chair, turn right, then face the glass table.",
                        "Place the plate with the pen on it underneath the glass coffee table "
                    ],
                    "task_desc":"Place a plate and a pen underneath a glass coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3MYYFCXHJ6O3TVLYL8ISGMAI2244GO",
                    "high_descs":[
                        "Turn left and walk towards the chair, then hang a left and walk up to the glass table the television on.",
                        "Pick up the black pen off of the bottom shelf of the glass table.",
                        "Walk forward, then turn left and walk around the couch to the large glass dining table.",
                        "Put the black pen on the white plate that is closest to you on the glass dining table.",
                        "Pick up the white plate with the pen on it.",
                        "Turn left and walk towards the wall, then turn right and walk over to the coffee table.",
                        "Put the white plate with the pen on it on the middle shelf of the coffee table."
                    ],
                    "task_desc":"Put a white plate with a pen on it on a shelf of the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3ERET4BTVPQ9SNNTSUZYVMDQS0P9KR",
                    "high_descs":[
                        "Turn left and make your way to the front of the tv and then face it.",
                        "Pick up the pen from the left side of the tv stand.",
                        "Turn left and move to the back of the couch and then face the table.",
                        "Place the pen on the plate near the edge of the table closest to you.",
                        "Pick up the plate.",
                        "Turn right and make your way to the coffee table in front of the couch facing the yellow vase.",
                        "Place the plate on the left side of the middle shelf of the table."
                    ],
                    "task_desc":"Put a pen on a plate and put it on the coffee table's middle shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3JW0YLFXRWXBZJUIAJSTXHFWDCFWW4",
                    "high_descs":[
                        "Turn left, walk towards the tv stand, stand in front of the tv.",
                        "Pick up the pen in front of the tissue box in the tv stand.",
                        "Turn around, walk past the sofa towards the dining table.",
                        "Place the pen on the plate that is not next to the bowl.",
                        "Pick up the plate with the pen on it.",
                        "Turn around, walk past the sofa, turn right towards the coffee table.",
                        "Place the plate in the middle shelf of the coffee table."
                    ],
                    "task_desc":"Put the pen on a plate  into the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3WOKGM4L74XAMKKVQQ8Y9ST691QO0Z",
                    "high_descs":[
                        "Turn left and walk forward toward the chair, then to the television on the left",
                        "pick up the pen on the left side of the bottom shelf",
                        "turn left and walk toward the chair, then turn left, go past the couch to the dining table",
                        "place the pen on the plate that's not next to the bowl",
                        "pick up the plate with pen on it",
                        "turn to the right, walk past the couch ",
                        "place the plate with the pen on the middle shelf directly under the black bowl"
                    ],
                    "task_desc":"Place a pen on a plate, place them on the middle shelf of coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Plate-CoffeeTable-201/trial_T20190906_165426_548095/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3KYQYYSHYYO4L4LP22WTOZDQ619ODT",
                    "high_descs":[
                        "Turn left and begin walking forward, then turn right and walk over to the chair, turn left and walk around the couch to the large glass table.",
                        "Pick up the black pen that is nearest to the tissue box on the glass table.",
                        "Turn right and walk towards the wall, then hang a left and walk towards the door, hang another left and walk up to other side of the glass table.",
                        "Put the black pen in the white plate that is on the left side of the table in front of you.",
                        "Pick up the white plate with the pen on it off of the glass table.",
                        "Turn left and walk towards the wall, then turn right and walk over to the coffee table.",
                        "Put the white plate with the pen on it on the coffee table."
                    ],
                    "task_desc":"Put a white plate with a pen on it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2ALWT2BUSXD83_3Z3ZLGNNSLB9OOW8OQIL0VMEUPXQ30",
                    "high_descs":[
                        "Turn to your left and walk to the table.",
                        "Pick up the pen on the table.",
                        "Walk to the other side of the table.",
                        "Place the pen on a plate.",
                        "Grab the plate from the table.",
                        "Walk past the table and the sofa to the coffee table.",
                        "Place the plate on the coffee table."
                    ],
                    "task_desc":"Place a plate with a pen on it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3GFK2QRXXCYHM0FYEI5K7H2JTBH5WU",
                    "high_descs":[
                        "Take a left turn and walk around the back of the couch to the table.",
                        "Pick up the pen on the bottom right side of the table closest to you.",
                        "Walk around to the other side of the table.",
                        "Put the pen on the plate.",
                        "Pick up the plate.",
                        "Walk around the front of the couch to the coffee table.",
                        "Put the plate on the coffee table to the left of the newspaper."
                    ],
                    "task_desc":"Put a plate with a pen on a coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3R0T90IZ1VT6OZYDENOAZKM5R6XGC2",
                    "high_descs":[
                        "Walk past the couch and over to the dining table",
                        "Pick up the pen from the table",
                        "Walk around to the other side of the table",
                        "Put the pen on the white saucer",
                        "Pick up the white saucer from the table",
                        "Walk around the couch to the glass coffee table",
                        "Put the saucer down on the coffee table"
                    ],
                    "task_desc":"Put the sauce with pen on the coffee table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_39U1BHVTDO8MG4O05UCG50X1EWMT37",
                    "high_descs":[
                        "Turn left and walk around the right side of the couch, and then veer left to the long side of the table.",
                        "Pick up the pen on the front right corner.",
                        "Walk around to the other side of the table.",
                        "Place the pen on the white plate on the tables.",
                        "Pick up the plate.",
                        "Turn left and walk beyond the table and couch, then turn right and head for the coffee table.",
                        "Place the plate on the coffee table behind and to the left of the trophy."
                    ],
                    "task_desc":"Place a plate with a pen on it on a coffee table.",
                    "votes":[
                        0,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "CoffeeTable",
                "Plate"
            ]
        },
        "valid_seen/pick_and_place_simple-Bowl-None-CoffeeTable-201/trial_T20190907_171639_045329/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_378XPAWRUFUWRB7AKXSME19Y9FDAIY",
                    "high_descs":[
                        "Turn around and walk to the dining table at the opposite side of the room.",
                        "Pick up the bowl from the table.",
                        "Walk to the coffee table on the opposite side of the room.",
                        "Put the bowl on the coffee table, to the left of the statue."
                    ],
                    "task_desc":"Move a bowl from a dining table to a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3A4TN5196NZKOVTOYT6SKKY795TCHJ",
                    "high_descs":[
                        "Turn around and cross the room, go left to stand at the table with the statue.",
                        "Pick the gray bowl up from the table.",
                        "Cross the room and then turn right and then right again to face the coffee table.",
                        "Put the bowl down on the table."
                    ],
                    "task_desc":"Put a bowl on a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3FTOP5WARI5WL9TYADGT1WCLD8IJ0K",
                    "high_descs":[
                        "Move across the room to the dining room table where the statue is ",
                        "Pick up the bowl to the right of the statue on the table",
                        "Carry the bowl to the glass coffee table",
                        "Place the bowl on top of the coffee table between the statue and the square black tray"
                    ],
                    "task_desc":"Move a bowl from the table to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper",
                "TissueBox",
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "Pencil",
                "RemoteControl",
                "Bowl",
                "Statue",
                "Plate",
                "Vase",
                "Box",
                "Pillow",
                "Watch",
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190909_031943_191883/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and go back the turn right to face the small black table.",
                        "Open the drawer and take the pencil out, then shut the drawer.",
                        "Carry the pencil and turn to the left and the left again to find the large couch.",
                        "Place the pencil in the box in the middle of the couch.",
                        "Pick up the box and pencil from the couch.",
                        "Carry the box and move to the right, then left around the couch and find the large table on the right.",
                        "Place the box on the right side of the table."
                    ],
                    "task_desc":"Move a pencil and box to the table."
                },
                {
                    "high_descs":[
                        "Move to the end table in between to two windows",
                        "Pick up a pencil from the end table",
                        "Move to the couch behind you",
                        "Place the pencil in a box on the couch",
                        "Pick up the box that has the pencil inside",
                        "Move to the dining table on the other side of the couch from you",
                        "Place the box on the table"
                    ],
                    "task_desc":"Put a box on the dining table with a pencil inside."
                },
                {
                    "high_descs":[
                        "Turn around and walk to the end table with the lamp on it.",
                        "Open the drawer and grab the pencil from inside.",
                        "Turn around and go to the second box on the couch.",
                        "Put the pencil in the box.",
                        "Pick up the box with the pencil in it.",
                        "Go around the couch to the dining table. ",
                        "Set the box with the pencil in it on the dining table."
                    ],
                    "task_desc":"Put away the pencil in the box and on the dining table."
                }
            ],
            "relative_objects":[
                "Pencil",
                "Box"
            ]
        }
    }
}