{
    "scene_name":"FloorPlan204",
    "trials":{
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-204/trial_T20190909_030816_404804/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_34QN5IT0T2IFMHJDFH8JDSN9RWA806",
                    "high_descs":[
                        "Make a left and then a right to walk through the other room until you reach the glass coffee table.",
                        "Pick up the keys sitting on the glass coffee table.",
                        "Turn around to walk around the chairs to reach the tall lamp next to the TV set.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Pick up some keys to look at them under a tall lit lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3LEIZ60CDMQC278DO3RPJNL6TAW9ZB",
                    "high_descs":[
                        "Turn left, take a right at the wooden table, head right at the glass table, take a left at the chair and turn left to face the glass table.",
                        "Pick up the set of keys next to the gold bottle on the table.",
                        "Turn left, take a left at the black desk and walk to the tall lamp on the left.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a tall lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_39K0FND3AK6Q8JJZ1KFV7G0HKNGAMS",
                    "high_descs":[
                        "Turn left walk forward then turn right head to the center table ",
                        "Pick up the keys on the center table ",
                        "Turn left then walk towards the lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine the keys by the light",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Box-Desk-204/trial_T20190907_202222_999701/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1AKL5YH9NLD2V_34T446B1C3V9DVNS0LZ7ESZQNQ9C03",
                    "high_descs":[
                        "Turn around and walk to the phone next to the box on the couch.",
                        "Pick up the phone next to the box.",
                        "Walk to the box on the couch closest to you.",
                        "Place the phone in the box on the couch.",
                        "Pick up the box on the couch.",
                        "Turn left and walk to the black desk with a white vase on it.",
                        "Place the box to the right of the vase on the desk."
                    ],
                    "task_desc":"Place a box with a phone in it to the right of the white vase on the black desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3Q5ZZ9ZEVRW6WZJGGFPET1ZYE6Q580",
                    "high_descs":[
                        "Turn around and walk to the white box on the sofa.",
                        "Pick up the phone from next to the white box.",
                        "Turn right and take one step, then turn left and face the box on the sofa.",
                        "Put the phone in the white box.",
                        "Pick up the white box from the sofa.",
                        "Turn around and walk to the black desk and face it.",
                        "Set the white box on the black desk."
                    ],
                    "task_desc":"Put the phone in the box and set the box on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3QL2OFSM99ZCYRFZ1R15P4V3VI1CNT",
                    "high_descs":[
                        "Move to the couch behind you",
                        "Pick up a phone from the couch ",
                        "Move to the box to the right of you",
                        "Place the phone inside the box",
                        "Pick up the box from the couch",
                        "Move to the black desk to the left of you",
                        "Place the box on top of the desk"
                    ],
                    "task_desc":"Put a box from the couch with a phone in it on the black desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Box",
                "CellPhone",
                "Vase"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Box-Desk-204/trial_T20190907_202335_083129/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_32AT8R96GOQ50YO4VE3RI4RFPH8SUN",
                    "high_descs":[
                        "turn right, walk around table, turn left, walk around table, turn left, walk around table, turn right and walk out of dining room, walk straight into living room, turn right at glass table, turn left and face glass table with two red chairs behind",
                        "pick up cell phone from on the table",
                        "walk around the glass table and face box on grey couch in front",
                        "put phone into the box on the couch",
                        "pick up the box from on the couch",
                        "turn left, and walk straight to black desk, face black desk",
                        "put box on desk to the left of the hand statue"
                    ],
                    "task_desc":"pick up cell phone from glass table in living room, put in box, put box onto black desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6SR4BU227GUH_37ZHEEHM6Z3ZI6RTSR9F045JPP837Y",
                    "high_descs":[
                        "Make your way around the wooden table, then exit the room and proceed straight until you reach the glass table",
                        "pick up the smart phone on the glass table",
                        "Go around the glass table, then walk straight to the large grey couch with a cardboard box on it",
                        "place the phone in the box",
                        "pick up the box with the phone in it",
                        "move left until you reach the wall, then right to face the black desk",
                        "place the box on the black desk to the right of the computer"
                    ],
                    "task_desc":"Box up a smart phone and place it on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_3BXQMRHWK2F223BZBH756VS9XRAMUN",
                    "high_descs":[
                        "Move around the table and through the doorway to stand between the coffee table and two chairs. ",
                        "Pick up the cell phone from the coffee table. ",
                        "Carry the cell phone to stand in front of the open box on the sofa. ",
                        "Place the cell phone inside the box on the sofa. ",
                        "Pick up the box with the phone in it from the sofa. ",
                        "Carry the box with the phone in it across the room to stand in front of the black desk. ",
                        "Place the box with the phone in it on top of the black desk."
                    ],
                    "task_desc":"Move a box with a phone in it to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Box",
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-Vase-None-Desk-204/trial_T20190906_181446_979303/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2ALWT2BUSXD83_3XUHV3NRVNFZPAK9JJJK6ESXHZM5H5",
                    "high_descs":[
                        "Turn around and walk to the glass coffee table.",
                        "Pick up the gold bottle on the coffee table.",
                        "Turn to your right and walk to the desk.",
                        "Place the bottle on the desk on the coffee table.",
                        "Turn around and walk to the coffee table again. ",
                        "Pick up the white bottle on the coffee table.",
                        "Walk back to the desk.",
                        "Place the white bottle next to the gold bottle on the desk."
                    ],
                    "task_desc":"Place a white and a gold bottle on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1KFTQRBMXSC13_3PZDLQMM0W2G95Q6F83LXGS4H3QC29",
                    "high_descs":[
                        "Turn around and go through the doorway into the living room.  Move toward the glass coffee table.",
                        "Grab the gold vase off of the coffee table.",
                        "Move right, then left, then forward, then right again and move towards the black desk. ",
                        "Place the gold vase onto to the black desk. ",
                        "Move right, then left, then right again and move towards the glass coffee table. ",
                        "Pick up the white vase off of the coffee table. ",
                        "Move right, then left, then forward, then right again and move towards the black desk. ",
                        "Place the white vase onto the black desk. "
                    ],
                    "task_desc":"Move both vases from the coffee table to the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "train/look_at_obj_in_light-RemoteControl-None-FloorLamp-204/trial_T20190907_122548_937258/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_354GIDR5ZENPJ3SCO56NJRXPEMI00A",
                    "high_descs":[
                        "Turn around and go to the left to the far side of the glass coffee table.",
                        "Pick up the remote from the coffee table.",
                        "Take the remote and go left around the furniture to the lamp beside the TV.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Turning a lamp on.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SOZYQZWJOOYS_3A1PQ49WVKY01SJQIWH83OFG5V21HS",
                    "high_descs":[
                        "Turn to your right, head to the right side of the table.",
                        "Pick up the TV remote.",
                        "Turn around, head towards the wall, turn left, and head towards the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at the TV remote under the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3GA6AFUKOR5WBVX550VRRHUD3FI3HO",
                    "high_descs":[
                        "Move to the glass coffee table so that you are facing the remote",
                        "pick up the remote that is on the table",
                        "Carry the remote to the lamp that is to the right of the TV",
                        "Turn on the lamp"
                    ],
                    "task_desc":"carry the remote to the lamp, turn on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Vase"
            ]
        },
        "train/pick_and_place_simple-WateringCan-None-Desk-204/trial_T20190906_193301_828239/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3HL8HNGX48IYC1VFRJ81F9LMM8Z9FS",
                    "high_descs":[
                        "Turn right, and go to the couch.",
                        "Pick up the tea pot on the floor, to the right of the couch.",
                        "Turn around, go toward the TV, then turn right, then go to the desk.",
                        "Place the tea pot on the desk, to the left of the box."
                    ],
                    "task_desc":"Put a tea pot on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3JMSRU9HQLB43U8MZ9TRP9PJ103VEE",
                    "high_descs":[
                        "Turn right and walk up to the couch.",
                        "Pick up the watering plant that is on the ground to the right of the couch.",
                        "Turn around and walk towards the television, then hang a right and walk over to the black desk.",
                        "Place the watering can on the black desk to the right of the blue credit card."
                    ],
                    "task_desc":"Place a watering can on a black desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1P0XSCJ9XAV74_3ZAZR5XV04Z6FGTI4FCZKR2C4X4ZCT",
                    "high_descs":[
                        "Turn to the right  facing the sofa in front of you.",
                        "Pick up the watering can beside the plant in the corner.",
                        "Turn around to your left, then make a right until you are standing in front of the black desk.",
                        "Put the watering can on the desk near the box."
                    ],
                    "task_desc":"Putting the watering can on the black desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan",
                "Desk"
            ]
        },
        "train/pick_and_place_simple-WateringCan-None-Desk-204/trial_T20190906_193241_476804/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3EWIJTFFVROOAT76WC524GZT70ME0T",
                    "high_descs":[
                        "Move to the plant in the corner.",
                        "Pick up the watering can from the floor.",
                        "Bring the watering can to the black desk.",
                        "Put the watering can on the black desk. "
                    ],
                    "task_desc":"Put a watering can on the black desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3RU7GD8VPRAS8TG8ES4X8Y4GGZJSPR",
                    "high_descs":[
                        "Turn right and go across the room, around the left of the glass table, to the end of the sofa with the white box on it.",
                        "Pick up the white watering can from the floor to the right of the sofa. ",
                        "Continue around the table, turning right to go between the table and two red chairs, then forward to the black desk.",
                        "Put the watering can spout side down on the desk in front of the box."
                    ],
                    "task_desc":"Place a white watering can on a black desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3UXUOQ9OKHEZ2RQE16OPNCJPUYTA7R",
                    "high_descs":[
                        "Turn right, walk to the coffee table, turn left and turn right, walk to the sofa with red pillow, turn left to the corner with plant",
                        "Take the pot on the floor",
                        "Turn around, walk to the black table",
                        "Put the pot on the table"
                    ],
                    "task_desc":"Move the pot in the corner to the black table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan"
            ]
        },
        "train/pick_and_place_with_movable_recep-Statue-Box-CoffeeTable-204/trial_T20190908_043831_574966/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_333U7HK6ICWQKTUSMP4OG3W47GBDJT",
                    "high_descs":[
                        "Go forward, then right, then left and face the table with the dog on your left.",
                        "Take the dog from the table in front of you.",
                        "Turn left then right and face the table on your right.",
                        "Place the dog in the box on the table in front of you.",
                        "Take the box off the table in front of you.",
                        "Turn around then turn right towards the glass table in front of you.",
                        "Place the box with the dog inside on the table in front of you."
                    ],
                    "task_desc":"Place a golden dog on a different table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_35GCEFQ6I85I2GXZBM1YROYIZ1PZ3S",
                    "high_descs":[
                        "move forward to the table",
                        "pick up the toy from the table",
                        "move around the table to the carton",
                        "place the toy in the carton",
                        "pick up the carton",
                        "turn around and head for the center table",
                        "place the carton on the center table"
                    ],
                    "task_desc":"place a carton with a toy in it on the center table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3Y4W8Q93L21ZBOUM3EI7JR7Y23LVDZ",
                    "high_descs":[
                        "Move ahead to the next room and turn right, then left at the table.",
                        "Pick up the statue from the front of the table.",
                        "Carry the statue and turn left and right to go around to the other side.",
                        " Place the statue in the box on the end of the table.",
                        "Pick up the box from the end of the table.",
                        "Carry the box and turn around, then right to the next room. Go straight to the glass coffee table.",
                        "Place the box and statue on the table."
                    ],
                    "task_desc":"Move a statue into a box and take them to a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue",
                "Box"
            ]
        },
        "train/pick_and_place_with_movable_recep-Statue-Box-CoffeeTable-204/trial_T20190908_043505_652000/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_39GHHAVOMI8DKXBZTE3VDZ2YU2HJ4J",
                    "high_descs":[
                        "Turn around and walk through the doors to the dining room table, step to the right so that you are facing the right end of the dining room table",
                        "Pick up the white, opened box that is sitting closes to you; The one that is on the right corner of the table closest to you. ",
                        "Turn around and cross the room to the clear glass coffee table sitting in the middle of the room",
                        "Place the box on the table"
                    ],
                    "task_desc":"Place an opened box on a coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3IGI0VL64A1D7GC2RWAWK4PKKD6ONM",
                    "high_descs":[
                        "Go left and then left again to stand in front of the box on the table.",
                        "Pick the box up from the table.",
                        "Turn around and go forward to stand at the glass table.",
                        "Put the box on the glass table."
                    ],
                    "task_desc":"Put a box on a table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HXEXQTZCJ1DW_3CTOC39K3A7A3KTIVC12GBM8L4PJ7L",
                    "high_descs":[
                        "turn left and take a few steps. turn left and walk into the other room. turn right and then left to the desk",
                        "pick up the box from the table",
                        "turn around and walk to the coffee table",
                        "place the box on the table"
                    ],
                    "task_desc":"move an empty box from the desk to the table",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "train/pick_and_place_with_movable_recep-Vase-Box-DiningTable-204/trial_T20190909_024605_102909/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_37FMASSAYFI9VAY0MJHZAYD6LO2BID",
                    "high_descs":[
                        "Turn around and walk to the left side of the coffee table. ",
                        "Pick up the blue container that's in front of the gold sculpture. ",
                        "Turn around to the face the couch with the open box on it. ",
                        "Place the blue container inside of the box on the couch. ",
                        "Pick up the box from the couch. ",
                        "Turn left, walk around the chairs and to the table straight ahead. ",
                        "Place the box on top of the table. "
                    ],
                    "task_desc":"Put a blue container in a box and place the box on the table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_37UQDCYH60MRF4FA8942KLH4A1V7VA",
                    "high_descs":[
                        "Turn left and take three steps then turn left and walk to the coffee table then turn left and walk to the couch  then turn right and take a step then turn right to face the coffee table.",
                        "Pick up the blue vase that's in front of you.",
                        "Turn around and take a small step to your right.",
                        "Put the blue vase in the box that's on the couch.",
                        "Pick up the box with the vase in it.",
                        "Turn left and walk to the chair then turn left and walk past the couch then turn right and walk through the doors  to the table.",
                        "Put the box on the table to the right of the laptop."
                    ],
                    "task_desc":"Put a box with a vase in it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3HYA4D452UAVX6WE2II368XABQ8F2Z",
                    "high_descs":[
                        "Go to the center table",
                        "Pick up the blue vase",
                        "Go to the sofa",
                        "Place the vase in a box",
                        "Pick up the box",
                        "Go to the large wooden table",
                        "Place the box down on the large wooden table"
                    ],
                    "task_desc":"Put a vase in a box and move to a different table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Vase"
            ]
        },
        "train/pick_and_place_with_movable_recep-RemoteControl-Box-Desk-204/trial_T20190907_150056_321362/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3AQF3RZ55BZBUITHTC5PVZUKW84F62",
                    "high_descs":[
                        "Move to the black desk.",
                        "Pick up the remote on the desk.",
                        "Bring the remote to the box on the couch.",
                        "Put the remote in the box.",
                        "Pick up the box with remote on the couch. ",
                        "Bring the box with remote to the black desk.",
                        "Put the box with remote on the black desk. "
                    ],
                    "task_desc":"Put a remote in a box on the black desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3C2NJ6JBKDYZ09NX4YCZDRMHIUU2NL",
                    "high_descs":[
                        "Turn around and walk towards the wall, then turn right and walk up to the back desk.",
                        "Pick up the remote off of the black desk.",
                        "Turn right and begin walking across the room, then walk around the chair to the cardboard box on the couch seat.",
                        "Put the remote inside the cardboard box.",
                        "Pick up the cardboard box with the remote in it.",
                        "Turn right and walk around the coffee table and back to the black desk.",
                        "Place the cardboard box with the remote in it on the black desk to the left of the golden statue."
                    ],
                    "task_desc":"Place a cardboard with a remote in it on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3PS7W85Z82J8V6DGM3DQWD0NDGW9TN",
                    "high_descs":[
                        "Turn around, then turn right to face the desk.",
                        "Pick up the remote on the desk, to the right of the lamp.",
                        "Turn right, then turn right again, toward the coffee table; turn left, then turn right and go straight to the couch.",
                        "Place the remote in the box on the couch.",
                        "Pick up the box on the couch.",
                        "Turn right, then turn right to go around the table, then turn left, then turn right, to go to the desk.",
                        "Place the box on the desk, to the left of the statue."
                    ],
                    "task_desc":"Put the remote in a box, on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box"
            ]
        },
        "train/pick_and_place_with_movable_recep-RemoteControl-Box-Desk-204/trial_T20190906_191214_646295/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A23HZ18KTCK2DA_31T4R4OBOVXNV6NCLKKGT79DU2X7CB",
                    "high_descs":[
                        "Turn around.  Move to grey chair.  At the chair turn right then move to the desk and face the desk.",
                        "Pick up the remote on the black desk.",
                        "Turn right then go to the end of the desk and turn left.  Move forward to the table.",
                        "Put the remote in the box on the table.",
                        "Pick up the box that is on the table.",
                        "Turn all the way around.  Move forward past the desk.  Once past the desk turn right and then move to the center of the desk and face the desk.",
                        "Put the box down on the desk to the right of the lap top that is on the desk"
                    ],
                    "task_desc":"Put a remote in a box to put on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_33LKR6A5KH1Q61ALIQYXH7I4F6G1TI",
                    "high_descs":[
                        "Move to the black desk.",
                        "Pick up the remote from the desk. ",
                        "Go to the table with the boxes on them. ",
                        "Put the remote in the front box on the table. ",
                        "Pick up the box with remote from the table. ",
                        "Bring the box to the black desk.",
                        "Put the box on the black desk. "
                    ],
                    "task_desc":"Put a box with a remote in it on the black table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3HHRAGRYXBMSIE88QMRR23U0E6N9O5",
                    "high_descs":[
                        "walk over to the black computer desk",
                        "pick up the remote off of the desk",
                        "walk over to the dining room table",
                        "place the remote inside of a white box on the dining room table",
                        "pick up that same white box off of the dining room table",
                        "walk the box over to the computer desk",
                        "place the box on top of the computer desk"
                    ],
                    "task_desc":"place a box with a remote control in it on top of the computer desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-RemoteControl-Box-Desk-204/trial_T20190907_145909_032296/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ARB80JPV0HQ5O_3G5F9DBFOSEGN4ZOPA1XACMWTKIVHP",
                    "high_descs":[
                        "Walk straight, turn right, turn left towards the marble table",
                        "Pick up the remote from on top of the marble table",
                        "Turn left, walk straight, turn right, turn left and walk through the doors, walk straight towards the glass table, turn left then right towards the black couch",
                        "Put the remote inside the brown box on the couch",
                        "Pick up the box on top of the couch",
                        "Turn right, walk straight, turn right, walk straight towards the black table",
                        "Place the box on top of the black table"
                    ],
                    "task_desc":"Put a remote inside a box then place the box on a black table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3LOTDFNYAAG9OX8NKUITTTTXKDNWFG",
                    "high_descs":[
                        "walk forwards to the right side of the dining room table",
                        "grab the remote control off of the dining room table",
                        "turn left and walk to the end of the room where the coffee table is, then maneuver your way around to the other side of the table, and face the couch there",
                        "place the remote controller inside the box on the couch",
                        "pick up the box with the remote control off of the couch",
                        "turn right and walk over to the television, then turn right and walk over to the desk at the end of the room",
                        "place the box on top of the desk"
                    ],
                    "task_desc":"place a box with a remote controller on top of the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3Z9WI9EOZ2527T5CQ6NQ83BFDJVKH6",
                    "high_descs":[
                        "Move to the dining table on the other side of the black desk",
                        "Pick up remote off of the table",
                        "Move to the couch farthest away from the dining table on the other side of the coffee table",
                        "Place remote inside the box on the couch",
                        "Pick up box from the couch",
                        "Move to the black desk towards to dining room",
                        "Place box on the black desk"
                    ],
                    "task_desc":"Put box with a remote control on the black desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box"
            ]
        },
        "train/pick_and_place_with_movable_recep-Statue-Box-Desk-204/trial_T20190907_000806_131811/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_33TIN5LC07R4CSCAW90P4US2SK09Y2",
                    "high_descs":[
                        "turn right and walk forwards over to the right side of the dining table",
                        "grab a gold animal statue off of the table",
                        "turn left, walk forwards a bit, then turn right, once you're at the middle of the table turn left, and walk forwards over to the couch at the far end of the room",
                        "place the golden statue in a box on the table",
                        "pick up the box off of the table",
                        "turn left and walk forwards a bit, then turn right and walk over to the computer desk at the end of the room",
                        "place the box down on the computer desk"
                    ],
                    "task_desc":"place a box with a statue in it on the computer desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3DI28L7YXDVOHISOSV92ILI3CZRE19",
                    "high_descs":[
                        "Turn right and walk forward to the right side of the large wood table",
                        "Pick up the gold statue form the right side of the table",
                        "Walk out of the dining room and across the living room to the far side of the coffee table",
                        "Put the gold statue into the box on the coffee table",
                        "Pick up the box from the coffee table",
                        "Walk around the left side of the coffee table and over to the desk",
                        "Put the box down on the desk"
                    ],
                    "task_desc":"Put the box with statue on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3TEM0PF1Q8EJINT60HUIYYH87T40DF",
                    "high_descs":[
                        "Turn right, walk to the table, turn right, turn left, facing the statues on the table",
                        "Grab the horse statue on the table",
                        "Turn left, walk across the room to the coffee table",
                        "Put the horse in the box on the coffee table",
                        "Take the whole box on the coffee table",
                        "Walk across the room to the black table",
                        "Put the box on the black table"
                    ],
                    "task_desc":"Move the horse statue into the box, move the box to the black table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue",
                "Box"
            ]
        },
        "train/pick_and_place_with_movable_recep-Statue-Box-Desk-204/trial_T20190907_000918_901516/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3D4CH1LGEDA4Q1RA23EJXULYNJG9G0",
                    "high_descs":[
                        "Turn left and walk straight ahead to the couch, then turn around and look at the coffee table.",
                        "Pick up the bronze statue closest to you.",
                        "Turn around look at the sofa.",
                        "Put the statue in the box.",
                        "Pick up the box.",
                        "Turn around and veer right to the desk.",
                        "Place the box on the right side of the desk."
                    ],
                    "task_desc":"Place a box with a statue in it on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3UJ1CZ6IZK6OFJYPUDVJASZZPZKS57",
                    "high_descs":[
                        "walk over to the glass table in the living room",
                        "grab animal statue off of the table",
                        "turn around and face the couch behind you",
                        "place the statue inside the box on the couch",
                        "pick up the box with the statue in it",
                        "bring the box over to the computer desk",
                        "place the box on top of the computer desk"
                    ],
                    "task_desc":"place a box with a statue in it on the computer desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3X31TUMD7032NO2G9HW6VG8NLT31LO",
                    "high_descs":[
                        "Move to the coffee table side nearest to the couch with the box",
                        "Pick up the closest statue from the coffee table",
                        "Move to the box behind you",
                        "Place the statue inside the box",
                        "Pick up the box from the couch",
                        "Move to the black desk behind you",
                        "Put the box on top of the desk"
                    ],
                    "task_desc":"Put the box from the couch onto the desk with the smaller statue inside.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan",
                "CreditCard",
                "Laptop",
                "RemoteControl",
                "Statue",
                "Vase",
                "Box",
                "Pillow",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Statue-Box-Desk-204/trial_T20190907_000958_247596/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_323Q6SJS8LXRR7DYPVWTSQJA5MNFH6",
                    "high_descs":[
                        "Turn right, go straight, turn right at the couch, go straight, turn left at the desk, go in between the couch with the red pillow and the coffee table, face the coffee table.",
                        "Pick up the gold sculpture from the coffee table.",
                        "Turn around to face the couch with the red pillow.",
                        "Put the gold statue in the white box on the couch.",
                        "Take the white box from the couch.",
                        "Turn around , go straight to the black desk.",
                        "Put the box on the desk to the right of the keys and near the edge."
                    ],
                    "task_desc":"Put a box with a sculpture in it on a desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_35K3O9HUAEUF7XMWZUON7NMXD3LFEA",
                    "high_descs":[
                        "turn around and move over to the furthest away couch and face the table",
                        "grab the gold statue off of the table",
                        "turn around to face the couch with the box",
                        "place the statue inside of the box",
                        "pick up the box off of the couch",
                        "turn around and move over to the computer desk",
                        "place the box on top of the computer desk"
                    ],
                    "task_desc":"place a box with a statue inside of it on the computer desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3AAJC4I4FJ9TNUZOE7TL7VF7UJMJZ4",
                    "high_descs":[
                        "Move to the coffee table.",
                        "Pick up the golden dog on the table.",
                        "Bring the dog to the box on the couch.",
                        "Put the dog in the box on the couch. ",
                        "Pick up the box on the couch. ",
                        "Bring the box to the black desk. ",
                        "Put the box on the black desk. "
                    ],
                    "task_desc":"Put a box with a golden dog in it on the black desk. ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue",
                "Box"
            ]
        },
        "train/pick_and_place_simple-Vase-None-Safe-204/trial_T20190907_023343_425395/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_39DD6S19JSSLCEDW06IUAF2FP80EZI",
                    "high_descs":[
                        "Turn around and go to the white shelf. ",
                        "Pick up the blue vase from the shelf. ",
                        "Bring the vase to the white safe on the ground. ",
                        "Put the vase in the safe on the ground. "
                    ],
                    "task_desc":"Put a blue vase in a safe. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3NAPMVF0ZZWAXOVAORVAHU0RICA72U",
                    "high_descs":[
                        "turn around and walk to the shelves on the wall",
                        "take the blue object off of the shelf",
                        "turn around and walk over to the safe at the end of the room",
                        "put the blue object in the safe on the floor"
                    ],
                    "task_desc":"put a blue object in the safe on the floor",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3WJ1OXY92DX325VXBBGV1CFK5MAA8X",
                    "high_descs":[
                        "Turn around and walk to the shelves on the wall.",
                        "Pick up the blue container on the second shelf.",
                        "Turn around and walk straight to the safe on the floor.",
                        "Put the container in the safe."
                    ],
                    "task_desc":"Put a container in a safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Vase"
            ]
        },
        "train/pick_and_place_simple-Vase-None-Safe-204/trial_T20190919_000130_908789/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AHBWX3WYMAB0E_36PW28KO42DKB65OOE2VTMB6GPBAEZ",
                    "high_descs":[
                        "Turn around and go around the table and into the adjoining living room. Stop in front of the glass coffee table.",
                        "Pick up the blue vase.",
                        "Turn around and head across the room to the white safe on the floor in the corner behind the black desk.",
                        "Put the blue vase into the safe."
                    ],
                    "task_desc":"Put the blue vase into the safe.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_39GAF6DQWUH5JTEANLYCIP6PCP2V1U",
                    "high_descs":[
                        "Turn to the left, and go around the back side of the table to the right. Turn left to go in the living room, go the left around the glass coffee table and then right again to face it.",
                        "Pick up the blue vase from the table.",
                        "Turn right and then left to go around the table. Turn left and find the small box in the far corner of the room.",
                        "Open the small box, place the vase inside and shut it again."
                    ],
                    "task_desc":"Place the blue vase in the safe on the floor.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3I02618YA3N8N68C3XZXNZM41Y0UP9",
                    "high_descs":[
                        "Turn around, and then go right at the table; exit the room and go straight to the coffee table, then go left, then right to stop at the coffee table.",
                        "Pick up the vase on the right side of the table.",
                        "Turn right, then left, then right toward the doorway, then turn left to go around the desk.",
                        "Put the vase in the safe to the right of the desk, then close it."
                    ],
                    "task_desc":"Put a vase in a safe.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Vase"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Safe-204/trial_T20190906_190213_301469/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3AAPLD8UCFY1ACVZKF1I9UYBWSUTHL",
                    "high_descs":[
                        "Turn around and face the computer on the desk.",
                        "Take the keys on the right of the computer on the desk.",
                        "Go to the other side of the desk and face the wall with the desk to the left.",
                        "Open the safe in the corner and put the keys in the safe.",
                        "Turn around, go right to the far couch on the other side of the room and go between the couch and coffee table facing the couch.",
                        "Take the keys from the couch cushion.",
                        "Turn around, go left to the far left corner of the room near the desk.",
                        "Open the safe in the corner and put the keys in the safe."
                    ],
                    "task_desc":"Put keys in a safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3DL65MZB8GW84L2M8SYMZH1UGQXEC2",
                    "high_descs":[
                        "turn left and move towards the end of the desk",
                        "grab the keys off of the desk next to the laptop",
                        "turn right and move your way over to the other side of the desk",
                        "place the keys in the safe on the floor on your right",
                        "turn around and head over to the furthest away couch",
                        "grab the keys off of the couch cushion there",
                        "turn around and move your way over to the safe on the floor again",
                        "place the keys inside of the safe on the ground"
                    ],
                    "task_desc":"place both keys in the safe on the ground",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Safe-204/trial_T20190906_190057_223109/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3MH9DQ757ZT2ATFD0E9ATQ8C0C7UG9",
                    "high_descs":[
                        "turn around and walk to the other side of the room to face the white shelves on the right side of the room",
                        "grab the keys off of the shelf there",
                        "turn around and walk over to the safe on the floor of the opposite side of the room",
                        "place the keys in the safe there",
                        "turn around and walk to the end of the desk on the right, then hang a right turn and walk back over to the middle couch in front of the coffee table",
                        "grab the keys on the couch",
                        "turn around and walk over to the corner of the room on the left ",
                        "place the keys inside of the safe there"
                    ],
                    "task_desc":"place both sets of keys inside of the safe",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3RYC5T2D76AG7EGVZ34SIOZKU4TPR7",
                    "high_descs":[
                        "Turn around and head to the shelves on your right",
                        "Grab the keys that are on the bottom shelf",
                        "Turn around and head to the white safe at the bottom corner of the room",
                        "Open the safe and place the keys inside",
                        "Turn around and walk to the sofa with the laptop on it",
                        "Grab the keys that are on the sofa",
                        "Turn around and head to the white safe at the bottom corner of the room",
                        "Open the safe and put the keys in it. Then close the safe. "
                    ],
                    "task_desc":"Putting keys inside a safe",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Box-ArmChair-204/trial_T20190909_081218_866063/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_3E1QT0TDFS0QTC0TJ7XPJWN5DRF8IR",
                    "high_descs":[
                        "Go right and then right again and face the black desk with the box.",
                        "Pick the phone on the right up from the desk.",
                        "Turn around and go left to face the box on the gray couch.",
                        "Put the phone in the box.",
                        "Pick the box up from the couch.",
                        "Turn and face the chair to the left.",
                        "Put the box on the chair."
                    ],
                    "task_desc":"Put a box with a phone in it on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3X3OR7WPZ2RSJD8Z4AU2BCFXUV5L8E",
                    "high_descs":[
                        "Turn around and walk to the left side of the desk, the long side.",
                        "Pick up cell phone closest to the corner of the desk.",
                        "Turn around and veer left before the coffee table, towards the box on the couch.",
                        "Place the phone in the box.",
                        "Pick up the box.",
                        "Turn left and face the chair.",
                        "Place the box on the chair."
                    ],
                    "task_desc":"Place a box with a cell phone in it on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3X73LLYYQ45B0OCDJR4N1HCL29YNH0",
                    "high_descs":[
                        "Turn right and walk over to the chair, then turn right and walk over to the black desk.",
                        "Pick up the rightmost phone off of the black desk.",
                        "Turn around and walk over to the couch with the cardboard box on it.",
                        "Put the phone into the cardboard box on the couch.",
                        "Pick up the cardboard box with the phone in it.",
                        "Turn around and walk up to the coffee table, then turn right and walk up to the chair.",
                        "Put the cardboard box with the phone in it on the seat of the chair."
                    ],
                    "task_desc":"Put a cardboard box with a phone in it on the seat of a chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CellPhone",
                "Chair"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Box-ArmChair-204/trial_T20190909_080825_939011/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_30JNVC0ORCBW3LP5ZJW45B7Q7KJHQF",
                    "high_descs":[
                        "Turn around, hang a left at the gray bin on the floor and walk to the black desk on the left.",
                        "Pick up the cell phone to the left of the box on the right side of the desk.",
                        "Turn around, hang a left at the glass table, take a right at the couch and turn left to face the couch.",
                        "Pick the cell phone inside the box on the middle of the couch.",
                        "Pick up the box with the cell phone inside from the couch.",
                        "Turn around and hang a right to the gray chair.",
                        "Put the box with the cell phone inside on the gray chair."
                    ],
                    "task_desc":"Place a box with a cell phone on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_31HQ4X3T3V1A2XN8I807S3FY6PALSC",
                    "high_descs":[
                        "turn around and walk over to the right side of the desk up ahead",
                        "grab the cellphone off of the desk there",
                        "turn around and walk over to the couch on the left side of the room, and turn to face the couch",
                        "place the cellphone inside of the box on the couch there",
                        "pick the box up off of the couch",
                        "turn left and walk forwards to the chair to the left of the couch",
                        "place the box down on the chair there"
                    ],
                    "task_desc":"place a box with a cellphone in it on the chair",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3D4CH1LGEDKCBQD8YB30YG50IKQ9GA",
                    "high_descs":[
                        "Turn around to walk towards the black desk.",
                        "Pick up the smartphone on the black desk.",
                        "Hang a right and then another around the coffee table to reach the long couch.",
                        "Put the smartphone in the empty cardboard box on the couch.",
                        "Pick up the cardboard box with the smartphone in it.",
                        "Turn to face the armchair to the left of the couch.",
                        "Place the cardboard box with the smartphone in it on the armchair."
                    ],
                    "task_desc":"Put a smartphone in a cardboard box to put on the armchair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CellPhone",
                "Chair"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Box-ArmChair-204/trial_T20190909_081031_028962/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3SFPSMFRSRTB3_33PPO7FECY62A7WK0F855O16OHKDI8",
                    "high_descs":[
                        "Turn right, proceed to coffee table.",
                        "Pick up phone from coffee table.",
                        "Turn left, then turn right when reach couch.  Proceed to couch with box on it.",
                        "Put phone in box on couch.",
                        "Pick up box with phone in it from couch.",
                        "Turn around, proceed to chair. ",
                        "Put box with phone in it on chair."
                    ],
                    "task_desc":"Move phone from table to box, move box with phone from couch to chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_358UUM7WR2UZMXYTZPZSJOS1P3C7RR",
                    "high_descs":[
                        "Turn around and walk forward, then hang a left and walk over to the glass coffee table in the other room.",
                        "Pick up the phone off of the glass coffee table.",
                        "Turn left and walk over to the couch, then turn right and walk up to the cardboard box on the couch in front of you.",
                        "Put the phone into the cardboard box on the couch.",
                        "Pick up the cardboard box with the phone in it off of the couch.",
                        "Turn around and walk up to the chair directly in front of you.",
                        "Put the cardboard box with the phone in it on the seat of the chair."
                    ],
                    "task_desc":"Put a cardboard box with a phone in it on the seat of a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3ZWMVK6GNTJ8_36WLNQG7821XF5WEQ0R8PJFET3AEB2",
                    "high_descs":[
                        "Turn around and go to the coffee table in the living room to the corner between the couch and the chair.",
                        "Pick up the cell phone the left side of the sculpture.",
                        "Go around the corner of the coffee table down to the end of the couch with the box on it.",
                        "Place the phone inside the box.",
                        "Pick up the box off of the couch.",
                        "Turn around and head towards the chair at the end of the coffee table.",
                        "Place the box in the middle of the cushion on the chair."
                    ],
                    "task_desc":"Get the remote and put into the box and move it to the chair.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box",
                "CellPhone",
                "Chair"
            ]
        },
        "valid_seen/pick_two_obj_and_place-Vase-None-Desk-204/trial_T20190906_181531_703961/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A28HB7240OFGEW_3OVHNO1VE9IGK8ZW4B7A4XKTNA4DZH",
                    "high_descs":[
                        "Turn around and stand in front of the white shelves.",
                        "Pick up the blue jar from the white shelf.",
                        "Turn around and walk over to the black desk with the box on top of it.",
                        "Put the Blue jar next to the open box.",
                        "Turn around and walk to the black entertainment center.",
                        "Pick up the yellow jar from the entertainment center.",
                        "Walk over to the black desk. ",
                        "Put the yellow jar on the black desk next to the blue jar."
                    ],
                    "task_desc":"Put the yellow and blue jars on the black desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3WMOAN2SREE8X0LZS8WAFWJRD2NNVU",
                    "high_descs":[
                        "Turn around and face the shelves.",
                        "Pick up the blue vase on the bottom shelf.",
                        "Turn right, go towards the couch, turn right, walk in front of the black desk.",
                        "Put the blue vase on the desk to the right of the box.",
                        "Turn around, walk to the television stand.",
                        "Pick up the yellow vase on the left side of the television stand.",
                        "Turn around, walk to the black desk.",
                        "Put the yellow vase on the black desk to the right of the blue vase."
                    ],
                    "task_desc":"Put all the vases on the black desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3018Q3ZVOL79KAATAKMVSTAPWMMRAV",
                    "high_descs":[
                        "Turn left and left again to face the shelf.",
                        "Pick up the vase from the lower shelf.",
                        "Turn around and walk to the black table to your right.",
                        "Place the vase on the table.",
                        "Turn around and walk to the television stand to your right.",
                        "Grab the yellow vase on the table.",
                        "Turn around and take the yellow vase to the table to your left.",
                        "Place the yellow vase next to the blue vase on the table."
                    ],
                    "task_desc":"Place the yellow and blue vase on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3Y5140Z9D0X3EFDC9GAJ4WYT8CPPIR",
                    "high_descs":[
                        "Turn around and face the book shelf on the wall.",
                        "Pick up the blue bottle on the bottom shelf. ",
                        "Turn around and go to the black desk on the other side of the room. ",
                        "Place the blue bottle on the desk on the right of the box.",
                        "Turn around and go to the TV stand. ",
                        "Pick up the yellow bottle in front of the TV.",
                        "Turn around and go back to the black desk. ",
                        "Place the yellow bottle on the desk to the right of the blue bottle. "
                    ],
                    "task_desc":"Move the bottles to the desk. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan",
                "Statue",
                "Vase"
            ]
        },
        "tests_seen/trial_T20190908_130422_997962/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and turn right behind the chair to find the wall shelf.",
                        "Pick up the blue bowl from the middle of the items.",
                        "Carry the blue bowl and turn around, then face right to the desk.",
                        "Place the bowl in the box in the center of the desk.",
                        "Pick up the bowl and box from the desk.",
                        "Carry the box and turn to the right, then the left to go in the next room and face the dining table.",
                        "Place the box on the front side of the dining table."
                    ],
                    "task_desc":"Move a bowl and box to a table."
                },
                {
                    "high_descs":[
                        "Turn left,move forward then cross the room head to the shelf ",
                        "Pick up the gray container on the shelf",
                        "Turn right then head to the black table on your right",
                        "Put the gray container in the box",
                        "Pick up the box on the black table",
                        "Turn right then head to the long brown table",
                        "Put the box with gray container on the table"
                    ],
                    "task_desc":"Put the box with gray container on the table"
                },
                {
                    "high_descs":[
                        "Turn left and walk over to the chair, then turn left again and begin walking across the room, hang a right and walk over to the white shelf on the wall.",
                        "Pick up the clear glass vase off of the shelf.",
                        "Turn right and walk forward, then hang a right and walk over to the black table.",
                        "Put the glass vase in the cardboard box on the table.",
                        "Pick up the cardboard box with the glass vase in it.",
                        "Walk over to the large wooden table in the other room.",
                        "Put the cardboard box with the glass vase in it on the wooden table."
                    ],
                    "task_desc":"Put a cardboard box with a glass vase in it on a wooden table."
                }
            ],
            "relative_objects":[
                "Box",
                "Vase"
            ]
        }
    }
}