{
    "scene_name":"FloorPlan205",
    "trials":{
        "train/pick_and_place_with_movable_recep-KeyChain-Box-ArmChair-205/trial_T20190909_104931_228949/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3WJEQKOXABTTCUXA8YWXNOCEMLU1A2",
                    "high_descs":[
                        "Turn right and walk to the wall then turn right and walk past the table then turn right and take two steps then turn right to face the table.",
                        "Pick up the keys that are on the table under the box.",
                        "Put the keys in the box that's on the table to the right of the laptop.",
                        "Pick up the box with the keys in it.",
                        "Turn left and walk to the red chair.",
                        "Put the box on the cushion of the red chair in front of you."
                    ],
                    "task_desc":"Put a box with keys in it on the chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3YJ6NA41JE77UFJGN6K0HJXVFOQJP0",
                    "high_descs":[
                        "turn around, go to end of dining table with box and keys",
                        "pick up keys in front of box",
                        "place keys in box on dining table",
                        "pick up box with keys from dining table",
                        "turn left, go to red chair",
                        "place box with keys on red chair"
                    ],
                    "task_desc":"place box with keys on red chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3G2UL9A02G560E0971WU8T15TO367D",
                    "high_descs":[
                        "Turn around and go to the glass table",
                        "Grab the keys off of the table",
                        "Put the keys in the cardboard box on the table",
                        "Grab the box off of the table",
                        "Turn left and stop at the back of the couch",
                        "Put the box on the couch"
                    ],
                    "task_desc":"Putting a cardboard box with a set of keys in it on the couch",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Chair",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-ArmChair-205/trial_T20190909_105338_371212/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3IXQG4FA2WPGK95XIPBMX5E32FUB97",
                    "high_descs":[
                        "Turn right and walk towards the wall, then hang a right and walk over to the small black table next to the couch.",
                        "Pick up the set of keys off of the small black table.",
                        "Turn around and walk over to the door, then turn left and walk over to the glass table.",
                        "Put the set of keys in the cardboard box on the table.",
                        "Pick up the cardboard box with the keys in it off of the table.",
                        "Turn left and walk forward, then hang a right and walk around the glass table to the back of the red chair.",
                        "Put the cardboard box with the keys in it on the seat of the red chair."
                    ],
                    "task_desc":"Put a cardboard box with keys in it on a red chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3KAKFY4PGXT4SFUN7Q2TSFFUXEU3IJ",
                    "high_descs":[
                        "Turn around and cross the room to face the keys on the small table.",
                        "Pick up the keys on the small table.",
                        "Turn right and walk forward to face the dining room table.",
                        "Place the keys in the box on the table.",
                        "Pick up the box on the table.",
                        "Turn left and walk forward to face the back of the red arm chair.",
                        "Place the box on the red arm chair."
                    ],
                    "task_desc":"To put a set of keys in a box as well as move them to the red arm chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2JBNDG0U9IA6I_3NG53N1RLYAIAYNXW2N9STOHZDDP83",
                    "high_descs":[
                        "Turn right and move forward slightly then turn right and walk straight to the lamp",
                        "Pick up the keys from the table next to the lamp and sofa",
                        "Turn around and walk straight to the door then turn left and walk to the kitchen table with a box on it and face it",
                        "Place the keys in the box on the table",
                        "Pick up the box with the keys inside",
                        "Turn left walk straight slightly then turn right and walk to the red sofa chair and face it",
                        "Place the box on the seat cushion of the red chair"
                    ],
                    "task_desc":"Move keys to a box on the chair ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Chair",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-ArmChair-205/trial_T20190909_105101_647626/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3D3VGR7TA36HLEX6XDW267GLKATR3R",
                    "high_descs":[
                        "Turn right and walk to the table then turn left.",
                        "Pick up the keys that are by the statue.",
                        "Take a step to your left then walk to the red chair then turn right and walk past the red chair then turn left and walk to the laptop then turn left and walk to the right side of the red couch.",
                        "Put the keys in the box that's on the couch.",
                        "Pick up the box with the keys in it.",
                        "Turn around and walk to the fireplace then turn right and walk to the back of the red chair that's on your right.",
                        "Put the box on the red chairs cushion."
                    ],
                    "task_desc":"Put a box with keys in it on the chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1OWHPMKE7YAGL_3T3IWE1XG9EM8UG0ZDDTJUAEIMNQTN",
                    "high_descs":[
                        "Turn to the right, go to the dining table where the statue is.",
                        "Pick up the keys on the corner of the table.",
                        "Turn to the left, go forward, hang a right and go to the chair, hang a right, go forward, go the the left to the couch with the cardboard box on it.",
                        "Put the keys inside the cardboard box that is on the couch.",
                        "Pick up the cardboard box containing the keys from the couch.",
                        "Turn to the left, go forward, hang a left, go to the fireplace, hang a right and go to the table, turn around and go to the back of the chair.",
                        "Put the cardboard box down in the chair."
                    ],
                    "task_desc":"Put a box containing a set of keys in a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3UXUOQ9OKHO7NGCCXED6OY3RP6HA7T",
                    "high_descs":[
                        "Turn right and walk to the glass table on the left.",
                        "Pick up the set of keys to the left of the statue on the table.",
                        "Turn left, take a right to the red chair, take a left to the fireplace and walk to the red couch on the left.",
                        "Put the set of keys inside the cardboard box on the right side of the couch.",
                        "Pick up the box with the keys inside from the couch.",
                        "Turn around and walk to back side of the red chair to the right.",
                        "Put the box with the keys inside on the cushion of the red chair."
                    ],
                    "task_desc":"Place a box with a set of keys on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-Sofa-205/trial_T20190911_061501_585605/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_36H9ULYP65BNID8ODVZE43ZPIHZJFT",
                    "high_descs":[
                        "turn right and move to the end of the room, then hang a left and move to the that end of the room, turn left and face the black table",
                        "pick up the cardboard box on the floor in front of the black table",
                        "turn left and move to the red couch on the right side of the room",
                        "place the cardboard box on the couch",
                        "turn around and walk nearly to the end of the room, then turn right and walk to the table near the end of the room, approach the right side of the table and face it",
                        "grab the keys off of the table there",
                        "turn left and find your way around all the objects in the room to get back to the couch on the left side of the room ",
                        "place the keys in the box on the right side of the couch and close the box"
                    ],
                    "task_desc":"place a box with keys in it on the right side of the red couch",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1AKL5YH9NLD2V_3A0EX8ZRNB5N0LR7UTELV0NSGKCYBA",
                    "high_descs":[
                        "Turn to your right and walk forward, then hang a left when you reach the wall, then turn left and walk to the box next to the nightstand.",
                        "Pick up the box next to the nightstand.",
                        "Walk to the red couch across from you.",
                        "Place the box on the right side of the couch, to the right of the remote.",
                        "Turn around and walk toward the fireplace, then hang a right and walk to the glass dining table.",
                        "Pick up the set of keys off the table that are furthest from the laptop.",
                        "Turn left and walk back toward the red couch next to the TV.",
                        "Place the keys inside the box on the couch and then close the box."
                    ],
                    "task_desc":"Place a closed box with a set of keys inside on the red couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3TVSS0C0E4HJ72QOFENIAX8YBMQWTJ",
                    "high_descs":[
                        "Begin waking forward, then turn right and walk across the room, then hang a left and walk over to where the cardboard box is resting on the ground.",
                        "Pick up the cardboard box off of the ground.",
                        "Turn left and walk over to the couch with two remotes and a credit card on it.",
                        "Place the cardboard box on the rightmost couch seat cushion to the right of the remote.",
                        "Turn left and take a step, then turn left again and walk over to the glass table with the laptop on it.",
                        "Pick up the keys off of the glass table.",
                        "Turn left and walk back over to where the cardboard box is resting on the couch.",
                        "Put the keys in the cardboard box and close the box."
                    ],
                    "task_desc":"Close a cardboard box with keys inside.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Box-None-Sofa-205/trial_T20190907_214830_497445/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_3B3WTRP3DEJEB7J33OTUVQRXE1892H",
                    "high_descs":[
                        "Turn to the right, go to the kitchen table",
                        "Pick up the box from the table, turn left",
                        "head to the red couch",
                        "put the box on the red couch"
                    ],
                    "task_desc":"Take the box from the kitchen table, put it on the red couch",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3HFNH7HEMKVAI08WJ5P5JPBNYKAQGW",
                    "high_descs":[
                        "Move to the glass table where the empty box is sitting",
                        "Pick up the empty box on top of the glass table",
                        "Carry the box to the left side of the large red sofa",
                        "Place the empty box on top of the sofa on the far left side"
                    ],
                    "task_desc":"Move an empty box to the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3ZAK8W07I7V5ZP4SMCK78YLWUN60UL",
                    "high_descs":[
                        "Turn and stand in front of the box on the table.",
                        "Pick the box up from the table.",
                        "Go left and then left again to stand in front of the red couch with the pillow on it.",
                        "Put the box on the couch to the left of the pillow."
                    ],
                    "task_desc":"Put a box on the couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "train/pick_and_place_simple-Box-None-Sofa-205/trial_T20190907_214755_478301/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_31UV0MXWNTTZL5VTP1156QTCH23I5T",
                    "high_descs":[
                        "Move to the clear glass table facing the cardboard box in top of the table",
                        "Pick up the cardboard box that is on top of the table",
                        "Carry the cardboard box to the large red sofa next to the area rug",
                        "Place the empty box on top of the sofa to the left of the laptop"
                    ],
                    "task_desc":"Move an empty box to the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6SR4BU227GUH_3QAVNHZ3EPLYHCFG50PZ6H1QQKDALK",
                    "high_descs":[
                        "Head left to the glass table.",
                        "pick up the cardboard box on the table",
                        "go straight from the table to the red coach, go around the couch, make a left, and proceed straight to the couch with the portable computer sitting on it",
                        "place the cardboard box to the left of the computer"
                    ],
                    "task_desc":"Move a cardboard box from a kitchen table to a couch",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3T111IHZ5H7VFR0OIE8VWYZ5QV59RH",
                    "high_descs":[
                        "Move to the dining table to the left of the door",
                        "Pick up a box from the table",
                        "Move to the couch to the left of the TV",
                        "Place the box on the couch"
                    ],
                    "task_desc":"Put a box on the couch next to the laptop",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Laptop"
            ]
        },
        "train/look_at_obj_in_light-Watch-None-FloorLamp-205/trial_T20190908_042518_905827/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_33PPO7FECYWUPIAM47JO42H4USTIDB",
                    "high_descs":[
                        "Turn right, walk forward a few steps before hanging a right at the ottoman, walk behind the burgundy chair, then walk a few steps forward and face the table that is on your left. ",
                        "Pick up the watch that is closest to you. ",
                        "Turn around to face the wall, walk forward to the wall, then make a right to walk to the floor lamp. ",
                        "Turn off the lamp that is in front of you."
                    ],
                    "task_desc":"Turn off the floor lamp with a watch in hand. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_39KFRKBFIQC7JFGGYYJ71KNROPXOYJ",
                    "high_descs":[
                        "Turn right, walk toward the fireplace, turn right and walk to the dining table.",
                        "Pick up the watch on the table that is closest to the laptop.",
                        "Turn around and walk to the floor lamp that is to the left of the red sofa.",
                        "Turn off the lamp."
                    ],
                    "task_desc":"Examine a watch by the dim natural light of a living room.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6QFAYKNRSO75_3NJM2BJS4ZNC1CRCH6EXTT0YV6ACPF",
                    "high_descs":[
                        "turn right walk to the end of the rug, turn right walk until you pass the couch, turn right walk until you reach the edge of the couch, turn left walk until you reach the chair, turn left to face the table",
                        "pick up watch in front of the remote",
                        "turn around walk until you reach wall, turn right walk until you reach lamp",
                        "look up, turn off lamp"
                    ],
                    "task_desc":"pick up watch from table, turn off lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-205/trial_T20190909_114633_189769/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3COPXFW7XE325ZPY5RKCIYX8UCBPKO",
                    "high_descs":[
                        "Turn around and walk forward to the key chain on the small black table.",
                        "Pick up the key chain from the table.",
                        "Walk slightly to the left and turn right to face the tall lamp.",
                        "Turn off the lamp."
                    ],
                    "task_desc":"Examine a key chain by the dim natural light of a living room.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3OONKJ5DKFAJRW93KEU4UV9SXD8BOB",
                    "high_descs":[
                        "Turn around and cross the room to face the small table to the right of the floor lamp.",
                        "Pick the keys up from the table.",
                        "Move to the left and face the lamp.",
                        "Turn the lamp near the wall off."
                    ],
                    "task_desc":"Pick up keys and turn a lamp off.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3QBD8R3Z24AZ6XOU5ZKHMH3MNLKO4B",
                    "high_descs":[
                        "Turn around and walk table in front of you.",
                        "Pick up the keys on the table.",
                        "Take a step left.",
                        "Turn off the lamp."
                    ],
                    "task_desc":"Turn off a lamp while holding keys.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-205/trial_T20190909_114650_476616/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_31IBVUNM9VQ4UXUGQS2E8DUL85EFVI",
                    "high_descs":[
                        "Make a right around the couches towards the tall lamp.",
                        "Pick up the keys next to the lamp.",
                        "Turn to face the lamp.",
                        "Turn the power off of the lamp."
                    ],
                    "task_desc":"Pick up the keys near the lamp to turn it off.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_358010RM5HKLUJL1QM80EKUSCADVXS",
                    "high_descs":[
                        "Turn right, hang a right at the table, and walk to the small round table on the right.",
                        "Pick up the set of keys on the left side of the table.",
                        "Turn left and walk to the tall lamp on the right.",
                        "Turn off the tall lamp next to the small table."
                    ],
                    "task_desc":"Examine a set of keys by the lack of light from a tall lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3QILPRALQ8MI7DBKGNAHO4JMZY68NK",
                    "high_descs":[
                        "Turn right and go around the sofa on the right to the small black round end table next to the lamp.",
                        "Pick up the keys on the left side of the end table. ",
                        "Move over left to the lamp.",
                        "Turn off the lamp and look at the keys."
                    ],
                    "task_desc":"Look at the keys with lamp turned off. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-ArmChair-205/trial_T20190908_082607_110365/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_32SVAV9L3I0PMXBPV2AGBHRBKM13AN",
                    "high_descs":[
                        "Turn to the right and walk to the table.",
                        "Close the laptop and pick it up from the table. ",
                        "Turn to the left and walk to the back of the armchair with the ottoman. ",
                        "Place the laptop on the seat of the armchair. "
                    ],
                    "task_desc":"Moving a laptop from a table to a chair. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3Z4XG4ZF4BINJ7POITXQM6AK1T1X8C",
                    "high_descs":[
                        "Turn around, hang a left at the black round table and walk to the glass table across the room.",
                        "Close the lid of the laptop computer on top of the table and pick it up.",
                        "Turn around and walk to the back of the red chair to the left.",
                        "Put the laptop computer in the middle of the cushion of the red chair."
                    ],
                    "task_desc":"Place a laptop computer on a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3LBXNTKX0UMNXC8YNL34M25VL0UX9E",
                    "high_descs":[
                        "Turn around and walk to the table.",
                        "Close the laptop and pick it up.",
                        "Turn around and walk to the brown armchair.",
                        "Put the laptop on the armchair."
                    ],
                    "task_desc":"Put the laptop on the brown armchair.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Chair",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-ArmChair-205/trial_T20190908_082554_250199/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2YUCJ28XANFOX_336KAV9KYTJ1XXD978ARVT4QHZ32YK",
                    "high_descs":[
                        "Turn left at the couch and walk to the table ",
                        "close the computer on the table and pick it up",
                        "Turn to the left and cross the room to the chair ",
                        "place the computer on the chair"
                    ],
                    "task_desc":"move the computer from the table to the chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ADXRJFEHIDXRE_3V5Q80FXI0I0HUGLINH15Z8D8Y832F",
                    "high_descs":[
                        "Turn right and walk to the table with the laptops on it.",
                        "Close the laptop on the right and then pick it up.",
                        "Turn around and walk to the back of the red sofa.",
                        "Put the laptop down on the seat of the red sofa."
                    ],
                    "task_desc":"Pick up a laptop and put in on the red sofa.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2NGMLBFZ3YQP5_3CP1TO84PWS3V93PW65UKW6XMUZ527",
                    "high_descs":[
                        "Turn left, walk to table with laptops on it.",
                        "Pick up the laptop on the right.",
                        "Turn left, turn left, turn left, face back of armchair.",
                        "Put laptop on the seat of the armchair."
                    ],
                    "task_desc":"Put a laptop on the armchair.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Box-SideTable-205/trial_T20190911_191424_759852/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A16184N1RO5OJV_30JNVC0ORCBW3LP5ZJW45B7Q7BSQHF",
                    "high_descs":[
                        "Turn around, walk straight, turn right near the lamp, walk straight, turn left at the end of the couch, walk straight a little bit and turn left to go to the box on the couch. ",
                        "Pick up a credit card next to the box on top of the couch",
                        "Walk slightly to the right to be in front of the box. ",
                        "Put the credit car in the box. ",
                        "Pick up the box that has a credit card in it. ",
                        "Turn around and turn left to go to the table beside the TV cabinet. ",
                        "Put the box on top of the table. "
                    ],
                    "task_desc":"Put a box with a credit card in it, on top of the table beside the TV cabinet. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3VA45EW49QEIEYRBIH1FOJWJBLJ1OO",
                    "high_descs":[
                        "Go to the sofa",
                        "Pick up a credit card from the sofa",
                        "Go to the box on the right of the sofa",
                        "Place the credit card in the box",
                        "Pick up the box",
                        "Go to the small round table",
                        "Place the box on the table"
                    ],
                    "task_desc":"Place a box with a credit card in it on a table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3T9K2RY06UO14_3IAEQB9FMHBKB2GPPWCK6FAE3LXDWG",
                    "high_descs":[
                        "Turn and go to the sofa.",
                        "Pick up a credit card on the sofa.",
                        "Turn right and go to the box on the sofa.",
                        "Put the credit card in the box on the sofa. ",
                        "Pick up the box on the sofa. ",
                        "Turn and go to the round table by the television.",
                        "Put the box on the round table."
                    ],
                    "task_desc":"Move the box on the sofa to the round table. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Box-SideTable-205/trial_T20190908_124856_235789/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3B837J3LDRNL5VILNSX3EFOXC9ESR8",
                    "high_descs":[
                        "Take a step forward then turn left and walk across the room, hang a left and walk up to the left side of the red couch.",
                        "Pick up the red credit card off of the red couch.",
                        "Turn right and take a step forward, then turn left to face the couch.",
                        "Put the red credit card in the cardboard box on the couch.",
                        "Pick up the cardboard box with the credit card in it off of the couch.",
                        "Walk over to the round black table to the right of the television.",
                        "Put the cardboard box with the credit card in it on the round black table."
                    ],
                    "task_desc":"Put a cardboard box with a credit card in it on a round black table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3HQUKB7LNI5JQSQ2GT9AWXFPGP2HHI",
                    "high_descs":[
                        "Turn left at the window, turn left at the rug,  and face the box on the red couch. ",
                        "Pick up the credit card in front of the box. ",
                        "Move over to the right a bit and face the box. ",
                        "Put the credit card inside of the box. ",
                        "Pick up the box from the couch. ",
                        "Turn around and walk to the small table to the right of the television. ",
                        "Place the box on the small table. "
                    ],
                    "task_desc":"To put a credit card in a box and put the box on a small table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3SKRO2GZ74IZO76WKP9MH2FARH6K1M",
                    "high_descs":[
                        "Turn left, go past the ottoman, turn left, go to the box on the couch. ",
                        "Pick up the red credit card on the couch. ",
                        "Bring the card to the box on the couch.",
                        "Put the card in the box on the couch. ",
                        "Pick up the box with card on the couch. ",
                        "Turn around, bring the box to the middle of the room by the ottoman, turn left, go to the small black round table.",
                        "Put the box on the round table."
                    ],
                    "task_desc":"Put a box with credit card on the small, round, black table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Box-SideTable-205/trial_T20190912_004956_443783/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_3FTF2T8WLU988C38DG7IKJROC1P9W4",
                    "high_descs":[
                        "Turn left, hang a left at the table and walk to the red couch on the left.",
                        "Pick up the red credit card from the left cushion on the couch.",
                        "Turn right and walk to the right side of the couch to your left.",
                        "Put the credit card inside the cardboard box on the right couch cushion.",
                        "Pick up the cardboard box with the credit card inside on the couch.",
                        "Turn around, hang a left at the red ottoman and walk to the round table next to the television.",
                        "Put the box with the credit card inside on top of the round table."
                    ],
                    "task_desc":"Place a box with a card on a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3GNCZX450LEWTMGCT07NOKUCPKRPAN",
                    "high_descs":[
                        "Turn left and walk towards the wall, then hang a left and walk over to the red couch.",
                        "Pick up the red credit card off of the couch cushion.",
                        "Turn right and walk forward then turn left to face the couch.",
                        "Put the red credit card in the cardboard box on the couch.",
                        "Pick up the cardboard box with the credit card in it off of the couch.",
                        "Walk over to the small black table next to the television behind you.",
                        "Put the cardboard box with the credit card in it on the table."
                    ],
                    "task_desc":"Put a cardboard box with a credit card in it on a round black table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3MAOD8E57T18MECSOVM9430FQQFNX9",
                    "high_descs":[
                        "Go to the sofa",
                        "Pick up the credit card from the sofa",
                        "Go to the box on the sofa",
                        "Place the credit card in the box",
                        "Pick up the box",
                        "Go to the round black table",
                        "Place the box on the round black table"
                    ],
                    "task_desc":"Move a box and keys from a sofa to a table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CreditCard",
                "Pillow",
                "KeyChain"
            ]
        },
        "valid_seen/pick_two_obj_and_place-Watch-None-Dresser-205/trial_T20190907_182211_592010/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A32W24TWSWXW_3QFUFYSY91WXFVP3AOCAY1A61CSF42",
                    "high_descs":[
                        "Take one step to the right, turn left for several steps, turn right past the red chair, turn right for one steps, take a left and stop at the table. ",
                        "Pick up the watch from the table that is next to the lap top, closest to the wall.",
                        "Turn to the left and walk three steps, turn right at the red chair for three steps, take a left for seven steps, turn left again for five steps, turn right and walk three steps to the TV stand.",
                        "Set the watch down on the TV stand, in front of the TV at the center of the stand.",
                        "Turn right for five steps, turn right and walk to the table with the lap tops.",
                        "Pick up the watch by the lap top on the table in front of the chair.",
                        "Turn around and walk eight steps, turn left for five steps, turn right for 3 steps, stop in front of the TV stand.",
                        "Put the watch on the TV stand to the left of the watch on the stand."
                    ],
                    "task_desc":"Pick up watches from the table, one-at-a-time, put them on the TV stand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        }
    }
}