{
    "scene_name":"FloorPlan316",
    "trials":{
        "train/look_at_obj_in_light-CD-None-DeskLamp-316/trial_T20190909_114559_561870/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3180JW2OT733151X3RBMJDSEOO25JD",
                    "high_descs":[
                        "Move to the night stand to the right of the head board of the bed",
                        "Open the top drawer of the night stand, remove the CD, shut the drawer",
                        "Carry the CD over to the right side of the wood desk top where the lamp is",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Move a CD while turning on a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3C6FJU71TTKAH9MBQSKX1CZI095UYF",
                    "high_descs":[
                        "Walk to the night stand in front of you then take a step to your right and walk to the wall then turn left.",
                        "Open the nightstand's drawer and grab the cd that's in there and close the drawer.",
                        "Turn left and walk to the desk then take a small step to your right.",
                        "Turn on the light."
                    ],
                    "task_desc":"Inspect a cd by lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3E337GFOLCZX0SH2ZLM5GH0KNH8NG4",
                    "high_descs":[
                        "Move to the right and face the night stand to the right of the bed.",
                        "Open the drawer of the night stand and pick up the disc.",
                        "Go left and cross the room to face the lamp on the desk.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Pick up a disc and turn a lamp on.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "Pencil",
                "AlarmClock",
                "Bowl",
                "Box",
                "BaseballBat",
                "CD",
                "Pillow",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-AlarmClock-None-Desk-316/trial_T20190911_000805_459094/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_3W2LOLRXLE6NHC5DIJO1NTXNVVLRK6",
                    "high_descs":[
                        "go to the left end of the desk",
                        "pick up the index filer",
                        "take the filer to the middle of the desk",
                        "set the object in front of and to the right of the monitor on the desk",
                        "go to the nightstand",
                        "pick up the calculator",
                        "take the calulator to the left end of the desk",
                        "put the calculator on the desk"
                    ],
                    "task_desc":"put a calculator and index filer on the middle of the desk",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_two_obj_and_place-AlarmClock-None-Desk-316/trial_T20190909_091102_448579/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2DN53DIE3049T_33L7PJKHCJPG2QG4DJWTX3PEOGJT8X",
                    "high_descs":[
                        "Turn around, walk to the nightstand",
                        "Pick up the alarm clock from the nightstand",
                        "Turn around, walk to the desk",
                        "Place the alarm clock on the desk",
                        "Turn back around, walk back to the nightstand",
                        "Pick up the alarm clock from the nightstand",
                        "Walk back to the desk",
                        "Place the alarm clock on the desk"
                    ],
                    "task_desc":"Collect alarm clocks, place on desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3IFS6Q0HJLA8CWF2X53U0NN6PTNSIS",
                    "high_descs":[
                        "Turn around and go to the small black end table on the right. ",
                        "Pick up the alarm clock up near the wall. ",
                        "Turn around and go to the front of the desk. ",
                        "Place the clock on the right side of the monitor on the desk. ",
                        "Turn around and go back to the small black end table. ",
                        "Pick up the remaining alarm clock from the table. ",
                        "Turn around and go back to the front of the desk. ",
                        "Place the clock on the left side of the desk on the right of the brown bowl. "
                    ],
                    "task_desc":"Move the alarm clocks from the end table to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Shelf-316/trial_T20190909_092853_746076/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_30BXRYBRP7O1NILRBSVAX0PCVTPHWO",
                    "high_descs":[
                        "Turn around and cross the room to stand in front of the desk where the computer is.",
                        "Pick the credit card up from the desk.",
                        "Move to the left and face the shelves under the computer on the desk.",
                        "Put the credit card on the top shelf under the computer on the desk."
                    ],
                    "task_desc":"Put a credit card on a shelf on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_39PAAFCODPRED2CHLC73PH9MZDBVTT",
                    "high_descs":[
                        "turn around, go to desk with laptop to the left of desk chair",
                        "pick up blue credit card in between book and laptop on desk",
                        "go to the left shelf of desk",
                        "place credit card on top shelf below desk"
                    ],
                    "task_desc":"place blue credit card on desk shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3AUQQEL7U8KDXTFQNAJT567H2250VD",
                    "high_descs":[
                        "Turn around and walk to the desk.",
                        "Pick up the credit card that is to the right of the laptop.",
                        "Take a step back and a side step left then look down at the trash can.",
                        "Put the credit card on the top shelf under the desk."
                    ],
                    "task_desc":"Put a credit card on the shelf under the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "CreditCard",
                "Book",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Shelf-316/trial_T20190909_092906_834375/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3PB5A5BD0YX8X7PFJE5GKKEUN267GG",
                    "high_descs":[
                        "Turn left and walk to the right side of the black nightstand.",
                        "Pick up the credit card on the nightstand.",
                        "Turn around and walk right to the left portion of the desk, to the right of the bin on the floor.",
                        "Place the credit card on the shelf of the desk, to the right of the alarm clock."
                    ],
                    "task_desc":"Place a credit card on a shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3TUI152ZZEELZA4RXUTJDORJQ241QV",
                    "high_descs":[
                        "Turn left and take a left at the wall to reach the small black table.",
                        "Pick up the blue credit card in the middle of the table.",
                        "Turn left and walk to wooden desk to the left.",
                        "Put the credit card on the black shelf below the desk to the right of the clock."
                    ],
                    "task_desc":"Place a credit card on a shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_31LVTDXBLA1Y1INV3J022TA2KUGRLX",
                    "high_descs":[
                        "Turn left and go to the right of the black drawer",
                        "Grab the credit card off of the drawer",
                        "Turn around and go to the left of the desk",
                        "Put the credit card next to the alarm clock under the desk"
                    ],
                    "task_desc":"Putting a credit card under a desk",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Shelf"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Shelf-316/trial_T20190909_092935_341684/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A13OOAT2ORKH6V_3BWI6RSP7J0ADTTODJFSKHTIAMS7E0",
                    "high_descs":[
                        "Walk to the night stand beside the bed.",
                        "Grab the credit card on the night stand.",
                        "Turn around and walk to the laptop on the desk to your left.",
                        "Place the credit card into the desk shelf underneath the laptop."
                    ],
                    "task_desc":"Place the credit card into the desk shelf underneath the laptop.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3P1L2B7AD4GV45VFBRJY8Y5X986OLX",
                    "high_descs":[
                        "Turn left and go to the bed, then turn right to go to the nightstand.",
                        "Pick up the credit card from the nightstand.",
                        "Turn around and move forward, then turn left to go toward the trash bin.",
                        "Put the credit card on the shelf, to the right of the trash bin and under the desk."
                    ],
                    "task_desc":"Move the credit card to the shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3BWI6RSP7J0ADTTODJFSKHTIANOE75",
                    "high_descs":[
                        "move forward to the drawer",
                        "pick up the card from the top of the drawer",
                        "turn right to the drawer under the table",
                        "place the card on the drawer"
                    ],
                    "task_desc":"place a card on the drawer under the table",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Drawer",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-Desk-316/trial_T20190908_102637_349583/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3X1FV8S5J0IA8XQB1C8WQYUX94FVG2",
                    "high_descs":[
                        "Turn right and walk to the bed. ",
                        "Pick up the cell phone from the bed that's behind the computer. ",
                        "Walk to the right side of the night stand to the right of the bed. ",
                        "Put the cell phone in the bowl on the night stand. ",
                        "Pick up the bowl from the night stand. ",
                        "Turn left and walk to the computer desk. ",
                        "Put the bowl down on the desk in front of the computer monitor on the right. "
                    ],
                    "task_desc":"To move a bowl to the computer desk. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3YDTZAI2W07EA5HTZXM6ALQEUTM14F",
                    "high_descs":[
                        "Turn to the right to move to the bed.",
                        "Pick up the cell phone from the far side of the bed.",
                        "Carry the cell phone and turn around and then left to face the short side of the small black table.",
                        "Place the cell phone on the plate on the small table.",
                        "Pick up the plate from the small table.",
                        "Carry the small plate and turn to the left, then turn left again before the large desk.",
                        "Place the plate on the large desk, to the right side next to the monitor."
                    ],
                    "task_desc":"Move a cell phone and plate to a large desk.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3NGI5ARFTWW0ZY3CXHEUDJ19L381PO",
                    "high_descs":[
                        "Walk ahead a step, then turn right to the bed.",
                        "Pick up the cell phone on the bed.",
                        "Turn right and walk to the right side of the night stand.",
                        "Place the cell phone in the bowl on the night stand.",
                        "Pick up the bowl.",
                        "Turn left and walk to the desk.",
                        "Place the bowl on the desk to the right side of the monitor."
                    ],
                    "task_desc":"Place a bowl with a cell phone in it on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-Desk-316/trial_T20190919_035835_751944/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3IX2EGZR7EAS6SZV0YOPMEXAGP3JRJ",
                    "high_descs":[
                        "Walk forward then turn left on the desk",
                        "Pick up the cell phone on the right side of the desk",
                        "Turn right then head to side table of the bed",
                        "Put the cell phone in the bowl",
                        "Pick up the bowl with cell phone on the side table",
                        "Turn right then cross the room head to the left side of the desk ",
                        "Put the bowl with cell phone on the desk near the monitor"
                    ],
                    "task_desc":"Put the bowl with cell phone on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3YZ8UPK3VWDXE6L6U0284L7ZX5KCUQ",
                    "high_descs":[
                        "turn around, walk to face the desk",
                        "pick up the right most cell phone from the desk top",
                        "turn around, walk to face the night stand to the right of the bed",
                        "put the phone into the brown container on the night stand",
                        "pick up the container",
                        "walk right to face the right side of the desk",
                        "put the container on right side of the desk"
                    ],
                    "task_desc":"put a container and phone onto a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3Z4AIRP3C9458753J8OB7WNCNPZ1X4",
                    "high_descs":[
                        "Turn to the left to locate the brown desk. ",
                        "Pick up the cell phone from the right side of the desk.",
                        "Carry the cell phone and turn around to go to the black table beside the bed.",
                        "Place the cell phone in the bowl on the black table.",
                        "Pick up the bowl from the black table.",
                        "Carry the bowl and turn around then left to find the desk chair.",
                        "Place the bowl and cell phone on the far side of the desk, to the left of the monitor."
                    ],
                    "task_desc":"Move a cell phone and bowl to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-Desk-316/trial_T20190919_065219_673967/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A11LSO6D7BMY99_369J354OFG1PT7BA040OE6EYSAN6GJ",
                    "high_descs":[
                        "turn to your left to the wooden table",
                        "pick up the cell phone from the table",
                        "turn around; carry the phone to the bed",
                        "put the phone into the bowl that is on the nightstand next to the bed",
                        "pick up the bowl with the phone in it",
                        "take the bowl to the desk where the chair is",
                        "place the bowl and phone on the desk next to the computer"
                    ],
                    "task_desc":"put a phone in a bowl on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3D8YOU6S9HB8YPC5K9P5ILFP1JY6UH",
                    "high_descs":[
                        "Turn left, proceed to desk.",
                        "Pick up phone off of desk to the left of the lamp.",
                        "Turn around, go to wall.  Turn left to face nightstand.",
                        "Put phone in bowl on nightstand.",
                        "Pick up bowl with phone in it from nightstand.",
                        "Turn left, cross room.  Turn left to face desk.",
                        "Place cup with phone in it to your right on desk in front of computer monitor."
                    ],
                    "task_desc":"Put phone in cup, move both to desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3PM8NZGV817TPBPK4NEQ8XVKV1ZXQ3",
                    "high_descs":[
                        "Turn left and go forward to the desk.",
                        "Pick up the cell phone on the desk, next to the lamp.",
                        "Turn around, go straight to the wall, then turn left to face the night stand.",
                        "Put the cell phone in the bowl, on the night stand.",
                        "Pick up the bowl the cell phone in it.",
                        "Turn left go forward to the desk, then turn left.",
                        "Put the bowl on the desk, in front of the computer monitor."
                    ],
                    "task_desc":"Put a bowl with a cell phone in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-AlarmClock-None-Shelf-316/trial_T20190909_010429_853588/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_358010RM5HKLUJL1QM80EKUSCY3XVW",
                    "high_descs":[
                        "Go forward to the front of the L shaped desk. ",
                        "Pick up the black alarm clock in front of the monitor. ",
                        "Turn left and go to the front left side of the desk. ",
                        "Place the alarm clock in the top drawer shelf below the desk. ",
                        "Move over to right in front of the alarm clock on top.",
                        "Pick up the alarm clock on the left of the monitor. ",
                        "Move back left to the front of the drawer shelf.",
                        "Place the alarm clock on the right of the first alarm clock on the top shelf."
                    ],
                    "task_desc":"Move the alarm clocks on the desk to the drawer shelf. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_two_obj_and_place-AlarmClock-None-Shelf-316/trial_T20190909_010454_432892/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1G1OO4IWM8EP5_3DEL4X4EL9C2YDG6VXVKLJYMUFWYXX",
                    "high_descs":[
                        "Turn around opposite from the bed and walk toward the desk.",
                        "Pick up the alarm clock on the desk.",
                        "Move to the left of the desk.",
                        "Put the alarm clock down on the first shelf.",
                        "Turnaround and walk toward the bed.  Turn right at the bed and walk toward the table.",
                        "Pick up the alarm clock.",
                        "Turnaround, and turn left.  Walk toward the desk.",
                        "Put the alarm clock down on the first shelf with the other clock."
                    ],
                    "task_desc":"Moved both alarm clocks to the first shelf of the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/look_at_obj_in_light-CellPhone-None-DeskLamp-316/trial_T20190907_075501_181242/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_36TFCYNS47R8RT4JPP2FYXJHACEHX1",
                    "high_descs":[
                        "Turn around and walk towards the the desk.",
                        "Pick up the phone to the left of the lamp.",
                        "Take a step to the right.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a phone next to the light of a lamp  on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3BF51CHDTYR0U3Y8MDD8PJW60550H1",
                    "high_descs":[
                        "Turn around then head towards the wooden desk to the left of the plant",
                        "Pick up the phone sitting on top of the desk to the left of the lamp",
                        "Carry the phone while moving towards the lamp on top of the desk",
                        "Turn on the lamp while holding the phone"
                    ],
                    "task_desc":"Carry a phone to the lamp, turn on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3JAOYWH7VLLKCT5BDUBZAMQ6KPGL9B",
                    "high_descs":[
                        "Turn around and face the table near the phone.",
                        "Pick the phone up from the table.",
                        "Move to the right and stand in front of the lamp on the right side of the table.",
                        "Turn the lamp on the table on."
                    ],
                    "task_desc":"Turn a lamp on with a phone in hand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "Pencil",
                "CD",
                "AlarmClock",
                "Bowl",
                "BaseballBat",
                "Box",
                "Pillow",
                "CellPhone",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-AlarmClock-None-DeskLamp-316/trial_T20190906_202305_162111/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_34PGFRQONRSPTZUJ3K9E8RLPDABWJ6",
                    "high_descs":[
                        "Go behind the chair near the desk ahead.",
                        "Take the black object to the right of the chair.",
                        "Turn around, go to the end of the table near phone and lamp.",
                        "Turn the lamp on that is on the table."
                    ],
                    "task_desc":"Inspect a black object by a lit lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3FIUS151DYJJ5BEIG9KTPB7LRUBGGU",
                    "high_descs":[
                        "Turn and walk over to the right side of the desk by the desk chair",
                        "Pick up the black box from the desk",
                        "Turn right and walk to the right side of the desk",
                        "Turn on the lamp on the right side of the desk"
                    ],
                    "task_desc":"Examine the black box under the light of the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2L22HZ50T83UK_3O6CYIULEGIY7F5DFJDSFTU0UQHWUA",
                    "high_descs":[
                        "Turn right then left and walk forward until you are standing behind the desk chair. ",
                        "Pick up the black tray under the desk. ",
                        "Walk over to the edge of the desk and stand in front of the desk lamp with the tray in your hand. ",
                        "Turn on the desk lamp."
                    ],
                    "task_desc":"Switch on the desk lamp while carrying a tray. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Laptop"
            ]
        },
        "train/look_at_obj_in_light-Box-None-DeskLamp-316/trial_T20190908_233127_359423/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_34X6J5FLPWPSURKVNJZPHON5K8CQJA",
                    "high_descs":[
                        "walk to face right side of desk",
                        "pick up box underneath of the desk ",
                        "turn slightly right, continue to face the desk",
                        "turn on the lamp on the desk"
                    ],
                    "task_desc":"turn on a desk lamp with a box in hand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3EKVH9QME1VYZMIIBCNDI8UPZI42DX",
                    "high_descs":[
                        "Turn around and go to the desk behind you. ",
                        "Pick up the cardboard box that is on the floor, underneath the desk. ",
                        "Stand up and move over to the right end of the desk. ",
                        "Turn on the lamp on the back, right side of the desk. "
                    ],
                    "task_desc":"Turn on the desk lamp. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3YT88D1N0BPVYAKB7TN55VU7P513KM",
                    "high_descs":[
                        "Turn around and walk to the wooden desk ahead.",
                        "Pick up the cardboard box from under the desk on the floor.",
                        "Turn right and walk to the small lamp on the desk to the left.",
                        "Turn on the small lamp on the right corner of the desk."
                    ],
                    "task_desc":"Examine a box by the light of a small lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "DeskLamp"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-SideTable-316/trial_T20190909_135229_925643/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_354P56DE9NUBNCY6EEZX9YXXBEX7SZ",
                    "high_descs":[
                        "Turn right, move to the desk.",
                        "Pick up the pencil on the desk. ",
                        "Bring the pencil to the bowl to the right on the desk behind the keys.",
                        "Put the pencil in the bowl on the desk. ",
                        "Pick up the bowl with pencil on the desk.",
                        "Turn around, bring the bowl to the small table on the right side of the bed.",
                        "Put the bowl with pencil on the table."
                    ],
                    "task_desc":"Put a bowl with a pencil in it on the table next to the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OJSZ2ATDVNAHA0V2IMPGNN5XTM57Q",
                    "high_descs":[
                        "Walk forward, then turn right and walk up to the wooden desk.",
                        "Pick up the blue pencil off of the shelf below the wooden desk.",
                        "Turn around and walk towards the bed, the hang a left and walk up to the wooden desk.",
                        "Put the blue pencil in the wooden bowl that is on the desk.",
                        "Pick up the wooden bowl with the pencil in it.",
                        "Turn around and walk to the wall, then turn right and take a step forward and turn around.",
                        "Put the wooden bowl with the pencil in it on the small black nightstand in front of you."
                    ],
                    "task_desc":"Put a wooden bowl with a pencil in it on a black nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3WMINLGALEUDZX78OVLH4KV5QICCAU",
                    "high_descs":[
                        "Turn right and go to the desk.",
                        "Pick up the pencil from the shelf below the desk.",
                        "Turn around and move forward, then turn left to go to the desk.",
                        "Put the pencil in the bowl on the desk.",
                        "Pick up the bowl from the desk.",
                        "Turn around and go to the wall, then go to the nightstand to your left.",
                        "Place the bowl on the nightstand."
                    ],
                    "task_desc":"Put a bowl with a pencil in it on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-SideTable-316/trial_T20190909_135112_645931/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_37W3JXSD69ZN9DBGLSZYJ0KFLQ7YWB",
                    "high_descs":[
                        "Turn left and walk to the end of the desk.",
                        "Pick up the blue pencil on the desk.",
                        "Turn right and face the monitor.",
                        "Place the pencil in the tan bowl on the desk.",
                        "Pick up the bowl on the desk.",
                        "Turn around and walk ahead, veering right to the nightstand on the right side of the bed.",
                        "Place the bowl on the nightstand, near the front left corner."
                    ],
                    "task_desc":"Place a bowl with a pencil in it on a nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3B3WTRP3DETMWW51ZWIBWCBZ89U299",
                    "high_descs":[
                        "Turn left and move to the left end of the desk to the right of the silver rubbish bin.",
                        "Pick up the blue pencil to the right of the drawers from the desk.",
                        "Turn to the right and face the wheeled office chair.",
                        "Place the pencil in the brown bowl in front of the monitor on the desk.",
                        "Pick up the bowl containing the pencil from the desk.",
                        "Turn around, move towards the mirror on the door, then turn left and move to the black nightstand to the right of the bed.",
                        "Place the bowl containing the pencil on the nightstand to the left of the alarm clock."
                    ],
                    "task_desc":"Place a bowl containing a pencil on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3OS4RQUCRC6PLJWALBBE710E5EUFBA",
                    "high_descs":[
                        "Turn left and go to the wooden desk to its left side.. ",
                        "Pick up the blue pencil on the top of the desk.",
                        "Turn right to face the middle of the desk. ",
                        "Place the pencil in the brown bowl on the left.",
                        "Pick up the brown bowl with the pencil in it. ",
                        "Turn around and go to the black end table on the left.",
                        "Place the brown bowl with the pencil in it on the top of the end table."
                    ],
                    "task_desc":"Move the brown bowl with the pencil in it to the table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-SideTable-316/trial_T20190909_135206_431058/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_31T4R4OBOV7VGV9AHS9XUTTFPAL7CD",
                    "high_descs":[
                        "walk to face desk",
                        "pick up blue pencil from desk",
                        "put pencil in bowl on desk",
                        "pick up bowl from desk",
                        "walk to face night table",
                        "put bowl on night table"
                    ],
                    "task_desc":"put bowl with a pencil on night table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3G5W44VEUA9WSMWZ28UPOPJGTNFGK6",
                    "high_descs":[
                        "go to monitor on desk in front of chair",
                        "pick up blue pencil from in front of monitor",
                        "place blue pencil in brown bowl on desk ",
                        "pick up brown bowl with pencil",
                        "turn around, go to black dresser next to bed",
                        "place brown bowl with pencil on black dresser"
                    ],
                    "task_desc":"place brown bowl with blue pencil on black dresser",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3KJYX6QCMC2KZZGC9ITZNBMD1C3JVX",
                    "high_descs":[
                        "Turn left and move forward, then turn right to face the desk.",
                        "Pick up the pencil on the desk, in front of the computer.",
                        "Put the pencil in the bowl, in front of the alarm clock.",
                        "Pick up the bowl from the desk.",
                        "Turn around and go to the door, then turn left to go to the end table.",
                        "Put the bowl on the end table."
                    ],
                    "task_desc":"Put a bowl with a pencil in it on the end table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Desk-316/trial_T20190909_053356_708088/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_34QN5IT0T2IFMHJDFH8JDSN9RWX08L",
                    "high_descs":[
                        "turn right, walk towards the bed",
                        "pick up the phone that is on the bed",
                        "turn around, walk forward to the desk",
                        "put the phone on the desk"
                    ],
                    "task_desc":"move a phone from the bed to the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3IUZPWIU1RYSP8MZHDY7AS54N18WK4",
                    "high_descs":[
                        "Turn around and walk to the bed. ",
                        "Pick up the cell phone from the bed. ",
                        "Turn around and walk to the desk. ",
                        "Put the cell phone down on the desk in front of the monitor. "
                    ],
                    "task_desc":"To move a cell phone to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3LEIZ60CDMQC278DO3RPJNL6T9Z9ZC",
                    "high_descs":[
                        "Turn right, go forward to the bed.",
                        "Take the cell phone from the bed.",
                        "Turn around, go forward to the desk.",
                        "Put the phone to the front right of the monitor on the desk."
                    ],
                    "task_desc":"Put a cell phone on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Pillow",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Desk-316/trial_T20190911_210304_361742/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_320DUZ38GAD1H2QHKNUDNAJ3EP7GJH",
                    "high_descs":[
                        "Turn left and walk to the bed.",
                        "Pick up the cell phone on top of the blue blanket.",
                        "Turn around and walk a few steps ahead.",
                        "Place the cell phone on the desk near the chair and the cup."
                    ],
                    "task_desc":"Place a cell phone on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3KB8R4ZV1HYVZJS5WVHWPM0Q6KYBGR",
                    "high_descs":[
                        "Turn left then head to the bed ",
                        "Pick up the phone on the bed ",
                        "Turn left then cross the room face the desk",
                        "Put the phone on the right side of the desk"
                    ],
                    "task_desc":"Put the phone from the bed to the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3S0TNUHWKW99L1K7RTWESZ7SLMZ8DH",
                    "high_descs":[
                        "to the right bottom corner of the bed",
                        " pick up the phone from the bed",
                        "take the phone to the desk",
                        "put the phone on the desk"
                    ],
                    "task_desc":"take the phone from the bed to the desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "CellPhone",
                "Bed"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Desk-316/trial_T20190911_203517_902296/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_31QTRG6Q2W4XP4EF96L3R6CJSJCPYV",
                    "high_descs":[
                        "Turn around and walk forward, turning left to face the small dark night stand",
                        "Pick up the cell phone from the night stand",
                        "Turn left and walk over to the wood desk",
                        "Put the cell phone down on the desk "
                    ],
                    "task_desc":"Put the cell phone on the desk ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_39N5ACM9HHEIO3671UTNSPJSJAIP9X",
                    "high_descs":[
                        "Turn around and walk to the stand to the right of the bed.",
                        "Pick up the cell phone on the stand.",
                        "Turn around an walk to the desk.",
                        "Place the cell phone on the desk, near the chair."
                    ],
                    "task_desc":"Place a cell phone on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3CN4LGXD50FB0BSWBMTFO81O1NEY4B",
                    "high_descs":[
                        "turn around and walk to the night stand to the right of the bed. ",
                        "Pick up the cell phone to the right of the alarm clock. ",
                        "Turn around and walk to the desk on the other side of the room. ",
                        "Put the cell phone down on the desk to the right of the chair. "
                    ],
                    "task_desc":"To move a cell phone to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-Pencil-None-Drawer-316/trial_T20190907_003822_891019/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_3WAKVUDHUZXJH04C7B5GNDVJ12HU7L",
                    "high_descs":[
                        "Walk forward to the side table by the bed.",
                        "Take the blue pencil from the table.",
                        "Turn around, then face the table again and open the drawer.",
                        "Put the blue pencil in the drawer and close it.",
                        "Turn right, then left again to face the drawer.",
                        "Pick up the blue pencil from behind the alarm clock.",
                        "Turn left and face the drawer in front of you.",
                        "Open the drawer and put the pencil inside and close it."
                    ],
                    "task_desc":"Put pencil away in a drawer.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3A0VPWPASCO9J_3HHRAGRYXBMSIE88QMRR23U0E7HO9G",
                    "high_descs":[
                        "Walk to the end table next to the bed.",
                        "Pick up the blue pencil in front of the alarm clock.",
                        "Walk to the side of the end table.",
                        "Open the drawer in the end table, put the pencil inside, and close the drawer.",
                        "Walk back up to the end table.",
                        "Pick up the blue pencil to the right of the alarm clock.",
                        "Walk back to the front of the end table.",
                        "Open the drawer in the end table, put the pencil inside, and close the drawer."
                    ],
                    "task_desc":"Put the pencils in the drawer of the end table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3X4MXAO0BJ56RNDWBPINAI7GNGXRWZ",
                    "high_descs":[
                        "Walk to the black night stand in front of you",
                        "Pick up the blue pencil that is closest to you",
                        "Take a step to the right of the night stand ",
                        "Open top drawer of the night stand and place pencil inside then close the drawer",
                        "Walk back to the night stand in front of you",
                        "Pick up the pencil that is behind the alarm clock",
                        "Open top drawer of the night stand and place pencil inside on top of the previously placed pencil",
                        "Close the drawer of the night stand. "
                    ],
                    "task_desc":"Place pencils in the top drawer of a night stand ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "train/look_at_obj_in_light-Pillow-None-DeskLamp-316/trial_T20190908_232421_645610/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ANBWJZYU2A68T_3D8YOU6S9HB8YPC5K9P5ILFP1MQU63",
                    "high_descs":[
                        "Turn to your left, take a step, turn right, and face the bed",
                        "Pick the mat on the left from the bed",
                        "Turn left and go to the table with a lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Take a mat from the bed and turn on the table lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3LBXNTKX0UMNXC8YNL34M25VL5FX99",
                    "high_descs":[
                        "Make a left and walk to the end of the bed.",
                        "Pick up the pillow closest to the foot of the bed.",
                        "Make a left and head to the far right side of the desk.",
                        "Turn on the lamp that is sitting on the desk."
                    ],
                    "task_desc":"Pick up a pillow to look at it under a lit lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3R08VXYT7FM4UTFFYJ9Y6N0IHDMW74",
                    "high_descs":[
                        "Turn left, walk a few steps, then turn right to face the bed. ",
                        "Pick up the cushion that is closest to the foot of the bed. ",
                        "Turn around completely, then turn right and walk up to the desk. ",
                        "Turn on the lamp that is sitting on the right side of the desk."
                    ],
                    "task_desc":"Examine a cushion using the light of a lamp. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow"
            ]
        },
        "tests_seen/trial_T20190906_202316_993380/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "turn left to face the night stand",
                        "grab the alarm clock off of the night stand",
                        "turn around and walk to the desk",
                        "turn on the lamp on the desk"
                    ],
                    "task_desc":"the on the lamp on the desk while holding an alarm clock"
                },
                {
                    "high_descs":[
                        "Take a step forward, then turn left and walk up to the end table next to the bed.",
                        "Pick up the digital alarm clock off of the end table.",
                        "Turn around and walk over to the small lamp on the wooden desk.",
                        "Turn on the small lamp."
                    ],
                    "task_desc":"Examine a digital clock in the light of a small lamp."
                },
                {
                    "high_descs":[
                        "Turn left and face the dresser next to the bed.",
                        "Pick up the digital alarm clock between the keys and the smartphone on the dresser.",
                        "Turn around and move towards the desk next to the potted plant on the floor.",
                        "Turn on the desk lamp to the right of the chessboard on the desk."
                    ],
                    "task_desc":"Examine a digital alarm clock using the light from a desk lamp."
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "DeskLamp"
            ]
        },
        "tests_seen/trial_T20190909_010523_343574/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and face your bed side table in front of you.",
                        "Take the alarm clock from the table in front of you.",
                        "Turn right and face the desk in front of you.",
                        "Place the alarm clock under the desk in front of you.",
                        "Turn around and face the bed side table in front of you.",
                        "Take the alarm clock from the table in front of you.",
                        "Turn around and face the desk in front of you.",
                        "Place the alarm clock under the desk in front of you."
                    ],
                    "task_desc":"Move the alarm clock to the under side of the desk."
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        }
    }
}