{
    "scene_name":"FloorPlan306",
    "trials":{
        "train/pick_and_place_simple-Laptop-None-Desk-306/trial_T20190909_075009_810389/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3KYQYYSHYYYC6T7NYALAPLXS0Q9DOT",
                    "high_descs":[
                        "Turn around and walk forward across the room, then turn right at the black night stand on the left and walk to the laptops on the bed.",
                        "Pick up the laptop on the right.",
                        "Turn right, walk past the bed then turn left and walk to the window, then turn right towards the desk.",
                        "Put the laptop on the desk, in front of the chair."
                    ],
                    "task_desc":"Move a laptop from a bed to a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3M0BCWMB8YNRW5I5B0LEBPME07ZBWZ",
                    "high_descs":[
                        "Turn around to walk towards the bed.",
                        "Close and pick up the laptop closest to the stuffed panda.",
                        "Turn left, making your way around the bed to the desk.",
                        "Set the laptop down on the desk."
                    ],
                    "task_desc":"Move a laptop from the bed to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3PS7W85Z82TGGVZEIB27XZKP8DA9TT",
                    "high_descs":[
                        "Turn around and walk to the bed.",
                        "Pick up the laptop on the right, closing the lid first.",
                        "Turn right and walk to the left side of the desk.",
                        "Place the laptop on the desk in front of the lamp."
                    ],
                    "task_desc":"Place a laptop on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Bed",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Desk-306/trial_T20190909_074957_218283/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3180JW2OT733151X3RBMJDSEOFCJ5J",
                    "high_descs":[
                        "Turn left and walk to the bed.",
                        "Shut the laptop then pick it up.",
                        "Turn right and walk past the bed then turn left and walk to the wall then turn right.",
                        "Put the laptop on the desk."
                    ],
                    "task_desc":"Put a closed laptop on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3S4AW7T80E9R0CLXS74PU0ZSS8J4LY",
                    "high_descs":[
                        "Turn left and face the laptop on the bed",
                        "Pick up the laptop on the bed",
                        "Turn right then head to the left side of the desk",
                        "Put the laptop on the desk"
                    ],
                    "task_desc":"Put the laptop on the desk ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3Y54SXRO1OCE0NNHGMXYTV73LYVTUF",
                    "high_descs":[
                        "Turn left and walk to the bed.",
                        "Close the lid to the laptop computer behind the blue pillow and pick it up from the bed.",
                        "Turn around, hang a left, turn left at the end of the bed and walk to the side of the wooden desk to the right. ",
                        "Put the laptop computer in the middle of the desk."
                    ],
                    "task_desc":"Place a laptop computer on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Book-None-Bed-306/trial_T20190907_125231_175582/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1P0XSCJ9XAV74_3BXQMRHWK2F223BZBH756VS9XL1UMA",
                    "high_descs":[
                        "Turn left walking towards the wall. Turn left walking towards the desk.",
                        "Pick up the book on the desk.",
                        "Turn around taking a step then turn to the right. Walk towards the bed and make a right towards the trashcan and turning left to face the bed.",
                        "Put the book on the bed."
                    ],
                    "task_desc":"Moving the book from the desk to the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3M0BCWMB8YDJBGW7FSWXA32C623WBH",
                    "high_descs":[
                        "Turn left and go to the desk.",
                        "Pick up the book from the desk.",
                        "Turn around and go to the foot of the bed.",
                        "Put the book on the bed."
                    ],
                    "task_desc":"Move the book from the desk to the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3ZY8KE4ISMKT0XYR80ORJQEXLT9VQP",
                    "high_descs":[
                        "Turn left and walk to the wall then turn left and walk to the desk.",
                        "Pick up the book entitled \"Multiple View Geometry\".",
                        "Turn around and take a step then turn right and walk to the bed and take a half step to your right.",
                        "Put the book on the bed under the laptop."
                    ],
                    "task_desc":"Put a book on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "Desk",
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Bed-306/trial_T20190907_125307_925923/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A35P2RX8HKZM96_31HQ4X3T3VR2H81AM0BQRHVWCI5SL3",
                    "high_descs":[
                        "Turn right, turn left and walk to the wall. Then, turn left to face the desk.",
                        "Take the geometry book on the desk.",
                        "Turn left and walk to the end of the bed.",
                        "Place the book on the bed."
                    ],
                    "task_desc":"Put a geometry book on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_33NF62TLXMJYYZ02E6QBKGRURYPKJC",
                    "high_descs":[
                        "turn right, turn left, walk towards wall, turn to face desk on the left",
                        "pick up the book that is on the desk",
                        "turn left, walk past the desk, turn right, turn to face the end of the bed that is on the left",
                        "put the book on the bed"
                    ],
                    "task_desc":"Take a book from the desk to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3WZ36BJEV6XRJZSDKNRMNJVD26OTBN",
                    "high_descs":[
                        "Go to the right and stand in front of the desk.",
                        "Pick up the book closest to the edge of the desk.",
                        "Go to the left and stand at the end of the bed.",
                        "Put the book on the bed."
                    ],
                    "task_desc":"Put a book on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Bed",
                "Book"
            ]
        },
        "train/pick_and_place_simple-Book-None-Bed-306/trial_T20190907_125249_700188/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_30MVJZJNHPUEH3HBA9ZMU7DEFYY9JF",
                    "high_descs":[
                        "Go straight to the wall, turn left, walk to the night stand",
                        "Grab the book on the night stand",
                        "Turn around, walk to the bed,",
                        "Put the book behind the computer nearer to the bed end"
                    ],
                    "task_desc":"Move the book from the night stand to the bed",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3JRJSWSMQK2KRL63FZNL6EX0BZ4E3X",
                    "high_descs":[
                        "Turn right, then make a sharp left and walk straight to the wall, make a left when you reach the wall and walk straight to the table.",
                        "Grab the book from on top of the table.",
                        "Turn around, then turn right, walk straight, then turn right again when you reach the bed, walk straight, then turn left to face the end of the bed.",
                        "Place the book on top of the bed."
                    ],
                    "task_desc":"Grab the book from the table to place on the bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_337RC3OW08JI90IEGVGV24F3AFQVLN",
                    "high_descs":[
                        "Turn to the right, walk around the table, turn to the left and walk to the desk. ",
                        "Pick up the book beside the clock from the desk. ",
                        "Turn to the left and walk to the end of the bed closest to the desk. ",
                        "Place the book by the laptop on the bed and closest to the desk. "
                    ],
                    "task_desc":"Transferring a book from a desk to a bed. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "Book"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Bed-306/trial_T20190908_092010_984361/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_37XITHEISZ05YETPQ673ZAKFQ7BRCY",
                    "high_descs":[
                        "turn left then walk straight towards the desk",
                        "pick up the phone off of the desk",
                        "turn around and then walk straight a bit then turn right and walk straight towards the bed then turn right then turn left again towards the edge of the bed",
                        "put the phone down on the bed in front of the computer",
                        "turn left then walk straight then turn right and walk straight towards the garbage can then turn left and walk straight towards the night stand",
                        "pick the phone up off of the night stand",
                        "turn left then walk straight then turn left again towards the window and walk straight then turn left towards the edge of the bed",
                        "put the phone down on the bed to the right of the other phone"
                    ],
                    "task_desc":"pick up phone's and put them on the bed",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Bed-306/trial_T20190908_091940_573714/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_39JEC7537XSXRLA6ZQCD079IBB5CVP",
                    "high_descs":[
                        "Turn around and go to the front of the wooden desk in the right corner. ",
                        "Pick up the phone on the left near the front edge of the desk.",
                        "Turn left and go to the side of the bed between the desk and the bed.",
                        "Place the phone on the bed on the left of the blue notebook in the middle.",
                        "Go around the desk back to the front of it.",
                        "Pick up the remaining phone on the desk.",
                        "Go back to the side of the bed between the desk and the bed. ",
                        "Place the phone on the right of the blue notebook."
                    ],
                    "task_desc":"Move the phones from the desk to the bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Bed-306/trial_T20190908_092114_854078/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1K5ILJMG439M5_3OS4RQUCRC6PLJWALBBE710E5WMBFY",
                    "high_descs":[
                        "Move over to the window sill and then turn right to face the desk.",
                        "Pick up the phone that's closest to you from the desk.",
                        "Turn around and face the bed with the phone.",
                        "Put the phone down on the bed so that it's to the left of the blue pillow.",
                        "Go over to the right side of the desk and face it.",
                        "Pick up the phone from behind the clocks.",
                        "Bring the phone with you and go back to face the bed in front of the window.",
                        "Put the phone down so that it's in front of the first one."
                    ],
                    "task_desc":"Move the phones onto the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Bed"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Bed-306/trial_T20190909_012707_174038/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_33FBRBDW6RQZG9ETRX138TPA0IP8CB",
                    "high_descs":[
                        "go to the shelf above the radiator heater",
                        "pick up the phone from the shelf",
                        "take the phone to the end of the bed in front of the ladder",
                        "put the phone on the bed"
                    ],
                    "task_desc":"get the phone from the shelf and put it on the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3K9FOBBF2KADMKV3ACJLT95SJM0NLS",
                    "high_descs":[
                        "Turn around and walk to the radiator.",
                        "Pick up the phone that's in front of you.",
                        "Turn left and take a step to your left.",
                        "Put the phone on the bed near the laptop slightly above it to the left."
                    ],
                    "task_desc":"Put a phone on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3OUYGIZWRAP0S9IU1YAUZEIZG3RP0I",
                    "high_descs":[
                        "Turn around and walk up to the shelf by the window",
                        "Pick up the cell phone from the shelf",
                        "Turn left to face the bed",
                        "Put the cell phone on the bed"
                    ],
                    "task_desc":"Put the cell phone on the bed",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Bed"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Bed-306/trial_T20190909_012724_686117/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_32ZKVD547IEU57GH1GAC6SBH2AJB3Z",
                    "high_descs":[
                        "Turn right then head straight to the window",
                        "Pick up the phone on the right side",
                        "Turn around on your left face the end of the bed",
                        "Put the phone in front of the laptop on the bed"
                    ],
                    "task_desc":"Put the phone on the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_35GCEFQ6I8FQN5JX7UQFSAIKTD83Z0",
                    "high_descs":[
                        "Turn to your left and go to the window ledge between the desk and the bed. ",
                        "Pick up the cell phone on the left, behind the pencil. ",
                        "Turn to the bed on your left. ",
                        "Toss the cell phone on the bed, to the right of the computer. "
                    ],
                    "task_desc":"Put a cell phone on the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3WAKVUDHUZ7R2PQA3JUXOZFLWX3U7V",
                    "high_descs":[
                        "Make a left and move to the window seat.",
                        "Pick up the smartphone above the blue pencil.",
                        "Turn left and walk to the bed.",
                        "Set the smartphone down next to the laptop closest to the stuffed animal."
                    ],
                    "task_desc":"Put a smartphone next to a laptop on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Laptop"
            ]
        },
        "train/pick_two_obj_and_place-CD-None-Drawer-306/trial_T20190907_025539_829173/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3KXIR214I7XDE1DRMTX3EIGHRF5240",
                    "high_descs":[
                        "Turn around. Move to the small black dresser in front of the mirror. ",
                        "Pick up the CD on top of the dresser. ",
                        "Move across the room to the brown desk. Open the top right drawer.",
                        "Put the CD in the drawer. CLose the drawer.",
                        "Turn and move to the left toward the large windows and the flat surface over the heater.",
                        "Pick up the CD that is on the black flat surface. ",
                        "Turn to the left and move to the brown desk.",
                        "Open the top right drawer. Place the disc inside. Close the drawer. "
                    ],
                    "task_desc":"Put the cds that are scattered across the room away in the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3Z9WI9EOZ2527T5CQ6NQ83BFDHWHK0",
                    "high_descs":[
                        "Turn around and move to the black cabinet.",
                        "Pick up the cd on the black cabinet.",
                        "Turn to your left and go to the desk.",
                        "Open the top drawer on the desk.  Place the cd in the drawer.  Shut the drawer.",
                        "Go to the window sill.",
                        "Pick up the cd on the window sill.",
                        "Go to the desk.  ",
                        "Open the drawer.  Place the cd behind the cd that is in there.  Shut the drawer."
                    ],
                    "task_desc":"Put CDs away in desk drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "tests_seen/trial_T20190906_221742_215409/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "move forward towards the wall and turn left towards the table",
                        "put on the desk lamp",
                        "drop the disk on the table inside the basket beside the table"
                    ],
                    "task_desc":"turn on the table lamp also trash the disk"
                },
                {
                    "high_descs":[
                        "Turn left, then left again then turn right to face the lamp on the desk.",
                        "Turn on the lamp.",
                        "Grab the CD from the desk."
                    ],
                    "task_desc":"Turn the lamp on in order to grab the CD."
                },
                {
                    "high_descs":[
                        "Walk around the bed and walk to the AC, facing the side of the table",
                        "Turn on the lamp on the table",
                        "Grab the CD that is closest to the edge"
                    ],
                    "task_desc":"Walk to the table,turn on the lamp, take the cd on the edge of the table"
                }
            ],
            "relative_objects":[
                "CD",
                "AlarmClock",
                "Pen",
                "Laptop"
            ]
        }
    }
}