{
    "scene_name":"FloorPlan206",
    "trials":{
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-206/trial_T20190908_045229_128065/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3SNLUL3WO74IWLTEB56Q6IDKX5PUL0",
                    "high_descs":[
                        "Turn right, head over to the middle of the blue couch with the computer on it.",
                        "Pick up the keys on the couch. ",
                        "Go to the lamp on the left side of the couch.",
                        "Turn on the lamp left of the couch. "
                    ],
                    "task_desc":"Look at keys in the light of a lamp. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3TYCR1GOTF0ZIKNOHS5YNASZZMCLZM",
                    "high_descs":[
                        "Turn right, go forward, turn left, go forward, then turn right to go to the sofa.",
                        "Pick up the keys on the sofa, to the left of the computer.",
                        "Turn left, go forward, then turn right to approach the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine keys in the light of a lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_304SM51WA6LQ4ZFYVNMWDEZR0EOBSC",
                    "high_descs":[
                        "Move to the middle of the blue sofa where the keys are sitting on the sofa",
                        "Pick up the keys on the sofa",
                        "Carry the keys to the floor lamp in the corner of the room",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry keys while turning on a lamp",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-206/trial_T20190908_045244_155119/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3OXV7EAXLH7GE6DO9H4NUQ5NUW536G",
                    "high_descs":[
                        "Head across the room to the long bookshelf  that is at the back of the room",
                        "Pick up the keys that are sitting on the bookshelf in from of the hand",
                        "Turn right and go to the tall, pink and black, floor lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Look at keys under a tall lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_35BLDD71I9E2EPZIVW74AJQ1QKHZVM",
                    "high_descs":[
                        "turn right, take a step, turn left, walk forward to the shelves",
                        "pick up the keys that are on the shelf",
                        "turn right, walk to the lamp, hold keys up",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine keys with a lamp",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3A4NIXBJ79GZJDO523F4F8WQKIWML8",
                    "high_descs":[
                        "Go around the coffee table to the book shelf across the room.",
                        "Pick up the keys from the top of the book shelf.",
                        "Turn right to go to the front of the lamp.",
                        "Turn the lamp on to examine the keys"
                    ],
                    "task_desc":"Look at the keys under the light",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-206/trial_T20190908_045258_125220/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3M0BCWMB8YDJBGW7FSWXA32C6QWWBM",
                    "high_descs":[
                        "turn around, walk forward, turn left to face coffee table",
                        "pick up the keys that are on the coffee table",
                        "turn right, walk forward, turn right, walk forward to the lamp, hold keys up",
                        "turn on the lamp"
                    ],
                    "task_desc":"examine keys with a lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3VAR3R6G1SIS49PYLULD27ZPVIQO8H",
                    "high_descs":[
                        "Move across the room to the coffee table facing the keys on the table",
                        "Pick up the keys on the coffee table",
                        "Carry the keys to the floor lamp in the corner of the room by the blue couch",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Hold keys while turning on a lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3LRLIPTPETQNX6XYK0DYRHOB11TAK0",
                    "high_descs":[
                        "Turn around and walk to the middle of the couch and the coffee table, turn right and at the center of the coffee table  turn yourself right again so that you are facing the table.",
                        "Pick up the keys that are on the stack of papers, on the table. ",
                        "Turn to your right and walk towards the wall, then turn to your right and go to the lamp in the corner of the room. ",
                        "While holding the keys, turn the lamp on. "
                    ],
                    "task_desc":"Turn on the lamo in the living room.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Sofa-206/trial_T20190906_203503_354880/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3137ONMDKJMLLXIRAEU5P8M9EQ0EG3",
                    "high_descs":[
                        "Turn around and walk over to the TV stand by the window",
                        "Pick up the credit card from the left side of the TV stand",
                        "Turn around and approach the blue sofa behind you",
                        "Put the credit card down on the sofa next to the laptop",
                        "Turn around and walk to the other side of the coffee table",
                        "Pick up the blue credit card nearest the statue from the coffee table",
                        "Walk around the coffee table to the blue sofa",
                        "Put the credit card on the sofa right of the other credit card"
                    ],
                    "task_desc":"Put the credit cards on the blue sofa",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-ArmChair-206/trial_T20190909_023714_997770/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_3RANCT1ZVI8E41T0G06DT11HFROUBJ",
                    "high_descs":[
                        "Turn to the left then turn right. Make a left to face the TV stand. ",
                        "Pick up the credit card from the tv stand. ",
                        "Step to the left then turn right and head to the armchair. ",
                        "Place the card on the armchair. "
                    ],
                    "task_desc":"Move a credit card to an armchair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3TR2532VISLZK91B8ALRBJ6EKAEJ6Q",
                    "high_descs":[
                        "walk to face left side of tv stand",
                        "pick up credit card from tv stand",
                        "walk to face plush blue chair",
                        "put credit card on chair"
                    ],
                    "task_desc":"put credit card on plush chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_3IQ1VMJRYWBB1Z05CBBQ2UUXKOMA96",
                    "high_descs":[
                        "turn left and walk straight towards the table then left again then walk straight then turn right then walk straight to the window and turn left",
                        "pick up the credit card by the tv",
                        "turn left walk straight then turn right by the table and walk straight to the blue chair then turn right then turn left towards the blue chair",
                        "put the credit card down on the blue chair next to the keys"
                    ],
                    "task_desc":"move a credit card from the tv to the chair",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CreditCard",
                "Pillow"
            ]
        },
        "train/pick_and_place_simple-Vase-None-CoffeeTable-206/trial_T20190909_024648_216020/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_3C6FJU71TTKAH9MBQSKX1CZI01ZUYT",
                    "high_descs":[
                        "Turn around to walk to the light brown shelf across the room.",
                        "Pick up the round gold object from the top of the shelf.",
                        "Turn around to walk to the coffee table.",
                        "Set the round gold object down on the coffee table."
                    ],
                    "task_desc":"Move the round gold object from the shelf to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3QIYRE09Y680WDRZH2129UWELKP1N2",
                    "high_descs":[
                        "Turn around and go across the room to the center of the shelving unit against the wall.",
                        "Pick up the gold ornament on the back of the shelving unit, between the vase and the bowl. ",
                        "Turn around and walk between the coffee table and the TV stand to the end of the coffee table. ",
                        "Place the gold ornament on the front, right corner of the coffee table. "
                    ],
                    "task_desc":"Move the gold ornament from the shelf to the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3ZOTGHDK5L2I8IQ5V0GZKKJS1U7SOS",
                    "high_descs":[
                        "Turn around, hang a left at the white table and turn right to face the white table.",
                        "Pick up the gold bottle behind the black statue on the table.",
                        "Turn around, take a right to the window, turn left at the television and turn around at the blue chair to face the white coffee table.",
                        "Put the gold bottle on the left corner of the coffee table in front of the set of keys."
                    ],
                    "task_desc":"Place a gold bottle on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue",
                "Vase"
            ]
        },
        "train/pick_and_place_simple-Vase-None-CoffeeTable-206/trial_T20190909_024707_531392/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CPNA5L0J834N_3CPLWGV3MRQILIUULFGVO0EXJWJ9NP",
                    "high_descs":[
                        "turn right and walk towards the window  turn left and stop at the television",
                        "pick up the vase in the middle of the entertainment center ",
                        "turn left towards the blue chair then turn left again then turn around ",
                        "place the vase on the table in the middle of the room"
                    ],
                    "task_desc":"move vase from the entertainment center to the coffee table",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3OE22WJIGLF187VPZI33OQWG1SEUQM",
                    "high_descs":[
                        "turn right, walk across room, turn left, take a few steps, turn right to face TV stand",
                        "pick up the green vase that is on the bottom shelf",
                        "turn left, walk across room, turn left, take a few steps, turn left",
                        "put the vase on the coffee table"
                    ],
                    "task_desc":"move a vase from the TV stand to the coffee table",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RVDEU138ZF9P_3OS46CRSLIQ8B415PZZAE7H8GLU6VK",
                    "high_descs":[
                        "Turn right and walk forward, then turn left to face the television table. ",
                        "Pick up the green vase from the lower compartment of the table. ",
                        "Turn left and walk forward to the brown table. ",
                        "Place the green vase at the center of the table. "
                    ],
                    "task_desc":"Move the green vase from the television table to the brown table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "tests_seen/trial_T20190909_102158_210566/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and go forward to the chair, then turn left to face the box on the floor.",
                        "Pick up the box from the floor.",
                        "Turn left and move forward, then turn left and go toward the coffee table, then turn right to face the sofa.",
                        "Place the box on the sofa."
                    ],
                    "task_desc":"Move the box to the sofa."
                },
                {
                    "high_descs":[
                        "Turn left and go to the box on the floor by the chair",
                        "Pick up the box from the floor",
                        "Turn left and go to the blue couch on the right",
                        "Put the box on the couch between the pillow and keys"
                    ],
                    "task_desc":"Put a cardboard box on the couch"
                },
                {
                    "high_descs":[
                        "Turn left and walk to the blue chair.",
                        "Pick up the box on the floor.",
                        "Turn and face the coffee table, then walk ahead and veer right to the couch.",
                        "Place the box on the couch, to the right of the blue pillow."
                    ],
                    "task_desc":"Place a box on a couch."
                }
            ],
            "relative_objects":[
                "Sofa",
                "Box"
            ]
        }
    }
}