{
    "scene_name":"FloorPlan227",
    "trials":{
        "train/pick_and_place_with_movable_recep-Vase-Box-DiningTable-227/trial_T20190908_220622_212249/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1G1OO4IWM8EP5_33LK57MYLWWU7M4CX9RG0IQWLV8ZST",
                    "high_descs":[
                        "Turn to the right and walk to the end of the sofa,  Turn left at the end and walk around the sofa and turn left at the end.  Walk toward the coffee table and around the far side.  Turn right at the end and walk toward the wall.",
                        "Pick up blue lid on shelf.",
                        "Turn right and walk to the box on the ledge.",
                        "Put blue lid in the box.",
                        "Pick up the box.",
                        "Turn right and walk to the table.  At the table turn right and walk to the end of the table.  At the end of the table, turn left and face the table.  ",
                        "Put the box on the table."
                    ],
                    "task_desc":"Put blue lid in box and placed on kitchen table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_33OOO72IVKCIET6HUVCYZPLXEVYTC9",
                    "high_descs":[
                        "walk to face shelves and box in living room",
                        "pick up blue dish from shelves",
                        "turn right to face box ",
                        "put dish into box",
                        "pick up box from shelves",
                        "walk to face white table",
                        "put box on the table"
                    ],
                    "task_desc":"put box with blue dish on table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_34BBWHLWHD21JDWBHADVXCQRVV3WI9",
                    "high_descs":[
                        "Turn right, go forward, turn left before reaching the table, go forward past the couch, turn left, go forward to the chair, turn right, go forward to the shelf.",
                        "Take the blue vase from the shelf.",
                        "Go to the right where the box is.",
                        "Put the vase in the box.",
                        "Take the box from the white platform.",
                        "Turn right, go forward, turn right before reaching the table, go forward, turn left at the end of the table.",
                        "Put the box on the table to the right of the newspaper. "
                    ],
                    "task_desc":"Put a box with a blue vase in it on a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Vase"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-ArmChair-227/trial_T20190907_075543_765808/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3Y4W8Q93L21ZBOUM3EI7JR7Y2LEVDS",
                    "high_descs":[
                        "Turn left and go to the the other side of the room and turn left to face the white table.",
                        "Pick up the blue credit card on the white table. ",
                        "Turn right and go to the wall and turn left to go to the other side of the room in front go the gray chair and face the chair in front. ",
                        "Place the credit card on the seat of the gray chair.",
                        "Turn around and go to the sofa with two wide seats and turn right to face it. ",
                        "Pick up the credit card on the sofa.",
                        "Turn right to go back to the gray arm chair.",
                        "Place the credit card next to the first credit card. "
                    ],
                    "task_desc":"Place both credit cards on the same gray arm chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Chair"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-ArmChair-227/trial_T20190907_075752_838584/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ACSS93E03ZUGX_37TRT2X24T8X5WW88TDILD844DPBJA",
                    "high_descs":[
                        "Turn around to face the grey couch. ",
                        "Pick the first credit card up off of the couch. ",
                        "Turn around and move to the left to face the grey chair.",
                        "Place the grey credit card on the grey chair.",
                        "Turn around and go to the right to face the grey sofa.",
                        "Pick the credit card up from off of the sofa.",
                        "Turn around and move to the left to face the grey chair.",
                        "Place the grey credit card on the grey chair."
                    ],
                    "task_desc":"Place both credit cards on the grey chair.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_3IFS6Q0HJL00R7T41XEDZ134VP9SI9",
                    "high_descs":[
                        "Look down and turn right then turn right again and look down at the sofa",
                        "Pick up the credit card on the left of the other credit card",
                        "turn right and then turn right again, walk towards the computer then turn left, walk towards the chair then turn right, then left and look down at the white chair",
                        "put the credit card down on the white chair edge",
                        "turn left then walk straight a little bit then turn left again, then walk straight all the way to the end of the sofa then turn right",
                        "pick up the credit card next to the remote",
                        "turn around then turn left then walk straight towards the white chair and turn right then walk straight and then another left at the other white chair",
                        "put the credit card down to the right of the other credit card"
                    ],
                    "task_desc":"pick up credit cards and put them down on the white chair",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Chair"
            ]
        },
        "train/pick_two_obj_and_place-Vase-None-CoffeeTable-227/trial_T20190909_034051_446517/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3FTF2T8WLU988C38DG7IKJROC7UW98",
                    "high_descs":[
                        "Turn right and walk across the room to face the black hole in the wall.",
                        "Pick up the blue lid in the black hole in the wall.",
                        "Turn around to face the living room table.",
                        "Place the blue lid on the living room table.",
                        "Turn right and walk forward and turn left to face the top right cabinet of a desk.",
                        "Remove the red lid from the cabinet.",
                        "Turn around to face the living room table.",
                        "Place the red lid on the living room table."
                    ],
                    "task_desc":"TO move a blue and red lid to the living room table.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"ASP32QB28TEZU_3TVRFO09GN6IYE97CI6URBWQL30XLI",
                    "high_descs":[
                        "Turn right move across the room to the shelves on the far wall",
                        "Pick up the blue item from the shelf by the box",
                        "Turn around and move to the coffee table",
                        "Put the blue item on the top shelf of the coffee table",
                        "Turn around move to the shelves",
                        "Pick up the red vase on top from the shelves",
                        "Turn around and move to the coffee table",
                        "Put the red vase to the right of the blue item"
                    ],
                    "task_desc":"Retrieve a blue item and a red vase from the shelves, place them on the coffee table. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Vase"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-227/trial_T20190909_064745_196990/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3EJJQNKU9UWWFM45CYL4A1HV35SHRL",
                    "high_descs":[
                        "Turn to the left, walk around the couch, making a left when reaching the end. Face the couch. ",
                        "Pick up the remote from the left couch cushion. ",
                        "Turn to the right and walk across the room to the armchair on the far right. ",
                        "Place the remote in the chair. "
                    ],
                    "task_desc":"Move a remote from a couch to a chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3LBXNTKX0UMNXC8YNL34M25VL9B9XP",
                    "high_descs":[
                        "Turn left, go to end of couch, turn left.  Turn left, move to first cushion of couch, turn left to face couch.",
                        "Pick up remote from couch.",
                        "Turn right, proceed to chair on right.",
                        "Place remote diagonal on chair."
                    ],
                    "task_desc":"Move remote from couch to chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3TY7ZAOG5IBZHILEO65M3XW0MW3K00",
                    "high_descs":[
                        "Walk around to the front side of the longest grey couch.",
                        "Pick up the remote on the seat of the couch.",
                        "Walk to the furthest grey armchair to the right of the long grey couch.",
                        "Set the remote on the seat of the grey armchair."
                    ],
                    "task_desc":"Move a remote from the grey couch to a grey armchair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-227/trial_T20190909_101528_704500/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_39L1G8WVWTITS9YPZJHN0GY8G2J317",
                    "high_descs":[
                        "Turn right, hang a right at the couch and turn left at the coffee table to face the couch.",
                        "Pick up the remote control on the far right side on the cushion of the couch.",
                        "Turn around, hang a left at the coffee table, take a right at the chair and face the next chair on the left.",
                        "Put the remote control on the left side of the chair near the edge."
                    ],
                    "task_desc":"Place a remote control on a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3XIQGXAUMFZJJTK58O5K86EPQJOX72",
                    "high_descs":[
                        "Make a right to walk to the longest grey couch.",
                        "Pick up the remote on the grey couch that is the farthest on the right side.",
                        "Make a right to walk to the grey armchair that is on the right of the other grey armchair.",
                        "Set the remote down on the seat of the grey armchair."
                    ],
                    "task_desc":"Move a remote from the grey couch to a grey armchair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_308XBLVESLVMO91JC6B8OQEX8SWBR8",
                    "high_descs":[
                        "Turn around and move to the right of the large grey sofa with the remotes on it",
                        "Pick up the remote on the far right side of the sofa",
                        "Carry the remote to the grey chair to the right of the sofa",
                        "Place the remote on top of the chair"
                    ],
                    "task_desc":"Move a remote to the chair",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-227/trial_T20190909_101507_801236/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3NPFYT4IZFV2CMV61R9EEJRIPMNXGL",
                    "high_descs":[
                        "Turn left, turn left at the TV, turn left to face the coffee table. ",
                        "Pick up the remote from the table. ",
                        "Walk to the chair to the right of the coffee table. ",
                        "Put the remote down on the front edge of the chair. "
                    ],
                    "task_desc":"To move a remote to the chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3Q5ZZ9ZEVR6EHO5ECNEVUNJ084958C",
                    "high_descs":[
                        "Turn left, proceed across room.  Turn left, proceed to table on left.  Turn left, proceed to table.",
                        "Pick up remote to the right of the credit card from table.",
                        "Turn right, proceed to chair, turn left.  Proceed to chair on right, turn right to face chair.",
                        "Place remote on chair on bottom left corner of cushion."
                    ],
                    "task_desc":"Move remote from table to chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3U8YCDAGXS7LSLJ91BPJZJ89L2JQ0M",
                    "high_descs":[
                        "Turn around and face the small black table with the box on it.",
                        "Pick the remote up from the table.",
                        "Go to the right to face the gray chair.",
                        "Put the remote down on the chair."
                    ],
                    "task_desc":"Put a remote on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Chair"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-CoffeeTable-227/trial_T20190907_161844_256041/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_369J354OFGRH8IPC4WB7DKUWYIYG6N",
                    "high_descs":[
                        "Turn left and walk to the chair to the left of the plant.",
                        "Pick up the keys from the chair.",
                        "Turn left and walk to the small black coffee table.",
                        "Put the keys on the coffee table, to the left of the remote laying horizontally."
                    ],
                    "task_desc":"Move a set of keys from a chair to a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3A4TN5196NZKOVTOYT6SKKY796GCH8",
                    "high_descs":[
                        "turn left, walk forward, turn right after the chair, turn right to face the side of the chair",
                        "pick up the keys that are on the chair",
                        "turn left, walk forward, stop to face the black tables on the right",
                        "put the keys on the table"
                    ],
                    "task_desc":"move keys from the chair to the table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3PJ71Z61R7J7MM17KKTGQ7HSMVK19I",
                    "high_descs":[
                        "Move to the grey chair to the right of the plant",
                        "Pick up the keys that are on top of the grey chair",
                        "Carry the keys to the round black coffee table",
                        "Place the keys to the left of the remote sitting on top of the table"
                    ],
                    "task_desc":"Move keys to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-CoffeeTable-227/trial_T20190907_161918_648865/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_31EUONYN2YKQFLLBTNWNULJX614VOC",
                    "high_descs":[
                        "Go left and cross the room to face the couch on the left.",
                        "Pick the keys up from the couch.",
                        "Go left and then turn left at the white cabinets to face towards the black table.",
                        "Put the keys on the black table."
                    ],
                    "task_desc":"Put keys on a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3ITXP059PZ0WMIDAJFZDB2I482TJS3",
                    "high_descs":[
                        "Turn to your left and walk to the end of the couch, then turn left again walking around to the front of the couch.",
                        "Pick up the keys on the left couch cushion. ",
                        "Turn around and walk to the round table between the couch and the TV. ",
                        "Place the keys on the bottom tier of the black, round table. "
                    ],
                    "task_desc":"Place the keys from the couch on the bottom, round, black table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3URFVVM168Z21AAIQ6XZEXOICYPZUK",
                    "high_descs":[
                        "turn left, walk around the sofa, face the sofa",
                        "grab the key chain near the credit card",
                        "turn around, walk to the coffee table ",
                        "put the key chain at the bottom of the coffee table"
                    ],
                    "task_desc":"grab the key chain from the sofa, put it at the bottom of the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Vase",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-CoffeeTable-227/trial_T20190907_162007_533707/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36DK84J5YJ942_34QN5IT0T2871SXFJ9J2C637XZW801",
                    "high_descs":[
                        "Move to the arm chair to the left of you",
                        "Pick up keys from the chair ",
                        "Move to the coffee table to the left",
                        "Put keys on the table"
                    ],
                    "task_desc":"Put a set of keys on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3J88R45B2JF04A2782AK76L8WFIPXW",
                    "high_descs":[
                        "Move across the room to the grey leather chair",
                        "Pick up the keys that are sitting on top of the grey chair",
                        "Carry the keys over to the coffee table on top of the grey rug",
                        "Place the keys behind the laptop on top of the coffee table"
                    ],
                    "task_desc":"Move keys to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3LOTDFNYAAG9OX8NKUITTTTXL8SFWV",
                    "high_descs":[
                        "Turn left towards the chair.",
                        "Pick up the keys from the chair.",
                        "Turn left and go to the round coffee table.",
                        "Set the keys on the coffee table."
                    ],
                    "task_desc":"Take the keys and put them on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-CreditCard-None-FloorLamp-227/trial_T20190908_173638_377422/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3JAOYWH7VLVSXIR9920GB8A8EXU9LQ",
                    "high_descs":[
                        "Move forward, turn left at the wall, go to the other end of the room, turn right at the credit card on the shelf on the right.",
                        "Pick up the credit card on the shelf. ",
                        "Turn around, go past the couch, to the lamp in the right corner.",
                        "Turn on the lamp in the corner."
                    ],
                    "task_desc":"Examine a credit card by the light of the lamp. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3SBEHTYCWQU58IRBWBVJI9B762CIY1",
                    "high_descs":[
                        "Go forward toward the trash can, then turn left and go straight toward the wall, then turn right to face the shelves.",
                        "Pick up the credit card from the top shelf.",
                        "Turn around and go straight to the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a credit card in the lamp light.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3IKZ72A5B77RMSL7O1GNYW08MQKFNL",
                    "high_descs":[
                        "Walk past the table to your left, then turn left and go across the room to the white shelf's on the wall, to your right. ",
                        "Pick up the credit card in front of the picture of a hand. ",
                        "Turn to your left and go past the doors, to the lamp in the corner ahead of you. ",
                        "Turn on the lamp in the corner. "
                    ],
                    "task_desc":"Turn on the living room lamp. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_two_obj_and_place-RemoteControl-None-CoffeeTable-227/trial_T20190909_011438_661075/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1E0WK5W1BFPWR_320DUZ38GAD1H2QHKNUDNAJ3EL8JGD",
                    "high_descs":[
                        "Turn left and move to the large sofa on your right.",
                        "Pick up the remote on the left. ",
                        "Turn around, move towards the TV, and turn left towards the coffee table.",
                        "Place the remote on to the coffee table.",
                        "Turn to the left and walk around the room, stopping behind the large sofa. ",
                        "Pick up the remote from the sofa.",
                        "Turn to the right and walk around the room towards the television, stopping in front of the coffee table.",
                        "Place the remote onto the middle of the coffee table "
                    ],
                    "task_desc":"Pick up the remote controls off the sofa and place them on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Sofa",
                "CoffeeTable"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Plate-Shelf-227/trial_T20190907_153331_887183/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1VAL7L9L79IN0_373ERPL3YRPEZ692GKDCNY0HKOJTRK",
                    "high_descs":[
                        "Turn left and walk to the dining table.",
                        "Pick up the credit card next to the plate and box.",
                        "Put the credit card on the plate on the table.",
                        "Pick up the plate with the credit card that's on the table.",
                        "Turn around and walk to the TV that's on the wall to your right.",
                        "Place the plate with the credit card on the counter under the TV."
                    ],
                    "task_desc":"Put a plate with a credit card on it under the TV.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3NVC2EB65TGIXQNUF0ZFDHPGTC43YY",
                    "high_descs":[
                        "Go left to the white table, to the left of the side that is toward you.",
                        "Pick up the credit card that is next to the plate.",
                        "Put the credit card on the plate.",
                        "Pick up the plate with the credit card on it.",
                        "Hang a left and go to the center of the television screen, turning to face it.",
                        "Put the plate holding the credit card on the white shelf below the TV screen."
                    ],
                    "task_desc":"Put a plate holding a credit card on the ledge under the TV screen.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3ZOTGHDK5LSANT47ZSRIJYZQ7HMOSG",
                    "high_descs":[
                        "Turn left and walk to the dining table.",
                        "Pick up the credit card from the table.",
                        "Put the credit card on the plate which is on the table.",
                        "Pick up the plate from the table.",
                        "Turn around and walk to the front of the television on the right.",
                        "Put the plate on the shelf area below the television."
                    ],
                    "task_desc":"Put a plate with a credit card on it below a television.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Plate-Shelf-227/trial_T20190907_153501_538069/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36DK84J5YJ942_3SEPORI8WQGIM1WKK1G8EWCO5O2AZA",
                    "high_descs":[
                        "Move to the coffee table in front of the couch.",
                        "Pick up a credit card from the table.",
                        "Move to the dining table behind you.",
                        "Place the card on a plate on the table.",
                        "Pick up the plate from the table",
                        "Move to the shelf to the right of the coffee table under the TV",
                        "Place the plate on the shelf."
                    ],
                    "task_desc":"Put a plate with a credit card on the shelf in front of the couch.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3TDXMTX3CEBV49V7UKBAYW7CDSF6IO",
                    "high_descs":[
                        "Turn right, head to the wall, turn right, head down to the round table in the middle and face the computer on the table. ",
                        "Pick up the blue credit card on the table. ",
                        "Turn around, bring the card to the dining table. ",
                        "Put the card on the plate on the table. ",
                        "Pick up the plate with card from on the table. ",
                        "Turn around, head to the round table, turn right to face the white shelf along the wall. ",
                        "Place the plate with card on the shelf. "
                    ],
                    "task_desc":"Put a card on plate, on a shelf. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3WMINLGALEK5E8LASNW03YB3WYFCAW",
                    "high_descs":[
                        "Turn left, then go straight, then turn right, then go straight, then turn right, and turn to face the coffee table.",
                        "Pick up the credit card from the coffee table.",
                        "Turn around, and go straight to the table.",
                        "Put the credit card on the plate, on the table.",
                        "Pick up the plate from the table.",
                        "Turn left, then turn left, then go straight, then turn left to face the counter.",
                        "Place the plate on the center of the counter."
                    ],
                    "task_desc":"Put a plate with a credit card on the counter.",
                    "votes":[
                        0,
                        1,
                        1,
                        1,
                        0,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_340UGXU9D1ILSQ58P98WTRBMOLUUVM",
                    "high_descs":[
                        "Turn to your right and walk across the room, then turn right again until you reach the end of the black, round table. ",
                        "Pick up the credit card on the bottom tier of the table. ",
                        "Turn around and walk to the white, table behind you. ",
                        "Place the credit card on the plate that is in front of the newspaper. ",
                        "Pick up the plate with the credit card on it. ",
                        "Turn around and walk forward until you reach the round, black table, then turn right and walk up the the TV mounted on the wall. ",
                        "Place the plate with the credit card on it on the ledge beneath the TV. "
                    ],
                    "task_desc":"Put a plate containing a credit card on the surface under the TV.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_3GA6AFUKOR5WBVX550VRRHUD3SF3HB",
                    "high_descs":[
                        "Turn right, move to the low part of the coffee table.",
                        "Pick the credit card up from the low part of the coffee table.",
                        "Turn right, move to the dining table, behind the plate.",
                        "Place the credit card on the plate.",
                        "Pick up the plate with the credit card on it.",
                        "Turn left, move to the shelf in front of the TV.",
                        "Place the plate onto the shelf below the TV."
                    ],
                    "task_desc":"Place a credit card below the TV.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Plate"
            ]
        },
        "train/pick_and_place_simple-Statue-None-CoffeeTable-227/trial_T20190909_101650_071380/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_3KYQYYSHYYYC6T7NYALAPLXS0ZJODW",
                    "high_descs":[
                        "Turn around and walk to the white shelf on the left against the wall.",
                        "Pick up the green statue from the white shelf.",
                        "Turn around and walk to the black round table.",
                        "Put the green statue on the left side of the table in front of the laptop computer."
                    ],
                    "task_desc":"Place a statue on a table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3R0T90IZ1V3E9OKBAVDR0668OD2CGJ",
                    "high_descs":[
                        "Turn around, go around the couch and across the room to go to the shelf in front of the TV.",
                        "Pick up the statue from the shelf.",
                        "Go to the black coffee table behind you.",
                        "Put the statue on the black coffee table."
                    ],
                    "task_desc":"Put a statue on the black coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3CN4LGXD50FB0BSWBMTFO81O1WX4YI",
                    "high_descs":[
                        "turn around and move to the tv stand",
                        "pick up the toy horse",
                        "turn around and head to the center table",
                        "drop the toy horse on the center table"
                    ],
                    "task_desc":"place a toy horse on the center table",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "train/pick_and_place_simple-Statue-None-CoffeeTable-227/trial_T20190909_221248_363706/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_30IQTZXKANX51IKLNPKBTR42IE9X0B",
                    "high_descs":[
                        "Turn around, go forward to the bin, turn left, go forward, turn right at the left side of the TV.",
                        "Take the statue from below the TV.",
                        "Turn around to face the coffee table.",
                        "Put the statue in front of the remote control on the coffee table."
                    ],
                    "task_desc":"Put a statue on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_33M4IA01QJST1C4KH23QDN5PR43XR4",
                    "high_descs":[
                        "Turn around and head forward, take a left at the trash can then head across the room, make a right at the tv and turn to face the left side of the tv",
                        "Pick up the green dog statue that is sitting under the tv",
                        "Turn around and face the round, black coffee table",
                        "Place the green dog statue on the coffee table to the left of the newspaper"
                    ],
                    "task_desc":"Place a statue on a table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_382M9COHEK6CB45KQR83U972IXYUEY",
                    "high_descs":[
                        "go to the ledge under the tv",
                        "pick up the dog statue from the ledge",
                        "take the statue to the coffee table",
                        "put the statue on the table"
                    ],
                    "task_desc":"take the dog statue from the ledge to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Drawer-227/trial_T20190918_215541_739446/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_386CSBG1O2DG6W5O30508KI0Y2X6QP",
                    "high_descs":[
                        "Walk up to the couch, then turn right and walk forward, hang a right and walk up to the white shelving unit.",
                        "Pick up the blue credit card that is behind the golden statue on the shelf in front of you.",
                        "Turn left and walk forward, stop in front of the drawers on your right.",
                        "Open the upper drawer in front of you and put the blue credit card in, then close the drawer."
                    ],
                    "task_desc":"Move a blue credit card into a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3K5TEWLKGY2O4OW6R08ZBA7DOLBVI6",
                    "high_descs":[
                        "Turn right and walk to the white shelves on the right.",
                        "Pick up the blue credit card behind the gold statue on the left side of the middle shelf.",
                        "Turn left and walk forward to reach the drawers of the white cabinets on the right.",
                        "Open the top drawer of the cabinets, put the credit card behind the keys inside and close the drawer."
                    ],
                    "task_desc":"Place a credit card in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3TPWUS5F8CSA6AABP0H9M9SWIPKWC6",
                    "high_descs":[
                        "Walk to the shelf behind you.",
                        "Grab a card from the middle shelf.",
                        "Go to the drawers on the left.",
                        "Put the card in the top drawer."
                    ],
                    "task_desc":"Move a card from a shelf to the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Drawer"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-Drawer-227/trial_T20190918_215750_186147/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_32KTQ2V7RG6C309U9E1VBLPXE109M6",
                    "high_descs":[
                        "Turn left and walk over to the white shelving unit on the wall.",
                        "Pick up the credit card out of the shelving unit.",
                        "Turn left and walk forward then stop in front of the drawers on your right.",
                        "Open the upper drawer in put the credit card inside, then close the drawer."
                    ],
                    "task_desc":"Put a credit card in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3EA3QWIZ4LM9RWSHM58KASJSR0PTII",
                    "high_descs":[
                        "Turn to your left and go straight to the white shelf's. ",
                        "Pick up the credit card on the credit card on the shelf above the gold vase. ",
                        "Turn to your left and go to the top drawer, on your right. ",
                        "Place the credit card in the top drawer. "
                    ],
                    "task_desc":"Put a credit card in a drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3FTF2T8WLU988C38DG7IKJROC4IW9Q",
                    "high_descs":[
                        "Turn around and go forward to the white shelves.",
                        "Pick up credit card from the second shelf from the bottom.",
                        "Turn left and walk forward with the credit card.",
                        "Open white drawer and place card inside and shut drawer. "
                    ],
                    "task_desc":"Put a credit card away in the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Drawer"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-227/trial_T20190908_170525_472933/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_33PPUNGG3BWI674ZIKRBA8L0ZNTRZP",
                    "high_descs":[
                        "Turn to the left, walk forward a few steps, then turn left again and walk over to face the front of the couch.",
                        "Pick up the set of keys that are on the far right side of the couch.",
                        "Turn to the left, walk to the end of the couch, hang a right, then make another right to walk behind the couch, and walk across the room to the floor lamp.",
                        "Turn on the floor lamp."
                    ],
                    "task_desc":"Examine a set of keys under the light of a lamp. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3KKG4CDWKLPWZAKO3A1ZPR8XS6Q94E",
                    "high_descs":[
                        "Turn to your left and go past the couch, then turn to your left again and go to the end of the couch to your right. ",
                        "Pick up the keys on the back, right corner of the right side of the couch. ",
                        "Turn to your left and go to the end of the couch, the turn right and go around, behind the couch, walk to the lamp in the left corner of the room.",
                        "Turn on the lamp in the left corner of the living room."
                    ],
                    "task_desc":"Turn on a living room light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3YMU66OBIQZ5QWVRWNRSBX3O1O5HGX",
                    "high_descs":[
                        "Go left and then turn left towards the couch and turn left to face the newspaper on the gray couch.",
                        "Pick the keys up from the couch.",
                        "Go left and then right to cross the room behind the couch and face the lamp in the corner.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Pick up keys and turn a lamp on.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-227/trial_T20190908_104240_678700/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_36V4Q8R5ZNRIVZQGQGCHXGFMOXZMQS",
                    "high_descs":[
                        "turn right, walk past the couch, turn left, walk past couch, turn left, walk to small round table",
                        "pick up the keys that are on smaller round table",
                        "turn around, walk to the table, turn right, walk past couch, turn right, walk across the room to the lamp, hold the keys up",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine keys with a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3ND9UOO81NT39E4H2DA8PSIJCTJWLX",
                    "high_descs":[
                        "Go right and then left and left again to face the table with the box on it.",
                        "Pick the keys up from the table.",
                        "Turn around and go right and the right again and pass behind the couch to face the lamp in the corner of the room.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Pick up some keys and turn a lamp on.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3R6BYFZZPA3WYMZBQ73WWYR6OZAFXB",
                    "high_descs":[
                        "Turn right and take two steps, then turn left and take three steps, then turn left and walk to the table. ",
                        "Pick up the keys that are on the bottom shelf of the coffee table. ",
                        "Turn around and walk to the table, then turn right and walk past the couch, then turn right and take three steps, then turn left  and take one step, then turn right and walk to the lamp. ",
                        "Turn the lamp on. "
                    ],
                    "task_desc":"Look at the keys in the light. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-Sofa-227/trial_T20190907_043317_552772/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3OF2M9AATJ5OYE56WSTX8AFKAZ2KZ3",
                    "high_descs":[
                        "Turn around, and go to the left in front of the couch to find the round coffee table.",
                        "Pick up the keys from the coffee table.",
                        "Take the keys and move a few steps to the right so the coffee table is still in front.",
                        "Put the keys inside the box on the coffee table.",
                        "Pick up the box from the coffee table.",
                        "Take the box, and move to the left just slightly around the table.",
                        "Place the box on the right side of the couch in front of you."
                    ],
                    "task_desc":"Put keys inside a box and move it to the couch.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2CT57W84KXX25_3VFJCI1K42GAU1NWWKE5OFLSU0TRG3",
                    "high_descs":[
                        "Walk to the round table ",
                        "Pick the keys up from the table",
                        "Take the keys and place them in to the box that is on the round table",
                        "Pick the box up from the table",
                        "Carry the box around the living room",
                        "Walk over to the couch ",
                        "Set the box down that has the keys in it"
                    ],
                    "task_desc":"Gather they keys and put them in the box",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_388U7OUMFAIDJXCBIIP23NYCNJS0RX",
                    "high_descs":[
                        "Turn right, go straight, turn right before the couch, go straight, turn left and go straight to the coffee table.",
                        "Take the keys from the coffee table.",
                        "Go to the side of the coffee table closer to the TV and face the coffee table.",
                        "Put the keys in the box on the coffee table.",
                        "Take the box from the coffee table.",
                        "Go around the coffee table to the left to the two seat couch ahead.",
                        "Put the box on the right seat of the couch."
                    ],
                    "task_desc":"Put a box with keys in it on a couch.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3COPXFW7XETUKA309JVVHCD6040KPV",
                    "high_descs":[
                        "Turn around and walk passed the couch toward the round grey coffee table.",
                        "Pick up the keys from the coffee table.",
                        "Turn to your right and walk around to other side of the stool next to you and approach the coffee table again.",
                        "Place the keys in the box sitting on the coffee table.",
                        "Pick up the box with the keys inside.",
                        "Walk back around the coffee table toward the grey sofa and stand in front of it.",
                        "Place the box on the right side of the grey sofa in front of you."
                    ],
                    "task_desc":"Get keys from coffee table, put them in the box on the table and place box on sofa.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3IXQG4FA2WF8ZKJZMHM5WJU188IB9K",
                    "high_descs":[
                        "Turn around and then walk left until you are at a coffee table",
                        "Pick up the keys off of the table",
                        "Turn right and then turn to your left twice so that you are facing the table again",
                        "Drop the keys into the empty cardboard box on the table",
                        "Pick up the cardboard box off of the table",
                        "Turn left then walk right, turn right again and then face to your left so you are looking at the sofa",
                        "Place the cardboard box on the right cushion of the sofa"
                    ],
                    "task_desc":"Place a cardboard box with keys in it on the sofa",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-Vase-None-DiningTable-227/trial_T20190909_050706_578681/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A32W24TWSWXW_308XBLVESLVMO91JC6B8OQEX8U6BRM",
                    "high_descs":[
                        "Turn around and take one step, turn left, walk to the end of the couch and turn right for two steps.",
                        "Pick up the round, red object.",
                        "Turn around and take two steps, turn right for two steps, turn left for three steps, and then turn right to face the white table.",
                        "Put the round, red object down on the table, to the bottom left of the cardboard box.",
                        "Turn right and walk past the couch, turn right for one step and then left to face the bookcase.",
                        "Open the cabinet on the top shelf, take out the silver vase, and shut the door.",
                        "Turn left for one step, turn left for five steps and turn right to face the table. ",
                        "Put the vase on the table near the chair on the left."
                    ],
                    "task_desc":"Put a red round object, a silver vase on the white table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_3I0BTBYZA0CU1NAVSL6DC5BBKB2Y0Z",
                    "high_descs":[
                        "turn around and walk straight a tiny bit then turn left and walk straight then turn left towards the shelf",
                        "pick up the red glass container on the shelf",
                        "turn around and walk straight towards the couch then turn right walk straight then turn left walk straight then turn right towards the table",
                        "put the red container down on the table",
                        "turn right and walk straight then turn right again and then turn left towards the shelf and look up",
                        "open the shelf door and remove the gray jar ",
                        "turn left walk straight a tiny bit then turn left again and walk straight then turn right towards the table",
                        "put the gray jar down on the table next to the red container "
                    ],
                    "task_desc":"clean up a container and jar and put them onto the table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "train/pick_two_obj_and_place-Vase-None-DiningTable-227/trial_T20190910_072914_747890/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1OWHPMKE7YAGL_3ZPPDN2SLYNERCHHSGDCYDKO54F9EX",
                    "high_descs":[
                        "Turn to the left, go past the TV to the end of the white shelf.",
                        "Pick up the vase that is on the shelf.",
                        "Turn around, go to the dining table that is on the left. ",
                        "Put the vase on the table in front of the statue.",
                        "Turn to the right, go forward, Turn to the right, go to the white cabinet just past the shelf with the statue on it. ",
                        "Remove the lid from the cabinet.",
                        "Turn around, go forward, turn to the right, go to the end of the couch and hang a left, go to the table on the right where the vase is.",
                        "Put the lid on the table to the right of the vase."
                    ],
                    "task_desc":"Put a vase and a lid on a table. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MP3NYIS55VQP_31EUONYN2YUY0A79PVL4V73Z0X9OVZ",
                    "high_descs":[
                        "Turn left and walk towards the cupboard under the TV. ",
                        "Pick up the glass vase on the right of the statue of the dog. ",
                        "Turn around and walk towards the table on the left. ",
                        "Put the vase on the table on the left of the newspaper. ",
                        "Turn right and go to the cupboard behind the sofa. ",
                        "Open the door and pick up the red disk from the cupboard.",
                        "Turn right and walk back to the table.",
                        "Put the red disk on the table between the vase and the newspaper. "
                    ],
                    "task_desc":"Put the vase and the red disk on the table. ",
                    "votes":[
                        0,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3RGU30DZTDZ19CM3VQS80F30AFWMJG",
                    "high_descs":[
                        "turn left to the tv stand",
                        "pick up the glass bowl from the stand",
                        "turn right and head to the dining table",
                        "drop the glass bowl on the table",
                        "turn around and head to the shelf",
                        "pick up the funnel from the shelf",
                        "turn left and head to the dining table",
                        "place the funnel on the table"
                    ],
                    "task_desc":"place a funnel with a glass bowl on the table",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "valid_seen/look_at_obj_in_light-CreditCard-None-FloorLamp-227/trial_T20190908_173545_981227/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A14IPKOBOPID9H_33JKGHPFYFLXS2DOAOK0TMKHJRINMM",
                    "high_descs":[
                        "Turn left and go between the sofa and the table then turn right and go behind the sofa, then turn left and go to the bookshelf",
                        "Pick up the credit card from the bookshelf",
                        "Turn around and go to the back of the sofa, then turn left and go past the sofa, then turn left and go to the wall then turn right and go to the lamp in the corner",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine the credit card by the light of the floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3QY5DC2MXUB4HI5GL2S9CRS2ULPUF2",
                    "high_descs":[
                        "Turn left and walk across the room towards the white shelves on the wall.",
                        "Pick up the blue credit card on the right side of the middle shelf.",
                        "Turn right and walk across the room to the tall lamp in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a credit card by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3ZAK8W07I75DKEQQIK9O9K5YOKCU0C",
                    "high_descs":[
                        "Turn around and walk to the shelf to your right.",
                        "Grab the credit card sitting on the shelf.",
                        "Holding the credit card, turn around, then walk to the lamp to your left in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Grab a credit card and turn on the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "FloorLamp"
            ]
        },
        "valid_seen/pick_and_place_simple-CreditCard-None-Drawer-227/trial_T20190909_010644_297017/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_31LM9EDVOOJ7RU737R78DUS0FXVJNM",
                    "high_descs":[
                        "Turn right and go forward to the wall, then turn right and go to the end of the table, then turn right to face the table.",
                        "Pick up the credit card on the table.",
                        "Turn left and go to the wall, then turn right and go straight, then turn around to face the drawer.",
                        "Open the top drawer and put the credit card inside."
                    ],
                    "task_desc":"Put the credit card in the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3UXUOQ9OKHO7NGCCXED6OY3RPUKA78",
                    "high_descs":[
                        "Turn to the right and cross the room, turn right and walk to the end of the table on your right. ",
                        "Pick up the blue credit card that is sitting on the table in front of the newspaper",
                        "Turn left and walk to the drawers and shelves that are built into the wall",
                        "Open the top drawer, the one that is directly below the black empty shelf space, and place the credit card inside then close the door"
                    ],
                    "task_desc":"Place a credit card into a drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3Z7EFSHGNC5PVAF1Z5DVOS63RRRCXG",
                    "high_descs":[
                        "Turn right, walk forward all the way across the room to the wall, then turn right and walk to the credit card on the dining table.",
                        "Pick up the credit card from the dining table.",
                        "Turn left and walk to the wall, then turn right and walk slightly forward and turn around towards the drawers in the wall.",
                        "Put the credit card in the top drawer and then close the drawer."
                    ],
                    "task_desc":"Move a credit card from a dining table to a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Drawer"
            ]
        },
        "tests_seen/trial_T20190909_033947_705114/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and move across the living room to the left hand side of the large white shelf.",
                        "Pick up the vase on the bottom white shelf.",
                        "Turn right and go to the coffee table in the middle of the living room.",
                        "Place the vase down on the coffee table next to the laptop.",
                        "Turn right and go back to the black shelf to the right of the large white shelf.",
                        "Pick up the blue object from the black shelf.",
                        "Turn around and go back to the coffee table.",
                        "Place the blue object on the coffee table to the left of the laptop and vase."
                    ],
                    "task_desc":"Move the vase and the blue object from the shelves to the coffee table."
                },
                {
                    "high_descs":[
                        "walk to face white shelves",
                        "pick up glass vase from shelves",
                        "walk to face coffee table",
                        "put vase on coffee table",
                        "walk to face shelves with blue vase",
                        "pick up blue pot from shelves",
                        "walk to face coffee table",
                        "put pot on coffee table"
                    ],
                    "task_desc":"put a pot and vase on coffee table"
                },
                {
                    "high_descs":[
                        "Turn right and cross the room to go to the shelf ahead.",
                        "Pick up the vase from the shelf.",
                        "Turn right and move forward, then turn right at the black table.",
                        "Put the vase on the black table.",
                        "Turn right and move forward, then turn right to face the shelf with the blue vase on it.",
                        "Pick up the blue vase from the shelf.",
                        "Turn right move forward, then turn right to face the black table.",
                        "Put the blue vase on the black table."
                    ],
                    "task_desc":"Move to vases to the black table."
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "tests_seen/trial_T20190907_043415_902731/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to your right and head to the center table",
                        "Grab the keys on the table beside the box",
                        "Go to the on the other side of the center table behind the tv",
                        "Put the keys on the box",
                        "Pick up the box on the table with the key",
                        "Turn around and head to the biggest sofa",
                        "Put the box on the right side of the sofa"
                    ],
                    "task_desc":"Put the box with keys on the sofa"
                },
                {
                    "high_descs":[
                        "turn right, and carefully make your way between the chairs and table to the last chair. Stop and face the grey round table.",
                        "take the keys from the table",
                        "move out of the circle and towards the television, then stop, and face the same round grey table",
                        "Put the keys in the empty box on the table",
                        "Take the box with the keys",
                        "cross the room to the couch in front of you",
                        "place the box on the right-side cushion of the couch."
                    ],
                    "task_desc":"Place a box with keys in it on the couch"
                },
                {
                    "high_descs":[
                        "Move to the coffee table nearest to two arm chairs. ",
                        "Pick up the keys from the coffee table.",
                        "Move around to the left side of the coffee table.",
                        "Place the keys inside the box on the table.",
                        "Pick up the box from the coffee table.",
                        "Move around to the couch on the other side of the coffee table.",
                        "Place the box on the couch."
                    ],
                    "task_desc":"Put the box on the coffee table on the couch with keys inside."
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190907_043122_619510/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and walk to the long cabinet then turn right and walk past the circular stand on your right then turn right and walk to the couch.",
                        "Pick up the set of car keys on the couch.",
                        "Turn around and take a couple steps until you're even with the table on the left with a remote on it then turn left to face it.",
                        "Put the keys in the box.",
                        "Pick up the box with the keys in it.",
                        "Stand slightly to the right of where you got the keys.",
                        "Put the box on the couch near it's right arm."
                    ],
                    "task_desc":"Put a box with keys in it on the couch."
                },
                {
                    "high_descs":[
                        "Go around the coffee table and go to the couch.",
                        "Pick up the keys on the couch.",
                        "Turn to the coffee table.",
                        "Put the keys in the box on the coffee table.",
                        "Pick up the box with the keys in it.",
                        "Turn back to the sofa and go to the right side.",
                        "Set the box on the right side of the sofa."
                    ],
                    "task_desc":"Set a box with keys inside on the sofa."
                },
                {
                    "high_descs":[
                        "Turn right and walk past the coffee table to stand in front of the leftmost cushion of the sofa.",
                        "Pick up the keys from the sofa.",
                        "Turn around and carry the keys to the coffee table, so you're facing the table and the sofa is to your left.",
                        "Place the keys in the open box on the coffee table.",
                        "Pick up the box with the keys in it from the table.",
                        "Carry the box to stand facing the center point of the sofa.",
                        "Place the box on the right cushion of the sofa."
                    ],
                    "task_desc":"Place a box with keys inside on the sofa."
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        }
    }
}