{
    "scene_name":"FloorPlan416",
    "trials":{
        "train/pick_two_obj_and_place-SprayBottle-None-GarbageCan-416/trial_T20190909_001522_308289/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_39KFRKBFIQMF442EU68O267TICHOYA",
                    "high_descs":[
                        "Turn right and face the toilet to your right.",
                        "Take the spray bottle from the toilet in front of you.",
                        "Face the can near the toilet in front of you.",
                        "Place the spray bottle in the can in front of you.",
                        "Turn right and face the toilet on your left.",
                        "Take the second spray bottle from the toilet in front of you.",
                        "Turn around in a circle and face the can in front of you.",
                        "Place the spray bottle in the can on the right of the toilet in front of you."
                    ],
                    "task_desc":"Place the spray bottle in the can on the right of the toilet.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_two_obj_and_place-ToiletPaper-None-Drawer-416/trial_T20190908_013005_772043/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A10AVWALIHR4UQ_3E13VNJ1NQC0XNUAOEZT30GV5WCI19",
                    "high_descs":[
                        "Turn to the right, move past the door, then turn to the right and move and face the toilet.",
                        "Pick up the roll of toilet paper from the top of the toilet cistern to the right of the purple spray bottle.",
                        "Turn right, move to the vanity, then turn left, back up, and face the vanity.",
                        "Open the vanity drawer, place the toilet paper roll in the drawer, then close the vanity drawer.",
                        "Turn left, move past the white door, then turn right and move to the tiled area between the window and the toilet.",
                        "Pick up the empty toilet paper roll from the floor in front of the toilet brush.",
                        "Turn around, move towards the shower stall, then turn to the left and face the vanity.",
                        "Open the vanity drawer, place the empty toilet paper roll to the left of the toilet paper roll in the drawer, then close the drawer."
                    ],
                    "task_desc":"Place one full toilet paper roll and one empty toilet paper roll in the bathroom vanity.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3OONKJ5DKF0B67N5O65NT9PQ3H0BOE",
                    "high_descs":[
                        "Turn right towards the wall, and then turn right towards the toilet.",
                        "Pick up the toilet paper on the toilet basin.",
                        "Turn right towards the first sink and take a step backwards.",
                        "Pull out the bottom drawer below the sink and place the toilet paper in it.",
                        "Turn left towards the wall and then turn right towards the toilet.",
                        "Pick up the cardboard roll on the floor to the left of the toilet.",
                        "Turn around, walk towards the door, turn left, take a few steps and turn left towards the sink.",
                        "Pull out the bottom drawer below the sink and place the cardboard roll in it."
                    ],
                    "task_desc":"Place the toilet paper along with the cardboard roll in the drawer below the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_two_obj_and_place-ToiletPaper-None-Drawer-416/trial_T20190908_013116_583250/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_3IAEQB9FMH1CQDURTON35TQC95VWD4",
                    "high_descs":[
                        "Turn left, hang a right at the shower and walk to the gray container on the floor.",
                        "Pick up the empty toilet paper roll from the right corner of the toilet tank to your left.",
                        "Turn around, hang a left at the shower and face left just before the wall to reach the drawers under the vanity.",
                        "Place the empty toilet paper roll inside the right drawer on the right side and close the drawer.",
                        "Turn left, hang a right just before the shower and head to the counter.",
                        "Pick up the roll of toilet paper in between the sink and the blue bottle on the counter.",
                        "Turn around, walk towards the door and turn around again to face the drawers.",
                        "Place the roll of toilet paper inside the right drawer to the right of the empty roll."
                    ],
                    "task_desc":"Place an empty and a full toilet paper roll in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3IXEICO7950LDNBIOWAEC39LOO76TB",
                    "high_descs":[
                        "Turn left, walk towards the wall, and then turn right to find a bin to the right of the toilet.",
                        "Take out the cardboard roll from the bin.",
                        "Turn around, head towards the door, turn left towards the wall, and then turn left to face two sinks.",
                        "Place the cardboard roll in the drawer below the right sink.",
                        "Take a few step towards the middle of the two sinks.",
                        "Pick up the toilet paper on the sink counter.",
                        "Take a step backwards from where you are at.",
                        "Place the toilet paper  in the drawer below the right sink."
                    ],
                    "task_desc":"Place the toilet paper along with the cardboard roll in the drawer below the right cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3RWE2M8QWKRS4ZKJPB8LU3T2M3R0NV",
                    "high_descs":[
                        "Turn left and walk across the room, then turn right and walk forward to face the trash can.",
                        "Pick up the empty toilet paper roll on the back of the sink.",
                        "Turn right and cross the room and turn left to face the right side sink.",
                        "Place the empty toilet paper roll in the drawer below the right side sink.",
                        "Step to the left to face the toilet paper roll between the sinks.",
                        "Pick up the toilet paper roll on the sink.",
                        "Step back to face the drawer below the right side sink.",
                        "Put the toilet paper roll in the drawer beside the empty toilet paper roll."
                    ],
                    "task_desc":"Put a full and empty toilet paper roll in the drawer under the right side sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_two_obj_and_place-ToiletPaper-None-Drawer-416/trial_T20190908_013040_862247/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3YGXWBAF73YQCJ5TJMM9QVP349I4CI",
                    "high_descs":[
                        "Move across the room to the center of the vanity in between the sinks. ",
                        "Pick up the full roll of toilet paper that is closest to the back. ",
                        "Move to the right side of the vanity. ",
                        "Open the bottom drawer on the right hand side.  Put the roll of toilet paper inside the drawer. Close the drawer. ",
                        "Move back to the left to the center of the vanity in between the sinks. ",
                        "Pick up the empty toilet paper roll off of the counter. ",
                        "Move to the right side of the vanity. ",
                        "Open the bottom drawer on the right hand side.  Put the empty toilet paper roll inside the drawer. Close the drawer. "
                    ],
                    "task_desc":"Move 2 rolls of toilet paper - one empty, one full - to the lower right drawer of the vanity. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-SinkBasin-416/trial_T20190909_032528_576498/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_30LSNF239XMF7XY43QOO95A2RQKI2T",
                    "high_descs":[
                        "Turn around and look up to face the towel hanging on the wall.",
                        "Pick up the towel hanging on the wall.",
                        "Take a step to the right to face the left side of the sink.",
                        "Place the towel in the left side of the sink."
                    ],
                    "task_desc":"To move a towel from the wall to the left side of the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3IKZ72A5B77RMSL7O1GNYW08MTNNF2",
                    "high_descs":[
                        "Turn around and go to the white towel hanging from the towel holder on the wall, between the toilet and the sink. ",
                        "Remove the towel from the towel holder on the wall. ",
                        "Turn around and go to the sink on your left.",
                        "Place the towel in the left sink, closest to the toilet."
                    ],
                    "task_desc":"Put a hand towel in the sink. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3NPFYT4IZFV2CMV61R9EEJRIPMXGXE",
                    "high_descs":[
                        "Turn around and face the towel hanging to the right of the mirror.",
                        "Pick the towel up from the towel ring on the wall.",
                        "Turn around and go left and then turn to the left and face the counter between the sink.",
                        "Put the towel in the sink on the left."
                    ],
                    "task_desc":"Put a towel in a sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-SinkBasin-416/trial_T20190909_032632_791113/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_32RIADZISVVE4PGNCG1Q6MDNK20S49",
                    "high_descs":[
                        "Take a right at the door, walk to the gray bin on the floor next to the toilet and look up at the metal ring with the towel on the wall.",
                        "Pick up the white towel from the metal ring on the wall.",
                        "Turn around, turn left and walk to the middle of the vanity between the sinks on the left.",
                        "Put the towel inside the left sink on the vanity."
                    ],
                    "task_desc":"Place a towel in a sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3EG49X351X30FT60PE0S2SETV806X8",
                    "high_descs":[
                        "Walk straight, make a quick right, walk to the towel hook straight ahead and look up.",
                        "Grab the towel on the towel hook.",
                        "Turn around, turn left and walk to the sinks to your right.",
                        "Place the towel in the sink to the left."
                    ],
                    "task_desc":"Place a towel in the left sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3EICBYG647NO0QACI1YUXJYOGW1CJN",
                    "high_descs":[
                        "Make a right to walk towards the hanger on the left side of the sinks.",
                        "Take the white towel off of the hanger.",
                        "Turn right to walk towards the middle of the sinks.",
                        "Set the white towel down in the sink on the left."
                    ],
                    "task_desc":"Move a white towel from it's hanger to the left-hand sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-SinkBasin-416/trial_T20190909_032549_730713/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3E1QT0TDFS0QTC0TJ7XPJWN5DQH8IR",
                    "high_descs":[
                        "Walk over to the wall to the left of the sink counter.",
                        "Pick up the wash cloth off of the metal ring on the wall in front of you.",
                        "Turn around and walk over to the middle of the sink counter.",
                        "Put the wash cloth in the leftmost sink basin."
                    ],
                    "task_desc":"Put a wash cloth in the left sink.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3UOUJI6MTG5LH4W1LWYVIYS9YUBUXR",
                    "high_descs":[
                        "Turn around and walk across the room towards the towel hanger on the left side of the sinks.",
                        "Take the towel from the hanger.",
                        "Turn right to walk towards the sinks.",
                        "Set the towel in the sink on the left."
                    ],
                    "task_desc":"Move a towel to the left-hand sink.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3QJOXOW4XMITYW0BHPHH3ZQ8570EMN",
                    "high_descs":[
                        "Take a right, turn left and walk to the gray bin next to the toilet on the right.",
                        "Look up at the towel and pick it up from the metal ring holder.",
                        "Turn around and walk to the middle of the vanity on the left in between the sinks.",
                        "Put the towel inside the left sink."
                    ],
                    "task_desc":"Place a towel inside a sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-GarbageCan-416/trial_T20190907_024728_127108/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_37M28K1J0TUSMMRG2FDMQ2OYLR5AJ6",
                    "high_descs":[
                        "Turn right and head towards the silver bin on the ground next to the toilet.",
                        "Take the pink bar soap from the bin.",
                        "Turn right and head towards the sinks on your left.",
                        "Place the soap in the right sink, turn on the faucet, wash the soap, turn off the faucet, and pick up the soap.",
                        "Turn left and head towards the toilet on your right.",
                        "Place the bar soap in the silver bin on the right side of the toilet."
                    ],
                    "task_desc":"Wash the bar soap from the silver bin.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3G5F9DBFOSEGN4ZOPA1XACMWT9QHVX",
                    "high_descs":[
                        "Turn right and move towards the wall then turn left and face the rubbish bin.",
                        "Pick up the bar of soap from the rubbish bin.",
                        "Turn around and move towards the shower then turn left and move towards the end of the room then turn left and face the counter.",
                        "Place the bar of soap in the sink to the right, turn on the faucet, turn off the faucet, and pick up the bar of soap from the sink.",
                        "Turn around and move towards the door the turn right and move towards the toilet then turn right to face the toilet.",
                        "Place the soap bar in the rubbish bin to the right of the toilet."
                    ],
                    "task_desc":"Place a rinsed bar of soap in the rubbish bin.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3JZQSN0I3TRDRBIN5PEB7Q79QEMFG3",
                    "high_descs":[
                        "Turn right and walk to the trash bin by the toilet",
                        "Pick up the pink towel in the trash bin",
                        "Turn right and go to the sink",
                        "Put the pink towel in the sink on the right, fill the sink with water, wash the towel and take it out",
                        "Turn left and walk to the toilet",
                        "Put the pink towel in the trash bin by the toilet"
                    ],
                    "task_desc":"Wash the pink towel in the trash bin and put it back ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Plunger",
                "SoapBar"
            ]
        },
        "train/pick_two_obj_and_place-SoapBar-None-GarbageCan-416/trial_T20190907_143831_034600/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ACSS93E03ZUGX_3M1CVSFP63M989VTX5XVN30K0JOQAZ",
                    "high_descs":[
                        "Turn to the left to face the sink.",
                        "Pick the soap up from off of the sink. ",
                        "Move to the left to face the toilet.",
                        "Place the soap in the trash can next to the toilet.",
                        "Move to the right to face the sink to the far left.",
                        "Pick up the soap from the sink.",
                        "Move to the left to face the toilet.",
                        "Place the soap in the trash can next to the toilet."
                    ],
                    "task_desc":"Place both soaps inside of the trash can next to the toilet.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Drawer-416/trial_T20190908_040722_151303/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3DQQ64TANJ2LFAXHYXEY5N71NMHPWQ",
                    "high_descs":[
                        "Turn around, head to the sink next to the toilet. ",
                        "Pick up the rag on the counter next to the sink. ",
                        "Wash the rag in the sink to the right. ",
                        "Bring the cleaned rag to the drawer under the right sink.",
                        "Put the cleaned rag in that drawer. "
                    ],
                    "task_desc":"Put a cleaned rag in a drawer under the right sink. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3ZGVPD4G6WYN1XVTQ17P912GTQ6TZN",
                    "high_descs":[
                        "Turn around and head to the vanity with the 2 sinks that is ahead of you on the right",
                        "Pick up the yellow cloth that is sitting on the vanity",
                        "Place the towel in the sink on the right and turn on the water to rinse off the towel, then turn the water off and pick up the towel",
                        "Turn around and take a few steps, then turn around the face the vanity",
                        "Open the drawer that is under the right sink and place the towel inside then close the drawer"
                    ],
                    "task_desc":"Place a clean towel in a drawer",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_39DD6S19JSSLCEDW06IUAF2FQO3ZE3",
                    "high_descs":[
                        "Turn to the left, and walk to the sink.",
                        "Grab the yellow towel that's on the sink.",
                        "Place the towel under the faucet to soak it.",
                        "Grab the towel, and walk to the drawer.",
                        "Open the drawer and place the wet towel inside the drawer."
                    ],
                    "task_desc":"Soak the towel, and place it inside the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Drawer-416/trial_T20190908_040658_918781/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_30BXRYBRP7ET2TZTFK6TWE5A1WTHW1",
                    "high_descs":[
                        "Move to your right so that you are in front of the bathroom counter, between the two sinks. ",
                        "Pick up the yellow rag on the counter, in front of the nail polish. ",
                        "Put the rag in the sink to the right, turn the water on and get the rag wet, turn the water off, and remove the rag from the sink.",
                        "Step back from the counter and move to your right so that you are now in front of the right sink. ",
                        "Place the yellow rag in the top drawer that is underneath the right sink."
                    ],
                    "task_desc":"Put the wet rag in the drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3QAVNHZ3EPLYHCFG50PZ6H1QQUZALQ",
                    "high_descs":[
                        "Move to your right and then turn left to face the sinks",
                        "Pick up the wash cloth from off of the counter",
                        "Put the cloth in the right sink and soak it in water, then pick it back up",
                        "Turn around so that you can essentially take a step back",
                        "Open the drawer and put the cloth in to it"
                    ],
                    "task_desc":"Soak a cloth and put it away",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3QY7M81QHA35E4Z0DX1EHQML0MN7KS",
                    "high_descs":[
                        "Move slightly to the right to stand in between the sinks.",
                        "Pick up the cloth from the counter.",
                        "Rinse the cloth in the sink on the right.",
                        "Back up slightly from the counter and open the drawer on the right.",
                        "Put the cloth in the drawer."
                    ],
                    "task_desc":"Put a rinsed cloth in the drawer below the rightmost sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Drawer-416/trial_T20190908_040609_717998/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_36NEMU28XIUFU7046HM6OJD6IHYMWJ",
                    "high_descs":[
                        "Turn right to face the counter between the two sinks.",
                        "Pick the wash cloth closest to the edge of the counter up.",
                        "Put the wash cloth in the sink to the right and turn the water on and then off and pick the cloth back up.",
                        "Move to the right to face the cabinet under the sink on the right.",
                        "Open the bottom right cabinet and put the wash cloth in and shut it again."
                    ],
                    "task_desc":"Put a wash clean cloth in a cabinet.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3S3AMIZX3XM3CFOMCXN2TZJ9HNCCD6",
                    "high_descs":[
                        "Turn to the right and locate the two sinks.",
                        "Pick up the cloth that is in the front, from the counter.",
                        "Place the cloth in the right sink, turn the water on and then off. Pick up the cloth from the sink.",
                        "Take the cloth and take a few steps backward.",
                        "Open the most right drawer and place the cloth inside, then shut the drawer."
                    ],
                    "task_desc":"Rinse a cloth and put it away in the drawer.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3TPZPLC3M3TOOCVTOD3W0QW4PTGP3D",
                    "high_descs":[
                        "Head right to the sink, Take the yellow wash cloth from the counter",
                        "Put the yellow cloth in the sink, turn on the water for 3 seconds",
                        "Take the yellow cloth from the sink",
                        "Turn around, take a couple steps, turn around",
                        "Open the drawer under the sink, put the yellow cloth in the drawer, close the drawer"
                    ],
                    "task_desc":"Wash the yellow cloth, put it in the drawer",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-CounterTop-416/trial_T20190909_032310_871218/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3BDCF01OG0L7YJZHHESWAP3ZNADLYX",
                    "high_descs":[
                        "Look down at the gray bin to the right of the toilet. ",
                        "Pick up the bar of soap from the gray bin. ",
                        "Walk to the counter to the right of the toilet. ",
                        "Put the bar of soap in the sink on the right, rinse off the bar of soap, pick up the bar of soap. ",
                        "Walk over to the left side of the counter. ",
                        "Put the soap down on the counter to the right of the left sink. "
                    ],
                    "task_desc":"To rinse off a bar of soap and put it on the counter. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3GD6L00D3VOUEV6Z51M2WF7EGUQ1MD",
                    "high_descs":[
                        "Look down.",
                        "Take the soap out of the garbage bin.",
                        "Take a couple steps right.",
                        "Rinse the soap in the right sink.",
                        "Take a step left.",
                        "Place the soap on the counter between the two sinks, to the left of the soap bottles."
                    ],
                    "task_desc":"Place a rinsed bar of soap on a counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3J88R45B2JP8PZO54AZ18S5AQEFXPW",
                    "high_descs":[
                        "Look down at the gray bin on the floor next to the toilet.",
                        "Pick up the bar of soap from inside the gray bin.",
                        "Turn around, turn left and walk to the middle of the vanity on the left.",
                        "Put the bar of soap inside the right sink, rinse it for a few seconds and pick it back up.",
                        "Turn around and head right to the left sink on the vanity counter.",
                        "Put the rinsed bar of soap to the right of the left sink on the counter next to the candle."
                    ],
                    "task_desc":"Place a rinsed bar of soap on a counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-CounterTop-416/trial_T20190909_090331_330612/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_31QTRG6Q2W4XP4EF96L3R6CJSJSYPK",
                    "high_descs":[
                        "Turn around facing the bar of soap on the edge of the counter closest to you",
                        "Place the bar of soap in the right sink",
                        "Turn on the water, wash the soap, pick up the soap and turn off the water",
                        "Move to the sink on the left side",
                        "Place the soap to the right of the sink on the counter in front of the other bar of soap"
                    ],
                    "task_desc":"Wash soap to return to counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3DR23U6WE85XBRQVQMITPDL0ZAAETS",
                    "high_descs":[
                        "Turn around to face the sink.",
                        "Pick up the pink bar of soap that's in front of you close to the edge of the counter.",
                        "Get the soap wet in the right sink and then pick it back up and shut off the water.",
                        "Take two steps to your left to face the left sink.",
                        "Put the soap near the edge to the right of the left sink."
                    ],
                    "task_desc":"Put a wet bar of soap on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3PW9OPU9PTB47R26VJ3IH6TGAOP211",
                    "high_descs":[
                        "Turn around towards the counter top.",
                        "Pick up the bar of soap closest to you from the counter.",
                        "Put the bar of soap in the sink on the right, rinse it off, and take it back out.",
                        "Turn left and walk to the sink on the left, then turn right towards the counter.",
                        "Put the bar of soap back onto the counter, in front of and to the right of the sink on the left."
                    ],
                    "task_desc":"Put a cleaned bar of soap on a counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-CounterTop-416/trial_T20190909_032422_085040/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2RVDEU138ZF9P_38F5OAUN5Q3MX3KQ3KNY5KQV2T97HN",
                    "high_descs":[
                        "Turn around and walk forward, then turn left at the bathroom sink.",
                        "Pick up the pink soap bar from the counter.",
                        "Place the soap bar inside the sink and turn on the faucet, then turn it off and pick up the soap.",
                        "Turn left and walk towards the adjacent sink.",
                        "Place the soap bar on the counter next to the candle."
                    ],
                    "task_desc":"Wash the bar of soap and place it on the sink counter. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3SBEHTYCWQU58IRBWBVJI9B765WYI7",
                    "high_descs":[
                        "turn right, take a step, turn right, walk forward, turn left, walk to counter",
                        "pick up the pink bar of soap that is on the counter",
                        "put the pink bar of soap in the sink on the right, fill the sink with water, take the bar of soap out",
                        "turn around, take a step, turn right, take a few steps, turn right to face sink",
                        "put the soap on the counter to the right of the sink"
                    ],
                    "task_desc":"put wet soap on the counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3WRFBPLXRDFW6G5E46FLXNBBJ3V3NM",
                    "high_descs":[
                        "turn around and walk over to the bathroom sink on the left side end of the room",
                        "grab a bar of soap off of the bathroom counter there",
                        "place the soap inside the right side bathroom sink, rinse it off then take it back out",
                        "turn left and walk over to the left side bathroom sink on the right",
                        "place the bar of soap down on the bathroom sink counter to the right of the left side sink"
                    ],
                    "task_desc":"place a clean bar of soap on top of the bathroom sink counter",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-GarbageCan-416/trial_T20190909_003119_083823/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_3PZDLQMM0WCOUUC4BGS2Y2C7EJUC2B",
                    "high_descs":[
                        "Turn right and face the sink to your left.",
                        "Take the green cream bottle from the sink in front of you.",
                        "Turn left and face the toilet on your right.",
                        "Place the green cream bottle in the can near the toilet in front of you.",
                        "Turn right and face the can near the toilet on your left.",
                        "Take the green bottle out of the can in front of you.",
                        "Turn around then right and face the toilet on your right.",
                        "Place the green bottle in the can near the toilet in front of you."
                    ],
                    "task_desc":"Place a bottle in the can near the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle"
            ]
        },
        "train/pick_two_obj_and_place-SoapBottle-None-GarbageCan-416/trial_T20190909_003049_760772/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_37QW5D2ZRJDFNQ3POJR3NYTSMMD8S9",
                    "high_descs":[
                        "Move towards the sink in front of you.",
                        "Take a bottle from the counter in front of you.",
                        "Turn left and face the toilet to the right.",
                        "Place the bottle in the bin near the toilet in front of you.",
                        "Face the toilet tank in front of you.",
                        "Take the bottle from on top of the toilet in front of you.",
                        "Face the bin near the toilet in front of you.",
                        "Place the bottle in the bin near the toilet in front of you."
                    ],
                    "task_desc":"Place bottle in the bin near the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A271V19C06841K_3PJUZCGDJ97XIB7QFDRC63O2UYY898",
                    "high_descs":[
                        "turn right then left to the counter ",
                        "pick up bottle off of counter",
                        "turn around and walk then turn right",
                        "put the bottle into the trash can",
                        "look up at the back of the toilet ",
                        "pick up the bottle off the back of the toilet",
                        "look down to the trash can",
                        "place bottle into the trash can "
                    ],
                    "task_desc":"take bottle off of counter, place in trash can, take bottle off of back of toilet, put in trash can ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SprayBottle"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-CounterTop-416/trial_T20190909_045204_373695/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Z43TA0WZ0EG0_326O153BMLPQU2UY4WIEK93EWO3DEP",
                    "high_descs":[
                        "Turn around and go left towards the white hand towel between the mirror and toilet.",
                        "Grab the hand towel from the holder.",
                        "Turn around and head left to the first sink.",
                        "Place the hand towel on the sink next to the jar of soap."
                    ],
                    "task_desc":"To take the hand towel and set it down on the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_37KGEN7NJ6H3GQMEIJPKEFJ7OE9PP1",
                    "high_descs":[
                        "turn right, take a step, turn left, take a few steps, turn right, walk forward to the toilet",
                        "pick up the towel that is on the towel rack above",
                        "turn around, take two steps, turn left, take a few steps, turn left to face sink",
                        "put the towel on the counter in between the sinks"
                    ],
                    "task_desc":"move towel from towel rack to counter",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3ZAK8W07I75DKEQQIK9O9K5YONNU0T",
                    "high_descs":[
                        "move forwards to the corner of the room on the right",
                        "grab the towel off of the towel rack there to the right of the toilet",
                        "turn around to back up a bit, then take a left to move forwards just a bit, then a left to end up at the bathroom sink",
                        "place the towel down on the bathroom sink counter"
                    ],
                    "task_desc":"place a towel down on top of the bathroom sink counter",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-CounterTop-416/trial_T20190909_045221_760575/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Z43TA0WZ0EG0_3GU1KF0O4LS1CWL4ZE7JJVEI7A3BPB",
                    "high_descs":[
                        "Turn left and head towards the toilet and the hand towel holder on the wall.",
                        "Grab the hand towel from the holder.",
                        "Turn around and go left toward the sink with the pink soap in the bowl.",
                        "Place the hand towel on the sink next the the candle."
                    ],
                    "task_desc":"To place the hand towel onto the bathroom sink next the candle.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3IOEN3P9SAASPSL7ILFL7JASQTS61N",
                    "high_descs":[
                        "Turn to the left then turn to the right and head straight to the toilet.",
                        "Take down the towel between the toilet and the counter.",
                        "Turn to the left and go forward and then turn to face the sink.",
                        "Place the towel on the sink counter. "
                    ],
                    "task_desc":"Move the towel to the sink counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3SEPORI8WQQQ7QIIG95PFIWQZRTAZ4",
                    "high_descs":[
                        "Make a left and then a right to walk towards the towel hanger on the left side of the sinks.",
                        "Take the white towel off of the hanger.",
                        "Turn to walk towards the sinks on the left.",
                        "Set the white towel down on the counter to the right of the candlestick."
                    ],
                    "task_desc":"Move a white towel from it's hanger to the sink countertop.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "Candle"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-CounterTop-416/trial_T20190909_045148_475019/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3G5W44VEUA9WSMWZ28UPOPJGTDIGKP",
                    "high_descs":[
                        "Turn to your left and go to the towel hanging from the towel holder between the toilet and the sink. ",
                        "Remove the towel from the towel holder. ",
                        "Turn around and go to the counter space between the two sinks, on your left. ",
                        "Place the towel on the counter, to the left of the blue spray bottle. "
                    ],
                    "task_desc":"Put the hand towel on the counter. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3JC6VJ2SAEAS0CYT9LY9QEPVYSC5AJ",
                    "high_descs":[
                        "Turn left and walk to the end of the counter then turn right to face the trash can, then look up at the towel hanger.",
                        "Take the towel from the towel hanger.",
                        "Turn right and walk to the sink.",
                        "Put the towel on the left side of the purple spray bottle."
                    ],
                    "task_desc":"Put a towel on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3PPTZCWALTBIU6PZ552B5IBV392ZQN",
                    "high_descs":[
                        "Turn to the left and then face the trash can on the right. Look up to the hanger.",
                        "Take off the towel from the hanger on the wall.",
                        "Carry the towel and take a few steps to the right, and face the sink.",
                        "Place the towel on the counter, to the right of the sink."
                    ],
                    "task_desc":"Move a towel to the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-GarbageCan-416/trial_T20190906_202104_886119/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1P0XSCJ9XAV74_3ATPCQ38JBRIHBMFOFEP0P3MY0UYAE",
                    "high_descs":[
                        "Turn around and walk to the window then turn to the right to face the items on the floor.",
                        "Pick up the toilet paper roll from the floor.",
                        "Turn all the way around until you are in front of the toilet.",
                        "Throw the toilet paper roll in the trash can beside the toilet."
                    ],
                    "task_desc":"To throw away an empty toilet paper roll.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3MX2NQ3YCCBWB0KOON1690GR4CR5XT",
                    "high_descs":[
                        "Turn around and walk to the window",
                        "Pick up the paper roll on the ground",
                        "Turn around and around",
                        "Put the roll in the trash bin by the toilet"
                    ],
                    "task_desc":"Pick up the empty paper roll, throw it in the trash bin",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3WEV0KO0OP9JJWDI9JD284NR2J6SD9",
                    "high_descs":[
                        "Turn around and head towards the window on the opposite room and then turn right to face the plunger on the floor.",
                        "Pick up the cardboard roll from the floor.",
                        "Turn right and find the grey bin on the floor to your left.",
                        "Place the cardboard roll in the bin."
                    ],
                    "task_desc":"Place the cardboard roll in the trash bin.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-GarbageCan-416/trial_T20190906_202053_549622/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A10AVWALIHR4UQ_3GLB5JMZF0CGTR4REJJLJQ4OE8EGDF",
                    "high_descs":[
                        "Turn right and move towards the window next to the toilet paper dispenser then turn right and face the toilet in the corner of the bathroom.",
                        "Take the cardboard roll to the left of the soap bar from the top of the toilet cistern.",
                        "Back up from the toilet slightly.",
                        "Place the cardboard roll in the rubbish bin between the toilet and the vanity."
                    ],
                    "task_desc":"Place a cardboard roll into a rubbish bin.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3T3IWE1XG94EN5U235OCI8QCNGHQT7",
                    "high_descs":[
                        "Turn around and go right, turn right to reach the toilet.",
                        "Pick up the cylinder from the back of the toilet, between the two candles. ",
                        "Go down to the waste basket, to the right of the toilet.",
                        "Put the cylinder in the toilet."
                    ],
                    "task_desc":"Throw out an empty toilet paper roll. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3TE3O85733PKF7FPX5TGMBRRJQDR2Q",
                    "high_descs":[
                        "Turn around and take a step, then turn right and begin walking across the room, once at the toilet turn right to face it.",
                        "Remove the cardboard toilet paper tube off of the toilet tank.",
                        "Look down to face the toilet.",
                        "Place the cardboard toilet paper tube into the small grey trash can to the right of the toilet."
                    ],
                    "task_desc":"Move a cardboard toilet paper tube into a trash can.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-GarbageCan-416/trial_T20190909_062150_965386/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_386PBUZZXIOH3U4IVERT02OBA2DJL2",
                    "high_descs":[
                        "walk to face towel rack above and to the right of the toilet",
                        "pick up the towel from the towel rack",
                        "walk back to face the toilet",
                        "put the towel into the garbage can to the right of the toilet"
                    ],
                    "task_desc":"put a towel into a garbage can",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3WJEQKOXABTTCUXA8YWXNOCEMAOA1J",
                    "high_descs":[
                        "walk forward, turn right, walk forward to face towel rack",
                        "pick up the towel that is on the rack",
                        "turn around, take two steps, turn right, take a step, turn to face toilet",
                        "put towel in the trash can to the right of the toilet"
                    ],
                    "task_desc":"throw away a towel",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3OVR4I9USSA2R91AKCCLBMYM2BBQ48",
                    "high_descs":[
                        "Hang a right at the end of the shower, walk to the gray container on the floor and look up at the towel holder on the wall.",
                        "Pick up the towel from the metal ring on the wall.",
                        "Turn around and walk to the toilet on the right.",
                        "Put the towel inside the gray container to the right of the toilet on the floor."
                    ],
                    "task_desc":"Place a towel in a container.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "GarbageCan"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-GarbageCan-416/trial_T20190908_234733_986177/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A14IPKOBOPID9H_320DUZ38GAD1H2QHKNUDNAJ3EL2JG7",
                    "high_descs":[
                        "Go forward to the towel bar, then turn right then left to go around the shower, then turn right and head to the garbage bin under the round towel holder",
                        "Take the towel from the round towel holder",
                        "Back up a few steps then turn around, then go right and then right again and face the toilet",
                        "Put the towel in the garbage bin to the right of the toilet"
                    ],
                    "task_desc":"Move a towel from a towel holder to a garbage bin",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3QILPRALQ8MI7DBKGNAHO4JMZLS8NG",
                    "high_descs":[
                        "Walk forward past the wall in front of you to the door on the left, then turn right and walk to the hand towel on the wall near the toilet.",
                        "Pick up the hand towel from the holder on the wall.",
                        "Move away slightly backwards from the wall and stand near the garbage can on the floor.",
                        "Put the towel in the garbage can."
                    ],
                    "task_desc":"Throw away a hand towel.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3X3OR7WPZ2RSJD8Z4AU2BCFXUQR8LD",
                    "high_descs":[
                        "Turn to the right, and then left. Move ahead just a few steps and turn right to face the toilet. Look up to towel on the wall.",
                        "Take off the towel having on the wall.",
                        "Carry the towel and turn around, then turn around again to face the front of the toilet.",
                        "Place the towel in the trash can on the right side."
                    ],
                    "task_desc":"Remove a hanging towel and throw it away.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-GarbageCan-416/trial_T20190908_234752_613977/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_32UTUBMZ7JNEHGI0LQGIPN30TV9BVV",
                    "high_descs":[
                        "turn right to face the towel rack",
                        "take the towel off the towel rack",
                        "turn around, take two steps, turn right, turn right to face toilet",
                        "put the towel in the trash can"
                    ],
                    "task_desc":"move towel from towel rack to trash can",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3ATTHHXXWDFG8D11RF9HZV4Y4WVXIN",
                    "high_descs":[
                        "Turn right and walk to the towel hanger.",
                        "Take the towel from the hanger.",
                        "Turn around and walk to the front of the toilet.",
                        "Throw the towel in the trash can to the right of the toilet."
                    ],
                    "task_desc":"Put a towel in the trash can next to the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3LUY3GC632REAKIEMXV3ETSMOHL7PO",
                    "high_descs":[
                        "Walk forward, then turn right and walk over to the wall.",
                        "Take the wash cloth off of the metal right on the wall in front of you.",
                        "Turn around and walk forward, then turn right and walk towards the wall, turn right again to face the toilet and look down.",
                        "Put the wash cloth in the small silver bin on the ground to the right of the toilet."
                    ],
                    "task_desc":"Move a wash cloth into a small silver bin.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-SoapBar-None-GarbageCan-416/trial_T20190908_020839_714699/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_38YMOXR4MXGD54FCJ1FPZNGKSG9W67",
                    "high_descs":[
                        "Turn around, go forward, then turn right to face the toilet.",
                        "Pick up the bar of soap on the back of the toilet.",
                        "Look downward, to the trash bin.",
                        "Put the bar of soap in the trash bin."
                    ],
                    "task_desc":"Put a bar of soap in the trash.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3SUWZRL0M1UJO4TLY1LJDH9KLC66E3",
                    "high_descs":[
                        "Turn around and walk slightly forward to the toilet.",
                        "Pick up the bar of soap on the top of the toilet between the two spray bottles.",
                        "Bend down toward the garbage can to the right of the toilet.",
                        "Put the bar of soap in the garbage can."
                    ],
                    "task_desc":"Put a bar of soap in a garbage can.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3VZLGYJEYORUIE4DVB8MY4NM6MHXZX",
                    "high_descs":[
                        "Turn left to face the toilet.",
                        "Pick up the bar of soap on the toilet tank.",
                        "Look down at the trash can.",
                        "Throw away the soap in the trash can."
                    ],
                    "task_desc":"Throw away the soap on the toilet tank.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_and_place_simple-SoapBar-None-GarbageCan-416/trial_T20190908_020828_777495/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_39KFRKBFIQC7JFGGYYJ71KNROPYYOU",
                    "high_descs":[
                        "Turn to your left to face the left bathroom sink. ",
                        "Pick up the bar of soap that is on the back of the counter. ",
                        "Turn left and walk over to the toilet area. ",
                        "Place the bar of soap in the trash bin that is to the right of the toilet. "
                    ],
                    "task_desc":"Move a bar of soap to the trash bin. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3ERET4BTVPQ9SNNTSUZYVMDRVB5K99",
                    "high_descs":[
                        "Walk two steps ahead and turn left to face the sinks.",
                        "Pick up the soap on the counter in the middle of the sinks.",
                        "Turn left and walk to the front of the toilet.",
                        "Place the soap in the bin to the right of the toilet."
                    ],
                    "task_desc":"Place a bar of soap in a garbage bin.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3OE22WJIGL5TNI9R3AEMN4CE727UQ2",
                    "high_descs":[
                        "Move straight then turn left facing the soap on the counter top between the two sinks",
                        "Pick up the bar of soap on the counter",
                        "Carry the bar of soap to the left where the trash can is to the right of the toilet",
                        "Place the soap in the trash can"
                    ],
                    "task_desc":"Move a bar of soap to the trash",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_and_place_simple-SoapBar-None-GarbageCan-416/trial_T20190908_020805_738262/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A98E8M4QLI9RS_35LDD5557DLOZ76NH33308JBV9HKMB",
                    "high_descs":[
                        "turn left and move forward across the bathroom and turn left again to face the toilet",
                        "pick up a pink bar of soap off of the back of the toilet",
                        "move back away from the toilet slightly",
                        "put the pink bar of soap in to the gray trash can that is to the right of the toilet"
                    ],
                    "task_desc":"put a bar of soap into the trash can",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ACSS93E03ZUGX_3GDTJDAPVXS4464M8E60A3AK09R8MK",
                    "high_descs":[
                        "Go to the right, then straight, then right again to face the window above the toilet.",
                        "Pick up the soap from the top of the toilet.",
                        "Look down towards the toilet tank.",
                        "Throw the soap in the garbage can to the right of the toilet."
                    ],
                    "task_desc":"Throw away the soap that is on top of the toilet.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3WEV0KO0OP9JJWDI9JD284NR3PLSD1",
                    "high_descs":[
                        "Turn right, move to the toilet, face the toilet. ",
                        "Pick up the soap on the toilet.",
                        "Take the soap to the trash.",
                        "Put the soap in the trash. "
                    ],
                    "task_desc":"Put a soap in the trash. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "ToiletPaper",
                "SoapBar"
            ]
        },
        "tests_seen/trial_T20190906_202203_193951/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and go to the toilet.",
                        "Pick up the empty roll between the candles on the top of the toilet.",
                        "Bend down towards the trash can on the floor.",
                        "Put the empty roll in the trash can."
                    ],
                    "task_desc":"Put an empty roll of toilet paper into the trash can."
                },
                {
                    "high_descs":[
                        "Turn around and face the toilet.",
                        "Take the empty toilet paper roll off the back of the toilet.",
                        "Go to the trash can on your right.",
                        "Throw the empty roll into the trash can."
                    ],
                    "task_desc":"Put the empty toilet paper roll in the trash can."
                },
                {
                    "high_descs":[
                        "Go to the toilet behind you.",
                        "Take the cylinder from the back of the toilet.",
                        "Go to the trash bin next to the toilet.",
                        "Place the cylinder in the trash bin."
                    ],
                    "task_desc":"Throw away an empty toilet paper roll."
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        }
    }
}