{
    "scene_name":"FloorPlan215",
    "trials":{
        "tests_unseen/trial_T20190906_190812_248659/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and walk to the shelves along the wall.",
                        "Pick up the gray container on the right of the shelf.",
                        "Turn right and walk to the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a container by the light of a lamp."
                },
                {
                    "high_descs":[
                        "turn left and walk to the far end of the room with the black cabinet",
                        "grab a bowl off of the of the shelf of the cabinet",
                        "turn right and walk over to the oval shaped table against the wall",
                        "turn on the lamp on the table"
                    ],
                    "task_desc":"turn on a lamp while holding a bowl"
                },
                {
                    "high_descs":[
                        "Turn left and walk until you're past the oval coffee table and then turn left and take a step and then turn right and walk to the shelves so you are on the right side of them facing them.",
                        "Pick up the bowl that's all the way to the right of the second shelf from the floor.",
                        "Turn around and take a step then turn left and walk to the lamp that's in front of you.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Inspect a bowl by lamp light."
                }
            ],
            "relative_objects":[
                "Bowl",
                "Vase"
            ]
        },
        "tests_unseen/trial_T20190906_212011_892959/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right, walk towards TV",
                        "Pick up watch near the TV",
                        "Turn right and walk towards the desk.",
                        "Go towards the desk.",
                        "Place the watch into the blue bowl",
                        "Pick blue bowl up, walk towards table. ",
                        "Place bowl with watch onto table"
                    ],
                    "task_desc":"Grab the watch, put it into blue bowl, place onto table."
                },
                {
                    "high_descs":[
                        "Turn right and face the TV on the table.",
                        "Grab the watch from the table.",
                        "Turn around and head to the shelves on the right.",
                        "Place the watch in the grey container on the middle shelf.",
                        "Grab the container that has the watch in it.",
                        "Turn around and head to the table in the middle of the room.",
                        "Place the container on the table."
                    ],
                    "task_desc":"Place the container with the watch in it onto the table."
                },
                {
                    "high_descs":[
                        "Turn right and walk to the TV.",
                        "Pick up the watch on the left side of the TV stand.",
                        "Turn around and go the shelf on your right.",
                        "Put the watch in the grey bowl on the second shelf.",
                        "Pick up the grey bowl with the watch in it.",
                        "Turn around and walk to the coffee table.",
                        "Put the bowl with the watch in it on the table."
                    ],
                    "task_desc":"Put a bowl with a watch in it on the coffee table."
                }
            ],
            "relative_objects":[
                "Bowl",
                "Watch"
            ]
        },
        "tests_unseen/trial_T20190912_213111_315672/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "walk to face side table",
                        "pick up red credit card from table",
                        "walk to left side of side table",
                        "put credit card in blue bowl on table",
                        "pick up bowl from table",
                        "walk to face coffee table",
                        "put bowl on table"
                    ],
                    "task_desc":"put bowl and credit card on coffee table"
                },
                {
                    "high_descs":[
                        "turn right, go forward to mirror, turn around, go to brown table with lamp",
                        "pick up red credit card from behind lamp on brown table",
                        "go around brown table to blue bowl on brown table",
                        "place red credit card in blue bowl next to lamp",
                        "pick up blue bowl with credit card",
                        "turn around, go to side of coffee table with keys ",
                        "place blue bowl with credit card on coffee table in between keys and red credit card"
                    ],
                    "task_desc":"place blue bowl with red credit card on coffee table"
                },
                {
                    "high_descs":[
                        "move right to the lamp stand",
                        "pick up a card",
                        "head left on the lamp stand",
                        "drop the card on a plate",
                        "pick up the plate",
                        "turn around to the center table",
                        "drop the plate on the center table"
                    ],
                    "task_desc":"drop a plate with a card on it on the center table"
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "tests_unseen/trial_T20190907_211732_655276/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn and go to the shelves.",
                        "Pick up the hand on the shelves. ",
                        "Turn and go to the TV table in the corner. ",
                        "Put the hand on the TV table. "
                    ],
                    "task_desc":"Move the hand on the shelves to the TV table. "
                },
                {
                    "high_descs":[
                        "Move to the shelf to the right of you",
                        "Pick up a golden hand from the shelf",
                        "Move to the TV stand to the right of you",
                        "Place the hand on the stand"
                    ],
                    "task_desc":"Put a golden statue hand on the TV stand."
                },
                {
                    "high_descs":[
                        "Turn right to be in front of shelf.",
                        "Pick up hand from right hand side of top shelf.",
                        "Turn right move to table holding tv.",
                        "Place hand on table directly in front of tv."
                    ],
                    "task_desc":"Move hand from shelf to tv table."
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "tests_unseen/trial_T20190907_153145_812102/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "turn left, walk forward, stop in front of shelves, turn to the right to face shelves",
                        "pick up keys that are on the shelf",
                        "turn left, walk forward, turn left, walk forward behind chair, turn right, go towards door, turn to face lamp on the right",
                        "turn lamp on, hold keys up to lamp to examine them"
                    ],
                    "task_desc":"get keys to take to lamp to examine them in the light"
                },
                {
                    "high_descs":[
                        "Go left and stand in front of the black shelves.",
                        "Pick the keys up from the shelf.",
                        "Go left and then left again to face the floor lamp.",
                        "Turn the light on."
                    ],
                    "task_desc":"Turn a light on with keys."
                },
                {
                    "high_descs":[
                        "Turn left towards the shelves on your right.",
                        "Pick up the keys on the second shelf.",
                        "Turn left and head towards the lamp next to the grey bin.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a set of keys next to the light of a tall lamp."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_unseen/trial_T20190912_212950_324294/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Take a left at the striped chair and walk to the rack of wooden shelves ahead on the right.",
                        "Pick up the red credit card from the second shelf of the rack.",
                        "Turn around and walk to the wooden round table next to the couch on the left.",
                        "Put the red credit card inside the gray bowl on the table.",
                        "Pick up the bowl with the credit card inside from the table.",
                        "Turn around and walk to the wooden round table on the right.",
                        "Put the bowl with the credit card inside next to the laptop computer on the table."
                    ],
                    "task_desc":"Place a bowl with a credit card on a table."
                },
                {
                    "high_descs":[
                        "Walk across the room to the black shelf against the wall.",
                        "Pick up the credit card from the shelf.",
                        "Turn right and make another right to walk to the far side table to the right of the couch.",
                        "Put the credit card in the blue dish.",
                        "Pick up the blue dish with the credit card in it.",
                        "Turn around to walk to the coffee table.",
                        "Set blue dish and credit card down on the coffee table."
                    ],
                    "task_desc":"Put a credit card in a blue dish to move it to the coffee table."
                },
                {
                    "high_descs":[
                        "Walk up to the chair in front of you then hang a left and walk across the room, hang a right and walk over to the black shelving unit against the wall on your left.",
                        "Pick up the red credit card off of the shelving unit.",
                        "Turn right and walk forward, then hang a right and walk over to the small table to the right of the couch.",
                        "Put the red credit card in the blue bowl that's on the table.",
                        "Pick up the blue bowl with the red credit card in it.",
                        "Turn around and walk forward, then walk over to the far side of the coffee table.",
                        "Put the bowl with the credit card in it in front of the laptop on the coffee table."
                    ],
                    "task_desc":"Put a bowl with a credit card in it on the coffee table."
                }
            ],
            "relative_objects":[
                "Bowl",
                "CreditCard"
            ]
        },
        "tests_unseen/trial_T20190908_130238_618424/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to your left and go across the room to the TV on a table, in the right corner of the room. ",
                        "Pick up the newspaper behind the remote, on the table the TV is on. ",
                        "Turn to your left and go to the black shelf, against the wall, on your right. ",
                        "Place the newspaper on the top shelf, between the plant and the statue o a hand. "
                    ],
                    "task_desc":"Put the newspaper on the shelf. "
                },
                {
                    "high_descs":[
                        "Turn around and take one step, then turn right and walk across the room, then turn right to face the table. ",
                        "Pick up the newspaper that is near the remote on the table.",
                        "Turn around and take three steps, then turn to the right. ",
                        "Put the newspaper on the top shelf to the left of the plant. "
                    ],
                    "task_desc":"Move the newspaper to the shelf."
                },
                {
                    "high_descs":[
                        "Turn around, go forward, hang a right and go to the table where the TV is. ",
                        "Pick up the newspaper that is under the remote control on the table. ",
                        "Turn around, go forward to the black shelves on the right where the plant is. ",
                        "Put the newspaper on the top shelf to the left of the plant. "
                    ],
                    "task_desc":"Put a newspaper on a shelf. "
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Shelf"
            ]
        },
        "tests_unseen/trial_T20190909_005828_654142/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to the right and then walk forward and turn to the box on your left. ",
                        "Pick up the box from the ground. ",
                        "Turn around to the left and walk forward. Turn left then right to face the couch. ",
                        "Set the box on the couch.",
                        "Turn around completely and walk around the left side of the coffee table. Head straight forward to the black shelves",
                        "Pick up the remote from the black shelves. ",
                        "Turn around completely and head back to the couch. ",
                        "Put the remote inside the box on the couch."
                    ],
                    "task_desc":"Place a box and a remote on the couch. "
                },
                {
                    "high_descs":[
                        "Turn around and walk over to the cardboard box on the ground to your left.",
                        "Pick up the cardboard box off of the ground.",
                        "Turn around and walk over to the right side of the tan couch.",
                        "Put the cardboard box on the seat of the couch.",
                        "Turn left and walk towards the wall, then hang a left and walk to the shelving unit against the wall.",
                        "Pick up the remote off of the top of the shelving unit.",
                        "Turn left and begin walking across the room, then hang a left and walk over to the cardboard box on the couch.",
                        "Put the remote into the cardboard box on the couch and close the box."
                    ],
                    "task_desc":"Close a cardboard box with a remote in it on the seat of a couch."
                },
                {
                    "high_descs":[
                        "Turn around and walk across the room and turn left to face the empty box on the floor.",
                        "Pick up the empty box on the floor.",
                        "Turn around and walk across the room to face the center of the couch.",
                        "Place the empty box on the middle of the couch.",
                        "Turn around and walk around the table to face the shelves on the wall.",
                        "Pick up the remote on the top of the shelves.",
                        "Turn around and walk across the room to face the empty box on the couch.",
                        "Place the remote in the empty box on the couch."
                    ],
                    "task_desc":"To place a remote in a box on the center of the couch."
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box"
            ]
        },
        "tests_unseen/trial_T20190909_005920_856931/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and walk between the sofa and the coffee table, hang a left to the cardboard box on the floor to the left of the TV.",
                        "Pick up the box from the floor.",
                        "Turn around to stand in front of the sofa.",
                        "Place the box on the middle section of the cushion of the sofa.",
                        "Turn to your left and walk to the black shelf to the right of the TV.",
                        "Pick up the remote control from the bottom shelf.",
                        "Turn around to stand in front of the box on the sofa.",
                        "Place the remote control in the box and close the box."
                    ],
                    "task_desc":"Put a remote control in a cardboard box"
                },
                {
                    "high_descs":[
                        "turn around and move across the room to the shelf and turn left to move towards a cardboard box that is to the right of another shelf",
                        "pick up the cardboard box from the floor",
                        "turn around and move forward towards the round end table with the lamp, turn to the right and move to the center of the sofa on the left and turn left to face the sofa",
                        "put the box on to the sofa",
                        "turn to the left and move forward passed the sofa to the shelf",
                        "pick up the remote from the bottom shelf",
                        "turn around and move forward back to the sofa on the left to where the box is sitting, turn to the left to face the sofa",
                        "put the remote in to the box that is sitting on the sofa and close the lid"
                    ],
                    "task_desc":"put a closed box with a remote in it on to the sofa"
                },
                {
                    "high_descs":[
                        "Turn to your right move to the the mirror move right and  walk down beside the couch and stop when you are between the TV stand and the shelf.",
                        "Pick up the box of of the floor below you.",
                        "Turn around and move to the center of the couch. ",
                        "Place the box on the couch.",
                        "Move across the room back to the shelf.",
                        "Pick up the remote control in between the other object's on the bottom shelf.",
                        "Turn around and move to the center of the couch.",
                        "Place the remote control in the box and close the top of it."
                    ],
                    "task_desc":"Put remote control in box and place on couch."
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Sofa",
                "Box"
            ]
        },
        "tests_unseen/trial_T20190907_153002_796630/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and walk to the shelves, then turn right and walk across the room.",
                        "Take the keys that are next to the watch.",
                        "Turn to the right and walk across the room, then turn right and walk to the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"To look at the keys in the light."
                },
                {
                    "high_descs":[
                        "Head straight to the end table next to the sofa.",
                        "Pick the keys up from off of the end table.",
                        "Go to the right past the door and stand in front of the lamp.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Turn the lamp on while holding the keys."
                },
                {
                    "high_descs":[
                        "Move forward to the side table where the lamp and keys are",
                        "pick up the keys that are sitting on top of the table",
                        "Carry the keys to the large floor lamp to the right of the white door",
                        "Turn on the floor lamp "
                    ],
                    "task_desc":"Turn on the floor lamp while carrying keys"
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_unseen/trial_T20190908_130300_504812/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and veer right to the far end of the couch.",
                        "Pick up the newspaper near the laptop on the couch.",
                        "Turn right and walk to the shelving unit against the wall.",
                        "Place the newspaper on the bottom shelf, near the center."
                    ],
                    "task_desc":"Place a newspaper on a shelf."
                },
                {
                    "high_descs":[
                        "Turn around and walk just past the coffee table, then turn right between the couch and the coffee table and go to the end of the couch on your left.",
                        "Pick up the newspaper to the left of the laptop on the couch. ",
                        "Turn around and go to the shelving unit across the room. ",
                        "Place the newspaper on the middle of the bottom shelf in front of you."
                    ],
                    "task_desc":"Put the newspaper on the shelf."
                },
                {
                    "high_descs":[
                        "turn around, walk forward one step, turn right, walk to the end of the couch, turn left to face couch",
                        "pick up the newspaper that is on the couch",
                        "turn right, take a step, turn right, walk past coffee table, turn right, turn left, walk to shelves",
                        "put newspaper on the bottom shelf"
                    ],
                    "task_desc":"move newspaper from couch to shelf"
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Shelf"
            ]
        },
        "tests_unseen/trial_T20190908_130212_304102/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Take a small step forward then turn left and walk to the couch then turn right and walk to the middle cushion of the couch to your left turning left to face the couch when you get there. ",
                        "Pick up the newspaper that's in front of you.",
                        "Turn left and take a step past the coffee table to your left then turn left and walk to the shelves in front of you then take a step to your left.",
                        "Put the paper on the bottom shelf just to the left of center."
                    ],
                    "task_desc":"Put the newspaper on the shelf."
                },
                {
                    "high_descs":[
                        "Turn to your left and go to the couch, then turn right, between the coffee table and the couch, and turn to your right at the center of the couch.",
                        "Pick up the newspaper between the pillow and the laptop, on the couch. ",
                        "Turn to your left and go past the coffee table, then go to the wooden shelf across the room. ",
                        "Place the newspaper on the bottom shelf. "
                    ],
                    "task_desc":"Put the newspaper on the shelf. "
                },
                {
                    "high_descs":[
                        "Go to the sofa",
                        "Pick up a newspaper from the sofa",
                        "Go to the shelves",
                        "Put the newspaper on a shelf"
                    ],
                    "task_desc":"Move a newspaper to a shelf"
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Shelf"
            ]
        },
        "tests_unseen/trial_T20190907_182015_912423/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and walk to face the table in the middle of the living room.",
                        "Pick up the keys on the table in the living room.",
                        "Turn around and face the couch.",
                        "Place the keys on the edge of the couch.",
                        "Turn to the left and walk across the room to the shelving.",
                        "Pick up the keys from the second shelf from the bottom.",
                        "Turn to the right and walk forward, then turn right and walk forward and then turn left to face the couch.",
                        "Place the keys next to the other keys on the couch."
                    ],
                    "task_desc":"To move 2 sets of keys from their original positions to the couch."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        }
    }
}