{
    "scene_name":"FloorPlan211",
    "trials":{
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-211/trial_T20190909_011838_777820/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3FE7TXL1LLESOVMNGYTXI71OIWH2QO",
                    "high_descs":[
                        "Turn right towards the key chains on the sofa.",
                        "Pick up the key chain on the left.",
                        "Turn left and walk to the tall lamp in the corner to the left of the sofa.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a key chain by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3IUZPWIU1RYSP8MZHDY7AS54NXLKWX",
                    "high_descs":[
                        "Turn right and look down to face the couch.",
                        "Pick up the keys to the left on the couch.",
                        "Take a step to the left to face the lamp.",
                        "Turn on the lamp to examine the keys."
                    ],
                    "task_desc":"To examine keys by lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3ZSANO2JCIYO25DCWXX9XQAE9O2FS5",
                    "high_descs":[
                        "Turn around to the sofa on your right.",
                        "Grab the left set of keys from the sofa.",
                        "Walk to the lamp next to the sofa.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Look at keys under a lamp's light.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-211/trial_T20190909_040147_087650/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_320DUZ38GAD1H2QHKNUDNAJ3ELFJGK",
                    "high_descs":[
                        "Turn around completely, walk up to the shelving that is up against the wall, then turn right, then left to face the shelving.  ",
                        "Pick up the set of keys that are on the top shelf. ",
                        "Turn to the right and move over to the floor lamp.",
                        "Turn on the floor lamp."
                    ],
                    "task_desc":"Examine a set of keys using the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3GNCZX450LEWTMGCT07NOKUCPP7APY",
                    "high_descs":[
                        "Turn right and take a step then turn right and walk to the shelves then take a step to your right.",
                        "Pick up the keys that are in front of you.",
                        "Turn right and walk to the light that's in the corner please.",
                        "Turn on the light."
                    ],
                    "task_desc":"Inspect keys in lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3L4PIM1GQW7I1HUUMYPSW1CYTY2RYL",
                    "high_descs":[
                        "Turn around and cross the room the brown stand with shelves ",
                        "Pick up the keys that are on the top shelf",
                        "Turn to the right and walk to the tall floor lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Look at keys under a tall lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Newspaper-None-Sofa-211/trial_T20190906_174949_956681/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3DI28L7YXDVOHISOSV92ILI3D2AE1Z",
                    "high_descs":[
                        "Turn to your left and walk over to the left side of the entertainment center. ",
                        "Pick up the newspaper that is on the entertainment center.",
                        "Turn around and walk over to the couch where the laptop is sitting.",
                        "Place the newspaper on the couch between the white pillow and the laptop."
                    ],
                    "task_desc":"Move the newspaper to the couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3UJ1CZ6IZK6OFJYPUDVJASZZQ9VS53",
                    "high_descs":[
                        "take step forward and turn to the left and go to the end of the floor rug and turn left and go to the end of the coffee table and turn right and go to the TV stand",
                        "pick up the newspaper from the TV stand",
                        "turn to the left and take a few steps forward and turn to the left go to the sofa and turn to the left and take a few steps and turn to the right facing the sofa",
                        "Place the newspaper under the pillow in front of the notebook computer on the sofa"
                    ],
                    "task_desc":"Place a newspaper under a pillow on the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3XCC1ODXDOS17QHAZGJHITPU03VRQN",
                    "high_descs":[
                        "Move to the glass TV stand on the far left side where the newspaper is",
                        "Pick up the newspaper on the TV stand",
                        "Carry the newspaper to the far left side of the striped sofa",
                        "Place the newspaper on top of the sofa between the laptop and the white pillow"
                    ],
                    "task_desc":"Move a newspaper to the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_37FMASSAYF81ALC2QBSI9CT3OWABIZ",
                    "high_descs":[
                        "Turn around and walk to the TV stand on the right.",
                        "Pick up the newspaper on the left side of the TV.",
                        "Turn left and walk around the coffee table to the far side of the couch.",
                        "Place the newspaper between the front of the laptop and the white cushion."
                    ],
                    "task_desc":"Place a newspaper on a couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3IXQG4FA2WF8ZKJZMHM5WJU056LB9E",
                    "high_descs":[
                        "Turn around and walk to the left corner of the entertainment center.",
                        "Take the newspaper from the edge of the entertainment center.",
                        "Turn around and walk to the couch on the other side of the room.",
                        "Put the newspaper on the couch, between the pillow and laptop."
                    ],
                    "task_desc":"Move the newspaper from the entertainment center to the couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3LUY3GC632H6PVWGQP6MD78JRLQP7H",
                    "high_descs":[
                        "Turn left and walk to the tv towards the left side of the stand and face the tv.",
                        "Pick up the newspaper on the stand to the left of the tv.",
                        "Turn left and then make your way to the couch so you are standing facing it towards the left side of it.",
                        "Place the newspaper under the white pillow to the left of the laptop."
                    ],
                    "task_desc":"Move the newspaper in the living room to the couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/pick_and_place_simple-Newspaper-None-Sofa-211/trial_T20190906_175021_859979/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3KKG4CDWKLFOELYQ72CIO5OVYPD946",
                    "high_descs":[
                        "Walk forward to the coffee table, walk between the coffee table and the couch, then turn left to face the coffee table. ",
                        "Pick up the newspaper that is on the coffee table.",
                        "Turn around completely to face the couch behind you. ",
                        "Place the newspaper behind the remote control that is on the right. "
                    ],
                    "task_desc":"Move a newspaper from the coffee table to the sofa. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3NKQQ8O391MZY95MYO82N55FONFDUD",
                    "high_descs":[
                        "Proceed to coffee table, turn right, proceed to couch, turn left to go to coffee table.  Face coffee table.",
                        "Pick up newspaper from left hand side of coffee table.",
                        "Turn around to face couch.",
                        "Place newspaper on its side onto couch, diagonally, touching the remote closest to the pillow."
                    ],
                    "task_desc":"Move a newspaper from a table to a couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3O7L7BFSHH6ZHOOM02U8AKZPU4TEIZ",
                    "high_descs":[
                        "Move to the side of the coffee table closest to the couch facing the newspaper",
                        "Pick up the newspaper on top of the coffee table",
                        "Carry the newspaper and turn around facing the left side of the striped couch",
                        "Place the newspaper behind the remote control on the edge of the couch"
                    ],
                    "task_desc":"Move a newspaper to the couch",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3HYA4D452U0NCHAG6ATM5MD7EZL2FF",
                    "high_descs":[
                        "Head towards the couch and face the table. ",
                        "Pick up the newspaper from the table.",
                        "Turn around and face the couch.",
                        "Set the newspaper down on the couch"
                    ],
                    "task_desc":"Put the newspaper on the couch. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3PM8NZGV81XL4M3M8FP97BBHYAQQX3",
                    "high_descs":[
                        "Walk towards the couch on the left, sit on the white pillow to face the tv.",
                        "Pick up the newspaper from the table.",
                        "Stand up and turn around.",
                        "Place the newspaper towards the top of the closest remote."
                    ],
                    "task_desc":"Place the newspaper next to the remote on the sofa.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3VFJCI1K42GAU1NWWKE5OFLRR50GR4",
                    "high_descs":[
                        "Walk around the table to the right side of it and face the table.",
                        "Pick up the newspaper.",
                        "Turn around and face the couch.",
                        "Put the newspaper on the couch near the two remote controls."
                    ],
                    "task_desc":"Put a newspaper on the couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Newspaper",
                "Sofa"
            ]
        },
        "train/pick_and_place_simple-Newspaper-None-Sofa-211/trial_T20190906_175004_203092/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3O6CYIULEGIY7F5DFJDSFTU0V3MUW4",
                    "high_descs":[
                        "Walk forward and turn right into the other room, walk forward toward the armchair with the newspaper on it, then turn right and go to the TV.",
                        "Pick up the newspaper which is on the TV stand, behind the remote.",
                        "Turn around and walk across the room to the green sofa.",
                        "Put the newspaper on the sofa, in front of the laptop."
                    ],
                    "task_desc":"Move a newspaper from a TV stand to a sofa.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3ZAZR5XV04Z6FGTI4FCZKR2C56NCZ8",
                    "high_descs":[
                        "Move to the left side of the TV stand to the right of the green bin",
                        "Pick up the newspaper on top of the TV stand on the far left side",
                        "Carry the newspaper to the large sofa in the corner of the room",
                        "Place the newspaper on top of the left side of the sofa in front of the laptop"
                    ],
                    "task_desc":"Carry a newspaper to the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_32N49TQG3JZ1DHRAJ4R5TQZREK0VA8",
                    "high_descs":[
                        "Walk into the living room and over to the TV stand",
                        "Pick up the newspaper behind the remote on the TV stand",
                        "Turn around and walk over to the sofa",
                        "Set the newspaper down on the sofa in front of the laptop"
                    ],
                    "task_desc":"Put the newspaper on the sofa",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3FK0YFF9P2XL55U8UZI1PDD4ZQKVVK",
                    "high_descs":[
                        "Walk to the window in front of you, then turn right and pass through the doorway. Walk forward to the chair in the corner, turn right and walk to the coffee table. Then turn left and walk to the left corner of the entertainment center.",
                        "Pick up the newspaper from the entertainment center.",
                        "Turn around and walk to the couch.",
                        "Place the newspaper on the front of the couch next to the laptop."
                    ],
                    "task_desc":"Move the newspaper from the entertainment center to the couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3PZDLQMM0W2G95Q6F83LXGS4HL92CI",
                    "high_descs":[
                        "Turn right and then go straight. Veer right to the TV stand.",
                        "Pick up the newspaper behind the remote.",
                        "Turn around and walk to the couch.",
                        "Put the newspaper on the couch on the side of the laptop."
                    ],
                    "task_desc":"Put a newspaper on a couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/pick_and_place_with_movable_recep-RemoteControl-Box-CoffeeTable-211/trial_T20190909_002955_304595/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ABR580YP0ST7X_3F1567XTNZW3OF7M178CSU92O2N9QJ",
                    "high_descs":[
                        "Turn right, walk to table, turn right, walk to window",
                        "Pick up box off of ground",
                        "Turn around, then turn left, walk to chair, turn right, walk to table, turn right",
                        "Put box on top of table",
                        "Turn right, walk to chair, turn left, walk forward to wall",
                        "Turn left, pick up remote off of table",
                        "Turn left, walk to chair, turn right, walk to table",
                        "Put remote in box on table, close box"
                    ],
                    "task_desc":"Put box on table and put remote in box",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3I7DHKZYGQRNW3F1K1K14F0MV4ZF58",
                    "high_descs":[
                        "turn around, go to window with box and plant in front",
                        "pick up box in front of window",
                        "turn around, go to coffee table on rug",
                        "place box on center of coffee table ",
                        "go to black end table on right end of couch",
                        "pick up remote from black end table",
                        "turn around, go to coffee table on rug",
                        "place remote into box on coffee table"
                    ],
                    "task_desc":"place box on coffee table, place remote in box",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3NC5L260MRD94DLJPGG0DL0DC0KFOV",
                    "high_descs":[
                        "go to the desk in front of the window",
                        "pick up the box from the desk",
                        "take the box to the coffee table",
                        "put the box on the coffee table",
                        "go to the end table at the end of the couch",
                        "pick up the remote from the table",
                        "take the remote to the coffee table",
                        "put the remote in the box on the table then close it"
                    ],
                    "task_desc":"put the remote in a box on the coffee table and close it up.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box"
            ]
        },
        "train/look_at_obj_in_light-Laptop-None-FloorLamp-211/trial_T20190908_115814_287048/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_33SA9F9TR0LP38UPLRN4CXSZ3VQEWY",
                    "high_descs":[
                        "Turn right, go forward to the shelves, turn right, go forward to the plant, turn left, go forward to the table with the lap top.",
                        "Close the lap top and take it from the table.",
                        "Turn around, go forward, turn right before reaching the box on the left side, go forward between the coffee table and couch to the wall, turn right to face the lamp in the corner.",
                        "Turn the lamp in the corner on."
                    ],
                    "task_desc":"Inspect a lap top near a lit lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3ZOTGHDK5L2I8IQ5V0GZKKJS1LFSOI",
                    "high_descs":[
                        "Turn around and walk across the room, then turn left and walk across the room, through the doorway, to the desk across from you. ",
                        "Close and pick up the laptop that is on the desk. ",
                        "Turn around and walk through the doorway, then turn right and go past the couch, to the lamp in the right corner of the room. ",
                        "Turn on the lamp in the right corner of the living room, to the left of the couch."
                    ],
                    "task_desc":"Turn on the living room lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3P529IW9K1C1YSIMCO08L4WJHP5FLS",
                    "high_descs":[
                        "Turn right at the gray door and turn right before the brown bookshelf on your left and go straight to the table at the end of the hall.",
                        "Pick up the laptop on the table.",
                        "Turn around and go through the doorway. Turn right as you go through and go to the table in the corner.",
                        "Turn on the light on the corner table."
                    ],
                    "task_desc":"Pick up the laptop and bring it to the table and turn on a lamp.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CellPhone",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-SideTable-211/trial_T20190908_012307_913456/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3A1COHJ8NMCICS3BHHQNIY2OJP8H84",
                    "high_descs":[
                        "Move to the opposite corner of the room to the right side of the TV stand facing the phone",
                        "Pick up on phone sitting on the right side of the TV stand",
                        "Carry the phone to the coffee table on the side by the statues",
                        "Place the phone on the blue plate on top of the coffee table by the statues",
                        "Pick up the plate with the phone on top of it",
                        "Carry the plate with the phone on it to the black side table next to the couch",
                        "Place the plate with the phone on it on top of the left side of the black side table"
                    ],
                    "task_desc":"Move a plate with a plate on it to the black end table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3RANCT1ZVIY6JC72KSHWSFHFL3GUB2",
                    "high_descs":[
                        "Take two steps forward, then turn right and walk to the end of the couch, then turn left and walk across the room, then turn right to face the table. ",
                        "Pick up the cell phone that is underneath the television on the table. ",
                        "Turn left and walk across the room, then turn right and walk to the end of the coffee table, then turn right to face the table. ",
                        "Place the cell phone on the blue plate that is on the table. ",
                        "Pick up the blue plate with the cell phone on it. ",
                        "Turn left and walk across the room, then turn left again and take three steps, then turn to the left to face the black table. ",
                        "Place the plate with the cell phone on it on the table. "
                    ],
                    "task_desc":"To put the plate and cell phone on the table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3Z7VU45IP1YMSDJKOINF3VJL18I1ZR",
                    "high_descs":[
                        "Turn to the right and go past the couch. Then turn left to face the slim side of the TV.",
                        "Pick up the cell phone from under the TV.",
                        "Take the cell phone and turn left, then right past the couch and turn right to face the coffee table.",
                        "Place the cell phone on the plate on the left side of the table.",
                        "Pick up the plate from the table.",
                        "Carry the plate and turn around to see the black end table beside the couch.",
                        "Place the plate and cell phone on the end table."
                    ],
                    "task_desc":"Move a cell phone and plate to a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Plate-SideTable-211/trial_T20190908_012205_528141/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_3C8HJ7UOPABJO259H46DNN7OZKAMZJ",
                    "high_descs":[
                        "Turn left walk to the far wall. Then turn left and walk to the desk. Make another left to face the desk.",
                        "Pick up the cell phone from the desk. ",
                        "Turn right and go forward, Make another right and go forward. At the center of the other room make a right and go to the table.",
                        "Put the phone on the plate.",
                        "Pick up the plate and phone off of the table.",
                        "Turn to the left go forward. Then turn around to the left again.",
                        "Put the plate and phone on the side table."
                    ],
                    "task_desc":"Move a plate with a phone on it to a side table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3JZQSN0I3TRDRBIN5PEB7Q79RT6GFJ",
                    "high_descs":[
                        "move to the table in the next room",
                        "pick up a phone from the table",
                        "move to the coffee table in front of the couch",
                        "put the phone a plate on the table",
                        "pick up the plate from the table",
                        "move to the end table to the right of the couch",
                        "put the plate on the table"
                    ],
                    "task_desc":"Put a bowl with a phone inside on a end table.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Plate"
            ]
        },
        "train/pick_two_obj_and_place-Newspaper-None-CoffeeTable-211/trial_T20190907_155539_093189/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CY7IOJ9YH136_3MAOD8E57TR01PQUSNXS3HGDW2SXNN",
                    "high_descs":[
                        "turn right, go to television stand on the right",
                        "pick up newspaper from under left side of television ",
                        "turn around and face coffee table with square blue plate",
                        "place newspaper on blue plate on coffee table",
                        "turn around, face television",
                        "pick up newspaper from in front of right side of television",
                        "turn around and face coffee table with square blue plate",
                        "place newspaper onto plate, pushing other newspaper to underneath blue plate"
                    ],
                    "task_desc":"place one newspaper on top of blue plate, place one newspaper under blue plate",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Plate"
            ]
        },
        "train/look_at_obj_in_light-Plate-None-FloorLamp-211/trial_T20190907_131058_267698/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AHBWX3WYMAB0E_3RGU30DZTDPTON05ZI3RZTJYG6LJMN",
                    "high_descs":[
                        "Move to the brown wood rack ahead on your right.",
                        "Pick up the blue plate from the rack.",
                        "Turn right and move to the lamp in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine the plate under the light of the lamp.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3QRYMNZ7F1YTK8HANDWVEEV7JXANTI",
                    "high_descs":[
                        "Walk towards the wooden shelves in front of you.",
                        "Pick up the blue plate from the shelves.",
                        "Turn right and head towards the tall lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine the blue plate next to the light of the tall lamp.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3CFJTT4SXW7E899CDUG24A7880LI7F",
                    "high_descs":[
                        "Move forward and to the right and face the wooden shelf. ",
                        "Pick up the blue tray on the wooden shelf. ",
                        "Bring the blue tray to the tall lamp on the floor in the corner to the right. ",
                        "Turn on the lamp on the floor. "
                    ],
                    "task_desc":"Examine the blue tray in the light of the tall lamp. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_30BXRYBRP7ET2TZTFK6TWE5A1K7HWR",
                    "high_descs":[
                        "walk towards door, turn right, turn left to face shelves,",
                        "pick up blue plate from shelf",
                        "turn right, walk towards floor lamp",
                        "turn lamp on, hold plate up to lamp"
                    ],
                    "task_desc":"examine blue plate with the lamp",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Vase"
            ]
        },
        "tests_seen/trial_T20190907_155502_604907/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and move to the TV stand across the room next to the recycling bin.",
                        "Pick up the newspaper on the TV stand.",
                        "Turn around and go to the coffee table in the living room.",
                        "Place the newspaper on the coffee table.",
                        "Turn around and go to the black chair in the corner of the room.",
                        "Pick up the newspaper on the chair.",
                        "Turn to your right and go to the coffee table in the living room.",
                        "place the newspaper on the coffee table to the left of the other newspaper."
                    ],
                    "task_desc":"Take the newspapers on the chair and the TV stand to the coffee table."
                },
                {
                    "high_descs":[
                        "Turn left, go forward, turn left, go forward, turn right, go forward, then turn left to go to the TV.",
                        "Pick up the newspaper, located on the shelf under the TV.",
                        "Turn around and go to the coffee table behind you.",
                        "Put the newspaper on the coffee table, between the plate and the box.",
                        "Turn right, move forward, then turn right to face the chair.",
                        "Pick up the newspaper on the chair.",
                        "Turn right, go forward, then turn right to face the coffee table.",
                        "Put the newspaper on the coffee table, to the left of the other newspaper."
                    ],
                    "task_desc":"Move to newspapers to the coffee table."
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "tests_seen/trial_T20190908_012244_364797/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and take  a step then turn left and walk until you're even with the small coffee table on your left then when you get there turn left.",
                        "Pick up the phone that's in front of you.",
                        "Turn right and take a step then turn left and take a step then turn left.",
                        "Put the phone in the blue bowl.",
                        "Pick up the blue bowl.",
                        "Take a step left then walk to the wall and turn left when you get to it and walk one step then turn left.",
                        "Put the bowl with the phone it it on the black end table to the left of the blue thing."
                    ],
                    "task_desc":"Put a bowl with a phone it it on the table."
                },
                {
                    "high_descs":[
                        "Turn left and go a few steps before turning left again and moving between a small table and a couch and turning left again towards the table",
                        "Pick up the white cell phone from the table",
                        "Go around the table to the left where there is a blue tray on the table",
                        "Place the cell phone in the blue tray",
                        "Pick up the blue tray with the phone inside",
                        "Turn around towards the couch then turn right passing between the couch and the table from which the phone and tray were picked up from before turning left towards an end table beside the couch",
                        "Place the tray with the phone on the end table beside the couch"
                    ],
                    "task_desc":"Moving a cell phone into a tray and placing it on a side table beside a couch"
                },
                {
                    "high_descs":[
                        "Turn around and face the coffee table so that you are between it and the sofa.",
                        "Pick up the white phone on the edge of the table.",
                        "Move to the right and then face the smaller end of the coffee table.",
                        "Put the phone down on the blue plate.",
                        "Pick up the plate from the edge of the table.",
                        "Bringing the plate with you, go between the couch and the coffee table and then face the black end table with the blue vase.",
                        "Put the plate down to the left of the blue vase."
                    ],
                    "task_desc":"Put a blue plate with a phone on it down on the end table."
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Plate"
            ]
        },
        "tests_seen/trial_T20190907_155441_973789/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "turn left, go to left side of television stand",
                        "pick up newspaper from under left side of television",
                        "turn around, face coffee table with rug underneath",
                        "place newspaper touching right side of square blue place toward front of coffee table",
                        "turn around, go to right end of television stand",
                        "pick up newspaper from television stand",
                        "go to coffee table to the left",
                        "place newspaper on top of blue plate with newspaper touching it"
                    ],
                    "task_desc":"Place newspaper next to blue plate, place newspaper on top of blue plate"
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Plate"
            ]
        }
    }
}