{
    "scene_name":"FloorPlan226",
    "trials":{
        "tests_unseen/trial_T20190908_071233_937560/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Head straight to the end table",
                        "Grab the cardboard box at the bottom of the table",
                        "Turn around and go to the sofa that has keys on it",
                        "Put the box on the sofa",
                        "Move slightly to the left",
                        "Grab the keys off of the sofa",
                        "Move slightly to the right",
                        "Put the keys in the box on the sofa"
                    ],
                    "task_desc":"Moving keys into a cardboard box on a sofa"
                },
                {
                    "high_descs":[
                        "Go to the end table in front across the room.",
                        "Pick up the empty box under the table.",
                        "Turn around and go to the right front side of the sofa with a checkered cushion.",
                        "Place the empty box on the sofa seat.",
                        "Move over left and face the sofa.",
                        "Pick up the keys on the sofa seat next to the box.",
                        "Move over right to the front of the box.",
                        "Place the keys in the box and close the box."
                    ],
                    "task_desc":"Put the keys in with the box on the sofa."
                },
                {
                    "high_descs":[
                        "turn to the left and take a step and turn to the right and go to the table",
                        "pick up the box from underneath the table",
                        "turn to the right twice and take a few steps and turn to the left and go to the sofa and turn to the right and take a few steps and turn left facing the sofa",
                        "put the box on top of the sofa",
                        "turn to the left and take a step and turn to the right facing the sofa",
                        "pick up a set of keys from the sofa",
                        "turn to the right and take a step and turn to the left facing the box on the sofa",
                        "put the set of keys in the box"
                    ],
                    "task_desc":"Place a box and a set of keys in the box on the sofa"
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "tests_unseen/trial_T20190909_105447_359066/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk left to the right side of the chair.",
                        "Pick up the keys on the chair.",
                        "Turn left and walk all the way to the last cushion of the couch, facing it.",
                        "Place the keys on the right cushion, near the front left corner."
                    ],
                    "task_desc":"Place a set of keys on a couch."
                },
                {
                    "high_descs":[
                        "walk to face plush chair",
                        "pick up keys from chair",
                        "walk to face couch",
                        "put keys on couch"
                    ],
                    "task_desc":"put keys on couch"
                },
                {
                    "high_descs":[
                        "Turn left and go to the right of the couch",
                        "Grab the keys off of the couch",
                        "Turn left and go to the sofa",
                        "Put the keys on the sofa"
                    ],
                    "task_desc":"Putting keys on a sofa"
                }
            ],
            "relative_objects":[
                "Pillow",
                "KeyChain"
            ]
        },
        "tests_unseen/trial_T20190908_125252_951776/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "head left to the coffee table",
                        "take the watch from the coffee table",
                        "head left across the room",
                        "put the watch on the desk"
                    ],
                    "task_desc":"take the watch from the coffee table, put it on the desk"
                },
                {
                    "high_descs":[
                        "Walk to the coffee table in front of you.",
                        "Grab a watch from the table.",
                        "Walk to the drawer next to the sofa.",
                        "Place the watch in the drawer."
                    ],
                    "task_desc":"Move a watch from the table to the drawer."
                },
                {
                    "high_descs":[
                        "Turn to the left and face the coffee table on the right.",
                        "Pick up the watch from the center of the right side of the coffee table.",
                        "Carry the watch and turn to the left to find the small brown table.",
                        "Place the watch on the table, toward the front."
                    ],
                    "task_desc":"Move a watch to the table."
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "tests_unseen/trial_T20190908_125234_061434/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk towards the center table",
                        "pick up the watch from the table",
                        "walk back towards the dresser",
                        "place the watch on the dresser"
                    ],
                    "task_desc":"move watch to the dresser"
                },
                {
                    "high_descs":[
                        "Turn left and walk to the coffee table.",
                        "Pick up the wristwatch from the coffee table.",
                        "Turn left and walk to the dresser with statues on it.",
                        "Put the wristwatch down on the dresser to the right of the grey statue."
                    ],
                    "task_desc":"Move the wristwatch from the coffee table to the dresser."
                },
                {
                    "high_descs":[
                        "Turn left and walk to the wooden coffee table on the left.",
                        "Pick up the watch in front of the laptop computer on the table.",
                        "Turn left and walk to the wooden side table next to the chair.",
                        "Put the watch to the right of the gray statue on the table."
                    ],
                    "task_desc":"Place a watch on a table."
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "tests_unseen/trial_T20190907_040739_849657/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and walk to the table that is to your right and turn right to face the table",
                        "Pick up the remote control that is sitting closest to you.",
                        "Turn around and face the couch",
                        "Place the remote on the middle couch cushion to the left",
                        "Turn around to face the table",
                        "Pick up the remote control that is behind the statue",
                        "Turn around and face the couch.",
                        "Place the remote on the middle couch cushion behind the paper."
                    ],
                    "task_desc":"Place remote controls on a couch"
                },
                {
                    "high_descs":[
                        "Turn to the right, take 2 steps, turn to the right. ",
                        "Pick up the remote that is next to the laptop on the coffee table.",
                        "Turn around to face the couch. ",
                        "Set the remote on the edge of the couch cushion.",
                        "Turn to the left, take a step, turn to the left.",
                        "Pick up the remote behind the figurine. ",
                        "Turn around, take a step, turn to the right, take a step, turn to the left.",
                        "Put the remote on the couch behind the placard. "
                    ],
                    "task_desc":"Put the remotes on the couch. "
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "tests_unseen/trial_T20190907_074528_362136/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to face the brown end table on your right.",
                        "Pick up the statue in the center of the table.",
                        "Turn around and go between the couch and the coffee table, then turn to face the coffee table.",
                        "Place the statue on the coffee table in front of the plant."
                    ],
                    "task_desc":"Move the statue from the end table to the coffee table."
                },
                {
                    "high_descs":[
                        "Move to the wood desk to the left of the sofa",
                        "Grab the statue laying on the desk",
                        "Move the statue across the room facing the wooden dresser",
                        "Place the statue on the dresser in front of the plant"
                    ],
                    "task_desc":"Move a statue from the desk to the dresser"
                },
                {
                    "high_descs":[
                        "turn right, walk towards table",
                        "pick up dog statue on table behind newspaper",
                        "turn around, turn left and walk towards couch across from, turn right walk to the end of the couch and turn right",
                        "place dog statue on table in front of plant"
                    ],
                    "task_desc":"place dog statue on table in front of couch"
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "tests_unseen/trial_T20190906_201636_696952/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and walk to the wall, then turn right and walk over to the small wooden table against the wall.",
                        "Pick up the cardboard box that off of the ground that is under the small wooden table.",
                        "Turn around and begin walking across the room, then hang a left and walk over to the middle of the couch.",
                        "Place the cardboard box on the couch in between the middle and right seat cushions.",
                        "Turn left and begin walking across the room, then hang a left and walk around to the other side of the coffee table.",
                        "Pick up the credit card that is next to the watch on the coffee table.",
                        "Walk around the coffee table over to where the cardboard box is resting on the couch.",
                        "Place the credit card into the cardboard box and close the box."
                    ],
                    "task_desc":"Close a cardboard box with a credit card inside."
                },
                {
                    "high_descs":[
                        "Turn left and head towards the desk.",
                        "Pick up the box on the floor beneath the desk.",
                        "Turn around, head towards the table, turn left and head towards the sofa.",
                        "Place the box on the sofa.",
                        "Turn around and face the table.",
                        "Pick up the credit card next to the plant on the table.",
                        "Turn around and face the box on the sofa.",
                        "Place the credit card inside the box."
                    ],
                    "task_desc":"Place the box with the credit card on the sofa."
                },
                {
                    "high_descs":[
                        "Move to stand in front of the desk that's beneath the framed picture of flowers.",
                        "Pick up the box from beneath the desk. ",
                        "Turn around and carry the box to the sofa, so you're standing between the sofa and coffee table. ",
                        "Place the box on the sofa, centered between the two rightmost cushions. ",
                        "Turn and move to the other side of the coffee table, so you're facing the handles to the drawers beneath it. ",
                        "Pick up the credit card from the coffee table. ",
                        "Carry the credit card to the sofa, so you're facing the box you previously placed there. ",
                        "Place the credit card in the box and close the top of the box shut."
                    ],
                    "task_desc":"Move a credit card to a box on the sofa. "
                }
            ],
            "relative_objects":[
                "Sofa",
                "Box",
                "CreditCard"
            ]
        },
        "tests_unseen/trial_T20190907_160824_308965/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and walk past the chair to the desk in the corner.",
                        "Pick up the box from under the desk.",
                        "Turn right and walk to the sofa.",
                        "Set the box down on the sofa."
                    ],
                    "task_desc":"Move the box to the sofa."
                },
                {
                    "high_descs":[
                        "Turn around, go forward, turn right, go straight, turn right at the wall to face the desk.",
                        "Pick up the box on the floor, under the desk.",
                        "Turn around, go forward, turn left, go toward the sofa, turn right, go forward, then turn left to face the sofa",
                        "Put the box on the sofa, toward the right end and behind the keys."
                    ],
                    "task_desc":"Put a box on the sofa."
                },
                {
                    "high_descs":[
                        "Move to the brown side table to the left of the brown sofa",
                        "Pick up the empty box on the floor under the side table",
                        "Carry the box to the far right side of the sofa",
                        "Place on box on top of the sofa behind the keys"
                    ],
                    "task_desc":"Move a box to the sofa"
                }
            ],
            "relative_objects":[
                "Sofa",
                "Box"
            ]
        },
        "tests_unseen/trial_T20190908_221009_646096/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and head towards small desk in the corner",
                        "Pick up the newspaper on the right",
                        "Move to the right and face the arm chair",
                        "Place newspaper to the left of the keys",
                        "Go back to the desk",
                        "Pick up the newspaper on the left",
                        "Move to the right and face the arm chair",
                        "Place the newspaper to the right of the other newspaper"
                    ],
                    "task_desc":"Place 2 newspapers on the arm chair"
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Box",
                "Pillow"
            ]
        },
        "tests_unseen/trial_T20190909_145612_379950/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "go to the left side of the desk",
                        "pick up the closest credit card to you on the desk ",
                        "take the card to the coffee table",
                        "put the card on the table",
                        "go back to the desk",
                        "pick up the second card from the desk",
                        "take the card to the coffee table",
                        "set the second card to the left of the first card on the table"
                    ],
                    "task_desc":"put to credit cards on the coffee table"
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "tests_unseen/trial_T20190908_122249_641769/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left and walk up to the coffee table.",
                        "Pick up the set of keys off of the coffee table.",
                        "Walk over to the chair that is against the wall on your right.",
                        "Put the keys on the front edge of the seat of the chair."
                    ],
                    "task_desc":"Move a set of keys to the seat of a chair."
                },
                {
                    "high_descs":[
                        "Turn left to face the table. ",
                        "Take the keys that are on the table. ",
                        "Turn right and take one step, then turn left and take one step, then turn right and walk to the chair.",
                        "Put the keys next to the remote on the chair."
                    ],
                    "task_desc":"Move the keys to the chair."
                },
                {
                    "high_descs":[
                        "Turn around and face the table behind with the plant on it.",
                        "Pick the keys up from the table.",
                        "Go to the right and face the chair with the chair in it.",
                        "Put the keys on the chair."
                    ],
                    "task_desc":"Put keys on a chair."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_unseen/trial_T20190908_122303_851930/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right, walk to the window, make a right, walk to the end of the coffee table and turn right to face the coffee table. ",
                        "Pick up the keys that are sitting on the coffee table. ",
                        "Turn left and walk over to the brown chair. ",
                        "Sit the keys down on the seat of the brown chair."
                    ],
                    "task_desc":"Move a set of keys to a chair. "
                },
                {
                    "high_descs":[
                        "Turn right, hang a right at the wall and walk to the wooden coffee table on the right.",
                        "Pick up the keys from the left side near the edge of the table.",
                        "Turn left, hang a right around the table and walk to the brown chair on the left.",
                        "Place the keys on the middle of the cushion of the chair."
                    ],
                    "task_desc":"Place a set of keys on a chair."
                },
                {
                    "high_descs":[
                        "Go to the center table",
                        "Pick up the keys",
                        "Go to the couch",
                        "Put the keys down on the couch"
                    ],
                    "task_desc":"Move the keys to the couch"
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_unseen/trial_T20190910_181024_991905/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "cross the room to the desk in the corner beside the chair",
                        "pick up the card sitting closest to the edge of the desk",
                        "turn around and go to the coffee table",
                        "place the credit card on the coffee table",
                        "turn around to the couch behind the coffee table",
                        "pick up the credit card under the remote sitting on the couch",
                        "turn back around to the coffee table in front of the couch",
                        "set the card on the coffee table beside the other card"
                    ],
                    "task_desc":"pick up the credit cards and set them on the coffee table"
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "tests_unseen/trial_T20190908_123324_050422/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "look down and walk straight towards the wall and turn right and walk straight towards the table",
                        "pick up the statue from the table",
                        "turn around and walk straight towards the table and turn left then walk straight to the couch and turn right and then walk straight then turn right at the table",
                        "put the statue down in front of the plant on the table",
                        "turn right and walk towards the chair then turn right again towards the door and then turn right towards the couch and look up",
                        "take the white statue off of the shelf above the couch",
                        "look down and turn right then turn left in front of the couch then turn right and walk towards the table",
                        "put the statue down behind the other statue on the table"
                    ],
                    "task_desc":"Clean up statues and put them down on the table"
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "tests_unseen/trial_T20190908_213458_200008/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move forward and face the desk in front of you.",
                        "Take the watch from the desk in front of you.",
                        "Turn right then face the same desk on your left.",
                        "Open the desk drawer in front of you and place the watch inside and close the drawer.",
                        "Turn around and face the center table to your left.",
                        "Take the watch from the table in front of you.",
                        "Turn left and face the desk in front of you.",
                        "Open the desk drawer in front of you and place the watch inside and close the drawer."
                    ],
                    "task_desc":"Place watch in the desk drawer."
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "tests_unseen/trial_T20190907_074509_505382/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Go to the couch in front of you.",
                        "Take the black shiny animal figure from the shelf above the couch.",
                        "Face the wooden chest in front of the couch.",
                        "Set the black shiny animal figure atop the wooden chest."
                    ],
                    "task_desc":"Place a black animal figurine off the shelf above the couch onto the wooden chest in front of the couch."
                },
                {
                    "high_descs":[
                        "Move to the large brown sofa that is under the black shelf",
                        "Grab the statue from the black shelf",
                        "carry the statue to the wood dresser",
                        "Place the statue on top of the dresser in front of the plant"
                    ],
                    "task_desc":"Move a statue from the shelf to the dresser"
                },
                {
                    "high_descs":[
                        "Turn right, go straight between the coffee table and couch, then face the right side of the couch, and look above.",
                        "Take the statue from the black platform.",
                        "Turn around to face the coffee table.",
                        "Put the statue in front of the plant on the coffee table."
                    ],
                    "task_desc":"Put a statue on a coffee table."
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "tests_unseen/trial_T20190908_123456_669219/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around, walk straight, go to the brown couch, walk between the couch and the table to the shelf on top of the couch. ",
                        "Pick up the dog decoration from on top of the shelf. ",
                        "Turn around and go to the table in front of the couch. ",
                        "Put the dog on the edge of the right side of the table. ",
                        "Walk to the right, turn right at the end of the table, walk toward the wall, turn right to go to the table. ",
                        "Pick up another dog decoration from on top of the table. ",
                        "Turn around, go to the left, walk pass between the couch and the table and turn right to face the table again. ",
                        "Put the dog decoration at the back of the other dog on the table. "
                    ],
                    "task_desc":"Put 2 dog decorations front to back on the edge of the right side of the table. "
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "tests_unseen/trial_T20190907_040619_780535/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "turn right and cross the room the table with two remote controls",
                        "take the remote control on the right",
                        "cross the room to the couch, and stop in front of the couch cushion with the keys",
                        "put the remote on the front right corner of the cushion with the keys",
                        "cross the room to the table with the remote control",
                        "take the remote control",
                        "cross the room to the couch, and stop in front of the couch cushion with the keys and remote control",
                        "place the remote control on the left front corner of the cushion with the keys"
                    ],
                    "task_desc":"move the remote controls to the middle cushion of the couch"
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "tests_unseen/trial_T20190909_105426_604874/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move right then left to face the small brown chair against the wall",
                        "Pick up the keys on the chair in the middle of the chair",
                        "Carry the keys over to the right side of the large sofa",
                        "Place the keys on top of the sofa on the far right side"
                    ],
                    "task_desc":"Move keys to a sofa"
                },
                {
                    "high_descs":[
                        "Turn right and walk to the armchair containing the two key chains.",
                        "Pick up the key chain in the center of the armchair.",
                        "Turn left and walk forward to the coffee table, then turn left towards the sofa.",
                        "Put the key chain on the seat of the sofa which is the furthest on your right."
                    ],
                    "task_desc":"Move a key chain from an armchair to a sofa."
                },
                {
                    "high_descs":[
                        "Go right and then turn to the left to face the side of the brown chair.",
                        "Pick the keys in the middle of the chair up.",
                        "Go left and then turn to the left to face the couch",
                        "Put the keys down on the right side of the couch."
                    ],
                    "task_desc":"Put keys on a couch."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        }
    }
}