{
    "scene_name":"FloorPlan322",
    "trials":{
        "train/pick_and_place_simple-CellPhone-None-Bed-322/trial_T20190907_163944_460921/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_32AT8R96GOQ50YO4VE3RI4RFPH3USK",
                    "high_descs":[
                        "turn around, walk forward, turn right, walk forward, turn left to face the dresser",
                        "pick up the phone that is on the dresser",
                        "turn around, walk towards the bed",
                        "put the phone on the bed"
                    ],
                    "task_desc":"move the phone from the dresser to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_338JKRMM29GWVGWQEFA1EP8J935HAL",
                    "high_descs":[
                        "Turn around, head to the black dresser",
                        "Take the blue cell phone off of the dresser",
                        "Turn around, head to the bed",
                        "Put the blue cell phone on the bed"
                    ],
                    "task_desc":"Put the blue cell phone from the dresser onto the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3SUWZRL0M1UJO4TLY1LJDH9KL4M6E3",
                    "high_descs":[
                        "Turn left, walk forward past the bed and go to the right side of the dresser against the wall.",
                        "Pick up the cell phone off of the dresser.",
                        "Turn around and walk to the front of the bed.",
                        "Put the cell phone on the bed, in front of the closest textbook."
                    ],
                    "task_desc":"Move a cell phone from a dresser to a bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Bed-322/trial_T20190907_163932_211569/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3I7DHKZYGQHFBET3OTVK3TGK19Y5FA",
                    "high_descs":[
                        "turn around, walk across room, turn right to face the dresser",
                        "pick up the phone that is on the dresser",
                        "turn right, walk across room towards chair, turn right, walk to the bed",
                        "put the phone on the bed"
                    ],
                    "task_desc":"move phone from the dresser to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3OVHNO1VE9IGK8ZW4B7A4XKUQWEDZ4",
                    "high_descs":[
                        "Move to the large black end table against the wall",
                        "Pick up the phone sitting on top of the end table with the blue case",
                        "Carry the phone to the foot of the bed",
                        "Place the phone on the bed to the right of the cushion"
                    ],
                    "task_desc":"Move a phone to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3VA45EW49Q4AT95DM9CYNXCHHVC1O4",
                    "high_descs":[
                        "Turn around and begin walking across the room, then hang a right and walk up to the large black dresser.",
                        "Pick up the phone off of the dresser.",
                        "Turn around and begin walking across the room, then hang a left and walk over to the chair, after that turn right and walk up to the end of the bed.",
                        "Place the phone horizontally on the end of the bed to the right of the closest pillow."
                    ],
                    "task_desc":"Move a phone onto the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Dresser-322/trial_T20190907_044602_801023/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_382M9COHEKW4QFJMUJJMTNN0OH4EUV",
                    "high_descs":[
                        "Turn to your left then to your then left again, walk straight, then turn to your right head to the side table",
                        "Pick up the pencil beside the lamp on the table",
                        "Turn around to your left, past the bed then turn left, walk to you the other side of the bed ",
                        "Put the pencil in the mug under the lamp",
                        "Pick up the mug under the lamp on the table",
                        "Turn around to your right then walk across the room, then stop in front of the drawer",
                        "Put the mug on the top of the drawer"
                    ],
                    "task_desc":"Put the mug with a pencil on the top of the drawer",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2M7VEYAS1405L_388U7OUMFAIDJXCBIIP23NYCNIUR0O",
                    "high_descs":[
                        "Turn around and cross the room, then turn right and go to the bedside table",
                        "Take the pencil from the bedside table",
                        "Turn around and cross the room to the trashcan, then turn left, cross the room, and turn left again at the wall. Go forward to the bedside table.",
                        "Place the pencil in the mug that is on the left-side of the base of the table lamp on the bedside table",
                        "Take the mug from the bedside table",
                        "Turn around, go to just beyond the bed, turn right and go along the bed. Then, turn left and go to the right-hand side of the bureau, next to the grey chair. Turn right and look along the bureau",
                        "Place the mug on the bureau, just past the alarm clock"
                    ],
                    "task_desc":"Place a mug with a pencil next to the alarm clock",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1FP3SH704X01V_3AAPLD8UCFY1ACVZKF1I9UYBXQHHTT",
                    "high_descs":[
                        "Go to your left towards the wall then turn right and walk towards the night stand.",
                        "Take the pencil that is on the night stand.",
                        "Turn around and walk around the bed, turn right and walk over to the night stand.",
                        "Put the pencil in the cup.",
                        "Pick up the cup with the pencil.",
                        "Walk over to the dresser with the cup.",
                        "Place the cup on top of the dresser. "
                    ],
                    "task_desc":"Grab the cup with a pencil and put it on the dresser. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "AlarmClock"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Mug-Dresser-322/trial_T20190907_044544_187398/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJQGWGESKQT4Y_351SEKWQS3YGL10DPMHGWVOLBLXDMA",
                    "high_descs":[
                        "Go left and stand in front of the night stand on the left of the bed.",
                        "Pick up the pencil from the night stand.",
                        "Put the pencil in the black cup.",
                        "Pick the cup up from the night stand.",
                        "Turn around and go left and then right to face the black dresser.",
                        "Put the mug on the dresser."
                    ],
                    "task_desc":"Put a cup with a pencil in it on the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2QPMJ4GADLUW2_37W3JXSD69PFOOPIPKAHIE0DRBLYWY",
                    "high_descs":[
                        "Turn left, walk to the trash can, then turn right and walk to the lamp.",
                        "Pick up the pencil resting on the bottom of the lamp.",
                        "Place the pencil into the black mug that is between the lamp and the bed.",
                        "Pick up the black mug with the pencil in it.",
                        "Turn around and walk to the large black cabinet.",
                        "Place the mug with the pencil in it on the large black cabinet."
                    ],
                    "task_desc":"Place a mug with a pencil in it onto the black cabinet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3EJJQNKU9UMOUXI7GQWN9FXT90QHRC",
                    "high_descs":[
                        "Turn left and go to the small table on the left side of the bed. ",
                        "Pick up the pencil on the table. ",
                        "Put the pencil in the mug on the table. ",
                        "Pick up the mug with pencil.",
                        "Turn around and bring the mug with pencil to the black dresser. ",
                        "Put the mug on the black dresser. "
                    ],
                    "task_desc":"Put a mug with pencil on the black dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "Mug",
                "Pencil",
                "Cabinet",
                "Dresser"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Dresser-322/trial_T20190908_051200_050277/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ACSS93E03ZUGX_3OHYZ19UGFM6NXIDIS5RYY5KL95AOS",
                    "high_descs":[
                        "Go straight, turn left, and straight again to face the end table.",
                        "Pick up the keys from the table.",
                        "Turn around go straight and slightly to the right to face the black dresser.",
                        "Place the keys on the dresser.",
                        "Turn to the right and go straight to face the other side of the grey chair.",
                        "Pick the keys up from off of the chair.",
                        "Go to the right then to the right again to face the dresser.",
                        "Place the keys on top of the dresser"
                    ],
                    "task_desc":"Place both keys on top of the black dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2DN53DIE3049T_3U8YCDAGXSXD7WXB5302YXO7RNOQ00",
                    "high_descs":[
                        "Turn to the left, walk to the table on the right of the bed",
                        "Pick up the keys from the nightstand",
                        "Turn around, walk to the table across from the bed",
                        "Set the keys on the table",
                        "Turn back around, walk to the chair across from the bed",
                        "Pick up the keys from the chair",
                        "Walk back to the same nightstand where you left the other keys",
                        "Set the keys on the table, next to the other ones"
                    ],
                    "task_desc":"Move keys to a table in your bedroom",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Dresser-322/trial_T20190908_051114_312895/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_36WLNQG782RPUGAGUS2ROXVCZOABE8",
                    "high_descs":[
                        "Turn right then walk forward head to the side table on the right side of the bed",
                        "Pick up the keys on the side table",
                        "Turn right move forward then head to the drawer in front of the bed",
                        "Put the keys on top of the drawer",
                        "Turn left cross the room head to the left side of bed side table",
                        "Pick up the keys on the side table",
                        "Turn right head to the drawer on your right",
                        "Put the keys on top drawer beside the first keys"
                    ],
                    "task_desc":"Put the keys on top drawer",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-Dresser-322/trial_T20190908_051029_553111/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A30M9SZYJKFDS9_3TY7ZAOG5I1RWTZGSYG52BCYSH9K0F",
                    "high_descs":[
                        "turn around to the left towards the mirror go left facing the night stand",
                        "pick up the keys that are on top of the night stand",
                        "turn around to the left go right turn left ",
                        "face the dresser put the keys on top of the dresser",
                        "turn around to the left towards the grey couch on the corner",
                        "pick up the keys that are on top of the couch ",
                        "go left across the room",
                        "face the dresser put the keys on top of the dresser"
                    ],
                    "task_desc":"put 2 set of keys on top of a dresser ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Bed-322/trial_T20190906_181130_177836/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A28HB7240OFGEW_33FOTY3KEP29KK8AW437SXIZPU0C1A",
                    "high_descs":[
                        "Walk to the nightstand by the bed.",
                        "Pick up the cell phone.",
                        "Walk to the side of the bed near the laptop.",
                        "Put down the cell phone on the edge of the bed.",
                        "Turn around and walk to the chair with the cell phone on it.",
                        "Pick up the cell phone.",
                        "Walk back over to the edge of the bed.",
                        "Put the cell phone down next to the other one."
                    ],
                    "task_desc":"Place both cell phones in the room on the edge of the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Bed"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Bed-322/trial_T20190906_181156_010327/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1VAL7L9L79IN0_3L6L49WXW3E5DYWE4CZ1CPJS9XT54D",
                    "high_descs":[
                        "Walk to the black drawers on your right.",
                        "Grab the blue smart phone on top of the black drawers.",
                        "Turn around and walk to the bed.",
                        "Place the blue smart phone on the bed.",
                        "Turn around and walk to the gray lounge chair.",
                        "Grab the blue smart phone on the gray lounge chair.",
                        "Turn around and walk to the bed.",
                        "Place the blue smart phone to the right of the previous blue smart phone."
                    ],
                    "task_desc":"Place both of the blue smartphones on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-SideTable-322/trial_T20190908_112657_423751/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPRVK6XK6GP5_3DUZQ9U6SPFDY2Z2WC2DFCD0XDWVS5",
                    "high_descs":[
                        "Turn to the right and go the the blue trash can on the floor.",
                        "Take the pencil out of the trash can.",
                        "Turn around and approach the nightstand to the left of the bed.",
                        "Set down the pencil on the base of the lamp sitting on the nightstand."
                    ],
                    "task_desc":"Retrieve a pencil and put it on the nightstand near the window.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3MTMREQS4Y9MDVDD5MLIGE28IHAWA5",
                    "high_descs":[
                        "Turn around and walk towards the bed. Turn left before the bed and walk to the blue trash can.",
                        "Pick up the pencil in the trash can.",
                        "Turn left and walk to the night stand to the left of the bed.",
                        "Put the pencil on the night stand."
                    ],
                    "task_desc":"Pick up the pencil and put it on the night stand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3OHYZ19UGFWE8M4BE0U8ZKPMFFIOAS",
                    "high_descs":[
                        "Turn around, walk to the foot of the bed, turn left, walk to the trash bin.",
                        "Pick up the pencil that is in the trash bin.",
                        "Turn completely around and walk up to the nightstand that is to the left of the bed.",
                        "Put the pencil down on the nightstand, on top of the base of the lamp."
                    ],
                    "task_desc":"Move a pencil to the nightstand. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-SideTable-322/trial_T20190908_112718_743066/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3EA3QWIZ4LM9RWSHM58KASJSRUDTIU",
                    "high_descs":[
                        "Turn right, walk halfway across the room, turn left, and walk to the counter.",
                        "Pick up the pencil.",
                        "Turn around and walk across the room to the lamp table.",
                        "Put the pencil on the lamp table."
                    ],
                    "task_desc":"Put a pencil on the lamp table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3EO896NRAZM5M7CN4NTKMTYS4ADJT9",
                    "high_descs":[
                        "Turn right and walk forward to the left edge of the black desk to your left.",
                        "Pick up the pencil on the desk.",
                        "Turn right and walk to the gray chair in the left corner. Turn right at the gray chair and walk to the wooden nightstand. ",
                        "Put the pencil in the nightstand."
                    ],
                    "task_desc":"Pick up the pencil and put it on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TUUIV61CR0C7_3YT88D1N0BPVYAKB7TN55VU7PZQK3G",
                    "high_descs":[
                        "Turn right, walk to the far end of the bed, and turn left and walk to the dresser.",
                        "Pick up the pencil lying on the top of the dresser.",
                        "Turn completely around, walk to the end of the bed, turn left and walk to the wall, turn right and walk to the nightstand beside the bed.",
                        "Place the pencil on the nightstand."
                    ],
                    "task_desc":"Move the pencil from the dresser to the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "Pen",
                "Book",
                "Laptop",
                "Cloth",
                "AlarmClock",
                "Pencil",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-BaseballBat-None-Bed-322/trial_T20190908_115207_881340/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3VJ40NV2QLEJNI3KK0LPUPFE33GOTO",
                    "high_descs":[
                        "Walk forward to the bed then turn right and walk to the mirror on the wall.",
                        "Pick up the baseball bat that's on the floor.",
                        "Turn right and take a small step forward then turn right and walk until you're even with the middle of the side of the bed then when you are turn right and walk to the bed.",
                        "Stand the bat on end near the left laptop's bottom left side if you were facing the laptop."
                    ],
                    "task_desc":"Put a bat on the bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_36U2A8VAG4QWEDHZWEGVVPQKY1UYKB",
                    "high_descs":[
                        "Turn right and veer slightly left to the mirror.",
                        "Pick up bat on the floor.",
                        "Turn around and walk to the left side of the end of the bed.",
                        "Place the bat on the bed near the left laptop."
                    ],
                    "task_desc":"Place a bat on a bed.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3JBT3HLQFBTXUUOK5SNM5DLLY5BPZ1",
                    "high_descs":[
                        "Turn to your right and go across the room stopping just before the mirror on the wall across from you. ",
                        "Pick up the baseball bat that is on the floor, below the mirror hanging on the wall. ",
                        "Turn around and go to the bed to your right. ",
                        "Place the baseball bat on the bed, in front of the laptop on the left. "
                    ],
                    "task_desc":"Put the baseball bat on the bed.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_simple-BaseballBat-None-Bed-322/trial_T20190908_115151_138786/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3M81GAB8A3AMC8MJZRM8J04SCYCQBO",
                    "high_descs":[
                        "turn left, walk forward, turn left, walk forward to the wall",
                        "pick up the bat that is on the floor",
                        "turn around, walk forward, turn right to face the bed",
                        "put the bat on the bed"
                    ],
                    "task_desc":"move the bat from the floor to the bed",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3RXCAC0YIUGCXLUYTJXMYKAPY5NG8P",
                    "high_descs":[
                        "go to the mirror on the wall and look down at the floor",
                        "pick up the bat from the floor",
                        "take it the side of the bed",
                        "stand the bat up on the bed"
                    ],
                    "task_desc":"get a bat from the floor and stand it up on the bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3QAPZX2QN74402HOZ0ZI31A65O2201",
                    "high_descs":[
                        "Turn left and go around the foot of the bed to the mirror.",
                        "Pick up the bat under the mirror.",
                        "Turn around and walk to the foot of the bed.",
                        "Place the bat on the bed under the leftmost laptop."
                    ],
                    "task_desc":"Place a bat on a bed.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-ArmChair-322/trial_T20190908_223353_762783/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3A1COHJ8NMMQXHP9DPF4JKMQDAK8HA",
                    "high_descs":[
                        "head forward and cross the room, then turn right and walk to the night stand that is to the left of the bed",
                        "Pick up the keys that are sitting on the night stand",
                        "Turn around and head forward to the grey arm chair across the room",
                        "Place the keys on the arm chair to the right of the laptop"
                    ],
                    "task_desc":"Place a set of keys on an armchair",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3FPRZHYEP1Y9ELEN6X1C745O539V31",
                    "high_descs":[
                        "Walk to the wall in front of you, then turn right and walk up to the nightstand. ",
                        "Pick up the set of keys that are on the nightstand.",
                        "Turn around completely and walk up to the chair that is directly across the room in front of you. ",
                        "Place the keys down on the chair, to the right of the laptop. "
                    ],
                    "task_desc":"Move a set of keys to a chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3GGAI1SQEYPE1YGXLYBMDBQ5KN7MC6",
                    "high_descs":[
                        "turn right, take a step, turn left, walk to wall, turn right, walk to small table",
                        "pick up the keys that are on the small table",
                        "turn around, walk forward to chair",
                        "put the keys on the chair"
                    ],
                    "task_desc":"move keys from table to a chair",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-ArmChair-322/trial_T20190908_223340_751080/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1S1K7134S2VUC_3IAEQB9FMHBKB2GPPWCK6FAE3OSWD0",
                    "high_descs":[
                        "Turn right, move to the counter near the CD.",
                        "Pick up the keys from the counter.",
                        "Turn right, move to the arm chair.",
                        "Place the keys on the arm chair."
                    ],
                    "task_desc":"Place a set of keys onto a arm chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3R8YZBNQ9K9ZAWJTMAASEYIWTC57QB",
                    "high_descs":[
                        "Turn right then head to the cabinet",
                        "Pick up the keys on the cabinet",
                        "Turn right and head to the couch beside the cabinet",
                        "Put the keys on the edge of the couch"
                    ],
                    "task_desc":"Put keys from cabinet to the couch",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3RJSC4XJ13LWZZ0BHJ1G18DIP2C05R",
                    "high_descs":[
                        "Make a right to walk to the black dresser.",
                        "Pick up the keys from the top of the black dresser.",
                        "Turn right to walk towards the blue armchair.",
                        "Set the keys down on the closest corner of the armchair seat."
                    ],
                    "task_desc":"Move keys from the dresser to the armchair.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Pen-None-SideTable-322/trial_T20190909_055242_347953/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2TUUIV61CR0C7_39DD6S19JS2TX3ZUWE7BB1MHK6FZEC",
                    "high_descs":[
                        "Turn left, walk slightly forward, turn left, walk to the wall, turn left so you are facing the waste basket. ",
                        "Pick up the red pen in the waste basket. ",
                        "Turn left, take a step, turn left, walk to the table beside the bed. ",
                        "Put the pen on the end table behind the CD. "
                    ],
                    "task_desc":"Take the pen out of the waste basket and put it in the bedside table. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_3U5JL4WY5N0M062M6Q7D5UUFZHO4XF",
                    "high_descs":[
                        "turn to the left and move to the blue trash can",
                        "pick up the red pen and remove it from the trash can",
                        "turn around and move forward to the night stand that is to the left of the bed",
                        "put the pen on to the night stand"
                    ],
                    "task_desc":"put a pen on the night stand",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3SB5N7Y3O6VUFWPVYFK75547FFB0G2",
                    "high_descs":[
                        "Turn left, hang a left at the bed and turn left at the wall to face the blue bin on the floor.",
                        "Pick up the pencil from inside the blue bin on the floor.",
                        "Turn around and walk to the wooden nightstand next to the bed.",
                        "Put the pencil in front of the silver disc on the nightstand."
                    ],
                    "task_desc":"Place a pencil on a nightstand.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_two_obj_and_place-BaseballBat-None-Bed-322/trial_T20190907_040609_515967/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3NS0A6KXC7PJWS9N618IAINR3JGZGC",
                    "high_descs":[
                        "Turn left and head across the room to the trash can, Then turn left and head to the corner of the room behind the chair.",
                        "Pick up the bat that is behind the chair",
                        "Turn around and walk back to the trash can and take a right, then take a left at the dresser on your left and walk to the bed",
                        "Place the bat on the bed to the left of the pillows",
                        "Turn right and cross the room to the photo on the wall",
                        "Pick up the bat that is laying on the floor below the photo.",
                        "Turn around and walk back to the bed.",
                        "Place the bat on the right of the pillow that is closest to you. "
                    ],
                    "task_desc":"Place bats on a bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3T9K2RY06UO14_3PH3VY7DJOEFTEZNL6C0WL9FX7AZWF",
                    "high_descs":[
                        "Turn and go to the corner by the chair.",
                        "Pick up the baseball bat in the corner. ",
                        "Turn around and go to the bed.",
                        "Put the baseball bat on the bed. ",
                        "Turn and go to the picture on the wall by the door.",
                        "Pick up the baseball bat on the floor. ",
                        "Turn around and go to the bed.",
                        "Put the baseball bat on the bed."
                    ],
                    "task_desc":"Move the baseball bats to the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3Y9N9SS8L1SFZFS3J4C10WFFBVCD3S",
                    "high_descs":[
                        "Turn left, go straight to the wall, turn left and go to the baseball bat.",
                        "Take the baseball bat from the floor.",
                        "Turn left, go straight, turn left towards the bed, go straight to the bed.",
                        "Put the baseball bat on the lower left side of the bed.",
                        "Turn right, go straight to the wall.",
                        "Take the baseball bat from the floor.",
                        "Turn around, go straight, turn right towards the bed.",
                        "Put the bat to the right of the center pillow on the bed."
                    ],
                    "task_desc":"Put 2 baseball bats on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "BaseballBat"
            ]
        },
        "train/pick_two_obj_and_place-BaseballBat-None-Bed-322/trial_T20190907_040655_418034/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A17TKHT8FEVH0R_32SVAV9L3IQH18PRZULZAV79QKG3A1",
                    "high_descs":[
                        "Walk to the corner of the room that's behind the couch",
                        "Grab the baseball bat that's in the corner of the room",
                        "Turn around and head to the bed",
                        "Place the bat in front of the laptop on the bed",
                        "Turn to your right and head to the wall",
                        "Grab the baseball bat that is on the floor near the wall",
                        "Turn around and head to the bed",
                        "Place the bat in front of the book on the bed"
                    ],
                    "task_desc":"Place baseball bats on a bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_37WLF8U1WS7MA4LVUNWMBCMP5NAK61",
                    "high_descs":[
                        "Turn around and head to the grey chair across the room",
                        "Pick up the bat that is behind the grey chair",
                        "Turn around and walk to the bed",
                        "Place the bat on top of the bed",
                        "Turn right and head to the photo on the wall",
                        "Pick up the bat that is under the photo ",
                        "Turn around and walk to the bed",
                        "Place the bat on the bed to the right of the book"
                    ],
                    "task_desc":"Place bats on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-SideTable-322/trial_T20190908_203547_041542/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A32W24TWSWXW_34S6N1K2ZYALCO9S7EO8OP8WXBQHLE",
                    "high_descs":[
                        "Turn right for one step; turn left for one step to face the dresser.",
                        "Pick up the red pen from the dresser on the right.",
                        "Stand up holding the pen.",
                        "Put the pen in the black mug at the back of the dresser to the right.",
                        "Pick up the mug with the pen still inside.",
                        "Turn around and then right and walk to the door, turn left and take nine steps, turn right for one step and then left and stop.",
                        "Place the cup on the bottom right of the nightstand, to the right of the credit card."
                    ],
                    "task_desc":"Put a black mug, with a red pen in it, on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3C81THYYSBGVD_3MRNMEIQW8X4084QLI5IX4TY5JYLDA",
                    "high_descs":[
                        "Turn right then face the table to your left.",
                        "Take the red pencil off of the table in front of you.",
                        "Face the cup on the table in front of you.",
                        "Place the red pencil in the cup on the table in front of you.",
                        "Take the cup off of the table in front of you.",
                        "Turn around and face your bed side table in front of you.",
                        "Place the cup with the pencil on the bed side table in front of you."
                    ],
                    "task_desc":"Place pencil on bed side table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A19LVWX8ZLO6CS_3S0TNUHWKW99L1K7RTWESZ7SLJZ8DB",
                    "high_descs":[
                        "Turn right, step forward, then turn left to be center with the desk. ",
                        "Pick up the pencil on the right side in front of the cup.",
                        "Step forward to be closer to the desk.",
                        "Place the pencil inside the cup on the top right.",
                        "Pick up the cup from the desk.",
                        "Turn around and walk to the nightstand to the right side of the bed.",
                        "Place the cup on the lower right edge of the night stand."
                    ],
                    "task_desc":"Put a pencil inside a cup and place the cup on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-SideTable-322/trial_T20190908_203742_396526/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3B3WTRP3DETMWW51ZWIBWCBZ8W829X",
                    "high_descs":[
                        "Turn to the right and then find the large dresser across the room.",
                        "Pick up the orange colored pencil from the back of the dresser.",
                        "Hold the pencil and look down. ",
                        "Open the top drawer and place the pencil inside.",
                        "Take out a cup with the pencil inside. Shut the drawer.",
                        "Carry the cup and turn around. Walk back to the small brown dresser with a lamp.",
                        "Place the cup on the dresser, to the right side."
                    ],
                    "task_desc":"Move a pencil to a cup and move them both to a dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3OLF68YTNCSK29RIFXBICQG8NJRFA7",
                    "high_descs":[
                        "Turn around, hang a left at the bed and walk to the black dresser ahead.",
                        "Pick up the yellow pen on the dresser in the middle.",
                        "Look down at the cabinets below the top of the dresser.",
                        "Open the middle lower cabinet and put the pen inside the black mug.",
                        "Pick up the mug with the pen inside and close the door.",
                        "Turn around, turn right, hang a left at the door and walk to the small nightstand next to the bed.",
                        "Put the mug with the pen on the front right corner of the nightstand."
                    ],
                    "task_desc":"Place a mug with a pen on a nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1S1K7134S2VUC_3ZGVPD4G6W8VMMHRM9W6ANMINCIZTA",
                    "high_descs":[
                        "Turn left, move to the cabinet, right of the computer.",
                        "Pick up the pen from the counter top.",
                        "Move to the counter, left side, in front of the right hand door.",
                        "Put the pen in the cup below the cabinet.",
                        "Pick up the cup from below the cabinet.",
                        "Turn right, move to the nightstand near the door.",
                        "Put the cup on the nightstand."
                    ],
                    "task_desc":"Place a cup containing a pen onto the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-SideTable-322/trial_T20190908_203615_072050/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_35GMH2SV3H8HYZLNU5WUV3FD004OEN",
                    "high_descs":[
                        "Turn around and walk around the right side of the bed to the dresser.",
                        "Pick up the pen from the dresser. ",
                        "Turn around and walk to the other end of the dresser. ",
                        "Place the pen inside the black mug on the dresser.",
                        "Pick up the mug and pen from the dresser. ",
                        "Turn around to the left and walk back around the bed.",
                        "Place the mug on the night stand by the bed. "
                    ],
                    "task_desc":"Move a mug and pen to the night stand. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_378XPAWRUF44C0T8G5H3FNT03BBAIL",
                    "high_descs":[
                        "Turn around and walk over to the black dresser on your left.",
                        "Pick up the leftmost red pen off of the black dresser.",
                        "Turn around and take a step forward, then turn right and walk up to the door, turn right again and walk up to the black dresser.",
                        "Put the red pen in the black mug on the dresser.",
                        "Pick up the black mug with the pen in it off of the dresser.",
                        "Walk over to the wooden nightstand to the right of the bed behind you.",
                        "Put the mug with the pen in it on the front right corner of the nightstand."
                    ],
                    "task_desc":"Put a mug with a pen in it on a nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3VJ40NV2QLEJNI3KK0LPUPFE3AQOTC",
                    "high_descs":[
                        "Turn right and go to the drawer",
                        "Grab the pen off of the drawer ",
                        "Move slightly to the left",
                        "Put the pen in the black mug",
                        "Grab the mug off of the drawer",
                        "Turn around and go to the nightstand to the right of the bed",
                        "Put the mug on the right of the nightstand"
                    ],
                    "task_desc":"Putting a black mug with a pen in it on a nightstand",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-SideTable-322/trial_T20190909_091715_713301/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A22ON3MIIG0IJA_39LOEL67OVWB39IAY4Q2FQLGUH983Y",
                    "high_descs":[
                        "Turn right and walk to the end of the bed then turn left and walk to the mirror, then turn right and walk to the black dresser.",
                        "Pick up the keys closest to the pencil.",
                        "Turn around and walk to the nightstand between the bed and the white door.",
                        "Put the keys down on the nightstand."
                    ],
                    "task_desc":"Put a set of keys down on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3HYA4D452UAVX6WE2II368XAB7H2FT",
                    "high_descs":[
                        "Turn right and then left at the end of the bed and then right to face the black dresser.",
                        "Pick the keys up from the dresser.",
                        "Turn around and cross the room to face the night stand to the right of the bed.",
                        "Put the keys on the night stand."
                    ],
                    "task_desc":"Put keys on a night stand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3P4RDNWND8XFDTWCABUG8MWJTA3JIW",
                    "high_descs":[
                        "Look down, turn right and walk to the large black drawer cabinet in the corner of the room to your left.",
                        "Grab the pair of keys between the other pair of keys and the pencil on the drawer cabinet.",
                        "Turn around and walk straight to the night stand beside the bed.",
                        "Place the keys on the night stand."
                    ],
                    "task_desc":"Place a pair of keys on the night stand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-SideTable-322/trial_T20190909_091659_910683/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_384PI804XVSX51YMTFEOUJNA3YNS0C",
                    "high_descs":[
                        "turn left, walk forward, turn left to face dresser",
                        "pick up the keys that are on the dresser",
                        "turn around, walk forward, turn left, walk forward, turn right, walk to table",
                        "put the keys on the table"
                    ],
                    "task_desc":"move keys from dresser to table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALKQPW0O9C98N_3PWWM24LHVPMIRMRU4CXWGGOO3728F",
                    "high_descs":[
                        "Turn around and go to the dresser",
                        "Pick up the keys from the dresser",
                        "Turn right and go along the left side of the bed nearest the wall",
                        "Put the keys on the bedside table between the pencil and the lamp"
                    ],
                    "task_desc":"Put keys on the bedside table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3SB5N7Y3O6VUFWPVYFK75547FO30GC",
                    "high_descs":[
                        "walk to face bureau",
                        "pick up keys from bureau top",
                        "walk to face night stand to left of bed",
                        "put keys on night stand"
                    ],
                    "task_desc":"put keys on night stand",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190908_115134_001298/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around, head straight to the mirror",
                        "Take the black baseball bat from the floor",
                        "Turn around, head across the room",
                        "Put the baseball bat on the bed"
                    ],
                    "task_desc":"Take the bat from the floor, put it on the bed"
                },
                {
                    "high_descs":[
                        "Turn around and walk to the right of the yellow bed.",
                        "Pick up the black baseball bat on the floor.",
                        "Turn around and walk to the left of the bed.",
                        "Put the black baseball bat on the bed."
                    ],
                    "task_desc":"Pick up the black baseball bat and put it on the bed."
                },
                {
                    "high_descs":[
                        "Move forward to the mirror.",
                        "Pick up the bat on the floor. ",
                        "Turn around, bring the bat to the bed near the phone.",
                        "Put the bat on the bed, in front of the pillow, left of the phone. "
                    ],
                    "task_desc":"Put a bat on the bed. "
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "tests_seen/trial_T20190907_164001_509050/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "walk straight to the wall, turn left to the sofa chair",
                        "grab the phone on the sofa chair",
                        "turn left, walk to the end of the bed",
                        "put the phone on the bed"
                    ],
                    "task_desc":"move the phone from the sofa chair to the bed"
                },
                {
                    "high_descs":[
                        "Walk forward and to the chair on your left.",
                        "Pick up the phone from the chair.",
                        "Turn around and go to the foot of the bed.",
                        "Put the phone on the bed."
                    ],
                    "task_desc":"Move the phone from the chair to the bed."
                },
                {
                    "high_descs":[
                        "go forward to the right front of the waste basket and turn left and go forward past the waste basket and turn right and step to the wall and turn left and take a few steps and turn left",
                        "pick up the smart phone from the chair",
                        "turn to the left and take a few steps and turn to the right and take a few steps to the middle of the bed and turn to the left and go to the bed",
                        "put the smart phone on the bed"
                    ],
                    "task_desc":"Place a smart phone on a bed"
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        }
    }
}