{
    "scene_name":"FloorPlan223",
    "trials":{
        "train/look_at_obj_in_light-Candle-None-FloorLamp-223/trial_T20190907_061740_610701/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_33JKGHPFYFBP7DRQEGVJS00FPQQMNU",
                    "high_descs":[
                        "Turn around and take one step then turn to your left and face the glass table in front of you",
                        "Pick up the candle that is sitting on the table",
                        "Turn to your right and cross the room, then turn right and face the tall lamp that is to the left of the chair",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine a candle under a tall lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3HMIGG0U4ON4YNT0RHUB4YXR957Y8A",
                    "high_descs":[
                        "Turn to the right and face the coffee table.",
                        "Pick up the candle from the coffee table.",
                        "Turn right and go to the lamp in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a candle by lamp light.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_36PW28KO42DKB65OOE2VTMB6HNOAE9",
                    "high_descs":[
                        "Move across the room to the square glass coffee table ",
                        "Pick up the candle on top of the glass coffee table",
                        "Carry the candle over to the large floor lamp in the corner of the room to the left of the wall photo",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Move a candle over to the lamp to turn on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3FFJ6VRIL450QY9SSVVTPVXL0UBI0R",
                    "high_descs":[
                        "turn to the right, stop and face short glass coffee table with box on it",
                        "pick up candle from the glass coffee table",
                        "turn right, walk through room and face floor lamp",
                        "turn on floor lamp"
                    ],
                    "task_desc":"pick up candle and turn on floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AUTYWXILTACCR_3T3IWE1XG94EN5U235OCI8QCOFUQTJ",
                    "high_descs":[
                        "Turn to face the glass table behind you.",
                        "Pick up the candle to the left of the box on the table.",
                        "Turn to your right, then turn right at the tv to face the lamp.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Turn a lamp on while holding a candle.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3Y4W8Q93L21ZBOUM3EI7JR7Y2FVDVF",
                    "high_descs":[
                        "turn around, walk to the coffee table on the left",
                        "grab the candle on the coffee table",
                        "turn right, walk to the corner with a floor lamp",
                        "turn on the floor lamp"
                    ],
                    "task_desc":"grab the candle from the coffee table, turn on the floor lamp",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Candle",
                "FloorLamp"
            ]
        },
        "train/look_at_obj_in_light-Candle-None-FloorLamp-223/trial_T20190907_061753_998965/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_37M28K1J0TUSMMRG2FDMQ2OYLGJAJY",
                    "high_descs":[
                        "go forward to the chair and turn right and go forward to the end of the coffee table and turn left and go forward to the sofa and turn left and go forward to the TV stand",
                        "pick up candle from the TV stand",
                        "turn right and go forward to the chair and turn left and take a step and turn right and look up to the lamp",
                        "turn on the lamp"
                    ],
                    "task_desc":"Turn on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3KMS4QQVK57ITXE6VGZQ5IZ2XLVFKE",
                    "high_descs":[
                        "Walk straight toward the armchair then turn right and walk to the tv stand. ",
                        "Pick up the candle from the tv stand. ",
                        "Turn right and walk to the floor lamp that is to the right of the tv stand. ",
                        "Turn the floor lamp on. "
                    ],
                    "task_desc":"Turn on a floor lamp while holding a candle. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3KXIR214I7XDE1DRMTX3EIGHSW9425",
                    "high_descs":[
                        "Move to the living room facing the TV stand",
                        "Pick up the long brown item on the top left of the TV stand",
                        "Carry the long brown item and move to your right where the green floor lamp is",
                        "Turn on the green lamp"
                    ],
                    "task_desc":"Carry a brown item while turning on the lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Candle",
                "Vase"
            ]
        },
        "train/look_at_obj_in_light-Plate-None-FloorLamp-223/trial_T20190908_115332_812519/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_37QW5D2ZRJDFNQ3POJR3NYTSMH6S8C",
                    "high_descs":[
                        "walk forward to arm chair, turn right, walk forward past coffee table, turn left, turn right, walk to TV stand",
                        "pick up the plate that is on bottom shelf of TV stand",
                        "walk over to the lamp in the corner to the right of the TV stand, hold plate up",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine a plate with the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3GNCZX450LEWTMGCT07NOKUCPLZPAX",
                    "high_descs":[
                        "Walk forward to then chair then turn right and walk to the tv in front of you and face the middle of it.",
                        "Pick up the plate that's under the tv.",
                        "Turn right and walk to the chair then take a step to your left.",
                        "Look up and turn on the light."
                    ],
                    "task_desc":"Inspect a plate in lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3KB8R4ZV1HYVZJS5WVHWPM0Q6CWGBE",
                    "high_descs":[
                        "Walk across the room then turn right, then take four steps, then turn left and take one step, then turn right and walk to the television.",
                        "Take the yellow tray from the shelf underneath the television. ",
                        "Turn to the right and walk to the chair, then turn left and take one step, then turn right and look up at the lamp.",
                        "Turn on the lamp. "
                    ],
                    "task_desc":"Look at the tray in the lamp light. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Candle-Plate-DiningTable-223/trial_T20190909_003209_935774/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_39GHHAVOMIIL5MXXPMSCELM0ODN4JT",
                    "high_descs":[
                        "Turn around, then left to go to the far end of the dining table.",
                        "Pick up the candle stick from the table, to the left of the box.",
                        "Carry the candle stick and turn left. Then right and left to face the coffee table.",
                        "Place the candle stick on the plate on the coffee table.",
                        "Pick up the plate from the coffee table. ",
                        "Carry the plate and turn around to the TV.",
                        "Place the plate on the cabinet bottom shelf."
                    ],
                    "task_desc":"Move a plate and candle stick to a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2YUCJ28XANFOX_3DEL4X4EL9C2YDG6VXVKLJYMUB3YXW",
                    "high_descs":[
                        "Turn right and then left walking into the other room to the table.",
                        "Pick up the candle sitting on the table",
                        "Turn left and cross into the next room turn left and go to the coffee table.",
                        "Set the candle down on the plate sitting on the coffee table",
                        "Pick up the plate with the candle on it",
                        "Turn around and walk over to the tv stand against the wall ",
                        "Place the plate with the candle on it on the bottom shelf."
                    ],
                    "task_desc":"Move the candle onto a plate and place it on the shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3U4J9857OH2C6QH43SD2J9NX79F7B4",
                    "high_descs":[
                        "Turn right walk forward then turn left face the table on your left",
                        "Pick up the candle on the table",
                        "Turn left walk straight then go to the right side end of the center table",
                        "Put the candle on the plate at the table",
                        "Pick up the plate with candle ",
                        "Turn left then head to the tv stand ",
                        "Put the plate with candle under the tv stand"
                    ],
                    "task_desc":"Put the plate with candle under the tv stand",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Candle",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Candle-Plate-DiningTable-223/trial_T20190909_063534_268824/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3DIP6YHAPFJED7Y7NO7YYHPDLS3E87",
                    "high_descs":[
                        "Turn to the left and then face the coffee table on the left.",
                        "Pick up the candle stick from the short side of the coffee table.",
                        "Hold the candle stick and take a step to the left.",
                        "Place the candle stick on the plate, closest to you.",
                        "Pick up the plate from the coffee table.",
                        "Hold the plate and turn to the left and then right to find the TV.",
                        "Place the plate and candle stick on the bottom shelf."
                    ],
                    "task_desc":"Move a plate and candle stick to the shelf.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3W2LOLRXLE6NHC5DIJO1NTXNVFKRK9",
                    "high_descs":[
                        "turn around, go to right end of coffee table",
                        "pick up candle in holder from coffee table",
                        "go to square gold plate to the left",
                        "place candle on left back corner of square gold plate",
                        "pick up gold plate with candle",
                        "go around coffee table to television stand",
                        "place gold plate with candle on bottom shelf of television stand"
                    ],
                    "task_desc":"Place gold plate with candle on television stand",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_39JEC7537XSXRLA6ZQCD079IBDXVC4",
                    "high_descs":[
                        "Turn around and face the living room table.",
                        "Pick up the finger nail polish on the living room table.",
                        "Take a step to the left and face the plate on the living room table.",
                        "Place the finger nail polish on the left plate on the table.",
                        "Pick up the plate with the finger nail polish on the table.",
                        "Walk around the living room table to face the television stand.",
                        "Place the plate on the bottom shelf of the TV stand."
                    ],
                    "task_desc":"To put finger nail polish on a plate and place it on the bottom shelf under the television.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Candle",
                "Plate"
            ]
        },
        "train/pick_two_obj_and_place-Statue-None-CoffeeTable-223/trial_T20190907_174359_931960/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3AAPLD8UCFY1ACVZKF1I9UYBXVKTHI",
                    "high_descs":[
                        "Turn around, walk across the room, turn right, walk across the room, then turn left to face the kitchen table.",
                        "Pick up the statue on the kitchen table.",
                        "Turn left and walk across the room to face the glass table in the living room.",
                        "Place the statue on the table in the middle of the living room.",
                        "Turn around and walk across the room to face the far end of the table.",
                        "Pick up the animal sculpture on the kitchen table.",
                        "Walk around the table and across the room to face the glass table in the living room.",
                        "Place the animal sculpture on the glass table in the living room."
                    ],
                    "task_desc":"To move 2 sculptures from the kitchen table to the living room table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_31JLPPHS2XB63CJS9DQHBQREFVB3OF",
                    "high_descs":[
                        "Turn around, walk to the chairs, then turn right and go forward, then left to the dining table.",
                        "Pick up the human statue from the table.",
                        "Turn left and go to the coffee table.",
                        "Put the statue on the coffee table.",
                        "Turn around and go back to the dining table.",
                        "Pick up the animal statue.",
                        "Return to the coffee table.",
                        "Put the animal statue on the coffee table."
                    ],
                    "task_desc":"Move both statues from the dining table to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "train/pick_two_obj_and_place-Statue-None-CoffeeTable-223/trial_T20190907_174318_168269/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3VA45EW49Q4AT95DM9CYNXCHHYCO1X",
                    "high_descs":[
                        "Walk to the wall, turn left, head to the table, and turn left.",
                        "Pick up the statue.",
                        "Turn left and walk to the coffee table.",
                        "Put the statue on the coffee table.",
                        "Turn around and walk to the table.",
                        "Pick up the trophy.",
                        "Turn around and walk to the coffee table.",
                        "Put the trophy on the coffee table."
                    ],
                    "task_desc":"Put a statue and a trophy on the coffee table.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-223/trial_T20190909_110058_262220/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_33SA9F9TR0LP38UPLRN4CXSZ3D1EW9",
                    "high_descs":[
                        "walk straight towards the door and then turn left and walk towards the wall and turn left then turn right and walk towards the table then turn right then turn left and turn left again towards the table",
                        "pick up the keys on the table on the left side",
                        "turn left towards the chair then turn left again and walk straight then turn right towards the lamp",
                        "turn the lamp light on"
                    ],
                    "task_desc":"pick up the keys on the table and view them in the lamp light",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_37Q970SNZHZXCQJ4PYIO8O6K8QP1SK",
                    "high_descs":[
                        "Take a left at the door, head left at the wall, turn right towards the glass coffee table, turn left and walk to the side of the glass coffee table.",
                        "Pick up the left set of keys in front of the statue on the table.",
                        "Turn around and walk to the tall lamp in the corner next to the chair.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a tall lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3R3YRB5GRIU9LRO8AM6HYQHBXHKAU1",
                    "high_descs":[
                        "walk to face coffee table",
                        "pick up keys from table",
                        "walk to face floor lamp",
                        "turn on floor lamp"
                    ],
                    "task_desc":"turn on floor lamp with keys in hand",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-223/trial_T20190909_110125_428516/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2TBXASXZIRNNW_32AT8R96GO0DLNA2RMS8JQBHJOWUSO",
                    "high_descs":[
                        "Walk over to the couch.",
                        "Grab the left keys.",
                        "Walk over to the lamp.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Grab the keys and turn the lamp on.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3FE7TXL1LLESOVMNGYTXI71OI85Q2O",
                    "high_descs":[
                        "Walk to the white couch ahead.",
                        "Pick up the left set of keys on the couch.",
                        "Turn right, hang a right at the wall and walk to the tall lamp in the corner next to the chair.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a tall lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3NXNZ5RS1DOTIX2758Z6S3S7JOQ974",
                    "high_descs":[
                        "Walk forward to the couch.",
                        "Pick up the leftmost key chain from the couch.",
                        "Turn right and walk to the tv stand, then turn right and walk to the lamp in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a key chain under the light of a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-CreditCard-None-FloorLamp-223/trial_T20190909_105959_767390/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_3SLE99ER0Q4VQ0NAMN5LATGWHIRZBJ",
                    "high_descs":[
                        "Walk around the kitchen table to the far side of the room to reach the long white couch.",
                        "Pick up the credit card from the couch.",
                        "Turn and walk to the corner to the tall lamp.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Look at a credit card under a lit tall lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3UWN2HHPU1W0QXQTULGM5VJNBSBNSX",
                    "high_descs":[
                        "Head to the white couch in the other room.",
                        "Pick up the blue credit card on the couch. ",
                        "Turn right, bring the credit card to the lamp on the floor in the corner, right of the TV.",
                        "Turn on the tall lamp in the corner."
                    ],
                    "task_desc":"Examine a credit card by the light of a tall lamp. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3FIUS151DYTRQ00GCH9AQXRNM5UGGX",
                    "high_descs":[
                        "walk to face couch",
                        "pick up credit card from couch",
                        "walk to face floor lamp",
                        "turn on floor lamp"
                    ],
                    "task_desc":"turn on floor lamp while holding credit card",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "FloorLamp"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-223/trial_T20190908_163723_604442/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_32KTQ2V7RG6C309U9E1VBLPXE1VM9E",
                    "high_descs":[
                        "Turn around completely, walk to the end of the coffee table, make a left, then turn to face the side of the coffee table.",
                        "Pick up the remote control that is sitting on the coffee table. ",
                        "Turn to the left and walk up to the chair closest to you.",
                        "Place the remote control down on the chair."
                    ],
                    "task_desc":"Move a remote control to a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3A1PQ49WVK88MH5OE46P4AZIZ34H1N",
                    "high_descs":[
                        "Turn around and walk forward and around the living room table to face the remote on the opposite side of the living room table.",
                        "Pick up the remote on the living room table.",
                        "Turn left and step forward to face the right side chair.",
                        "Place the remote on the chair on the right."
                    ],
                    "task_desc":"TO move a remote from the living room table to the chair on the right beside the living room table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3B3WTRP3DETMWW51ZWIBWCBZ8WA926",
                    "high_descs":[
                        "Turn around and cross the room and turn left to face the coffee table with the box on it.",
                        "Pick the remote up from the table.",
                        "Go left and face the gray chair on the right.",
                        "Put the remote on the chair."
                    ],
                    "task_desc":"Put a remote on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-223/trial_T20190908_163700_012593/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_3C6FJU71TTKAH9MBQSKX1CZI0X6UYS",
                    "high_descs":[
                        "turn to the right and take a few steps and turn to the left and take a few steps and go to the TV",
                        "pick up the remote control from the bottom shelf of the TV stand",
                        "turn to the right and step to the chair ",
                        "put the remote on the left chair"
                    ],
                    "task_desc":"Place a remote control on a chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3IO1LGZLKCOA0S5SH6O0MTX04WE86J",
                    "high_descs":[
                        "Turn right and walk up to the television stand. ",
                        "Pick up the remote control that is on the shelf under the television.",
                        "Turn to the right and walk up to the chair in front of you.",
                        "Place the remote control down on the chair."
                    ],
                    "task_desc":"Move a remote control over to a chair. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A14IPKOBOPID9H_3DI28L7YXD5W27EMO3YJJ7257OV1EC",
                    "high_descs":[
                        "Turn right and go around to the right edge of the coffee table then turn right and go to the television stand",
                        "Pick up the remote from the bottom shelf of the television stand",
                        "Turn right and go to the chair next to the floor lamp",
                        "Put the remote on the chair"
                    ],
                    "task_desc":"Move the remote from the television stand to a chair",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Chair"
            ]
        },
        "train/pick_and_place_simple-RemoteControl-None-ArmChair-223/trial_T20190908_163710_603458/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3BDCF01OG0L7YJZHHESWAP3ZN5NYLA",
                    "high_descs":[
                        "Turn left and walk toward the coffee table, then turn right and walk up to the TV stand",
                        "Pick up the remote from the TV stand",
                        "Turn right and walk up to the left arm chair",
                        "Put the remote on the arm chair"
                    ],
                    "task_desc":"Put the remote on the arm chair",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3N2BF7Y2VTL5I6RD7QPNO2NLXEYHMU",
                    "high_descs":[
                        "Go left and then right to stand in front of the television stand.",
                        "Pick the remote up from the television stand.",
                        "Turn to the right and face the gray chair on the left.",
                        "Put the remote in the chair."
                    ],
                    "task_desc":"Put a remote on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3TS1AR6UQT52J7TK8UZY2ZEIMASF7L",
                    "high_descs":[
                        "Walk over to where the television is on the table.",
                        "Pick up the remote off of the shelf below the table that the television is on.",
                        "Turn right and walk over to the leftmost white chair.",
                        "Put the remote on the back left side of the seat of the chair."
                    ],
                    "task_desc":"Move a remote to the seat of a chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Chair"
            ]
        }
    }
}