{
    "scene_name":"FloorPlan221",
    "trials":{
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-221/trial_T20190909_055949_932969/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_3D3VGR7TA36HLEX6XDW267GLK1R3RJ",
                    "high_descs":[
                        "take a few steps forward and turn to the left and take a step and turn to the right and go to the chair and turn to the right facing a table ",
                        "take the right set of keys from the table",
                        "turn to the right and go to the end of the table and turn to the right and go to the floor lamp",
                        "turn on the floor lamp"
                    ],
                    "task_desc":"Examine a set of keys by the light of a floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3PJUZCGDJ97XIB7QFDRC63O2U1L891",
                    "high_descs":[
                        "take a step, turn left, take a step, turn right, walk across the room, turn right to face white table",
                        "pick up the keys that are on the table",
                        "turn right, walk forward, turn right before table and chairs, walk across to the lamp, hold keys up",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine keys with the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALKQPW0O9C98N_3R6P78PK7N2VV5MMWH8HPG6CCRSTGT",
                    "high_descs":[
                        "Head toward the chair and go to the white table on the right",
                        "Pick up the set of keys on the right",
                        "Turn right and take a left at the table and go to the standing lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine keys by the light of a lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-221/trial_T20190909_060027_710921/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_33SA9F9TR0LP38UPLRN4CXSZ34BEW1",
                    "high_descs":[
                        "Turn left at the yellow chair, hang a left at the windows and walk to the gray couch on the right.",
                        "Pick up the set of keys from the left side of the couch next to the green pillow.",
                        "Turn left and walk to the tall lamp next to the couch on the right.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a tall lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3Y54SXRO1OCE0NNHGMXYTV73LYEUTZ",
                    "high_descs":[
                        "Turn left and walk to the couch then turn left and walk to the end of the couch with the green blanket.",
                        "Pick up the keys from the couch.",
                        "Walk to the lamp at the end of the couch.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at keys under the light of a lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3AWETUDC95J5D81GSXX2WGK9CZIZIH",
                    "high_descs":[
                        "walk to face left side of couch",
                        "pick up keys from couch",
                        "walk slightly left to face floor lamp",
                        "turn on floor lamp"
                    ],
                    "task_desc":"turn on floor lamp with keys in hand",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-CreditCard-None-FloorLamp-221/trial_T20190909_032534_513559/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3K6DL4PN98CBN_3IFS6Q0HJLA8CWF2X53U0NN6PKNIS0",
                    "high_descs":[
                        "Turn to your right and walk around the brown lamp to face the coffee table in front of the couch. ",
                        "Pick up the credit card on the coffee table next to the remote. ",
                        "Turn to your right and walk back to the lamp beside the couch. ",
                        "Turn on the lamp "
                    ],
                    "task_desc":"Find your credit card and turn on the den lamp ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3RANCT1ZVI8E41T0G06DT11HFREUB9",
                    "high_descs":[
                        "Turn around to walk to the white coffee table.",
                        "Pick up the credit card on the white coffee table.",
                        "Turn around to face the tall lamp.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Look at a credit card under a tall lit lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3Z7VU45IP18UD25IKQCW4H3NVXAZ1S",
                    "high_descs":[
                        "Turn right at the white table, hang a right at the couch and walk to the front of the white coffee table on the right.",
                        "Pick up the blue credit card to the left of the remote on the coffee table.",
                        "Turn right and walk to the tall lamp next to the couch on the right.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a credit card by the light of a tall lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-Box-None-FloorLamp-221/trial_T20190908_063823_792284/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_3EJJQNKU9UMOUXI7GQWN9FXT9FVHRB",
                    "high_descs":[
                        "Turn around and walk forward to the empty box on the table.",
                        "Pick up the box from the table.",
                        "Turn right and walk forward to the front of the floor lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine an empty box by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A10AVWALIHR4UQ_3LRLIPTPETQNX6XYK0DYRHOB1SLKAK",
                    "high_descs":[
                        "Turn around and move past the laptop on the coffee table, then turn left and face the end of the table with four chairs.",
                        "Pick up the cardboard box to the right of the remote control.",
                        "Turn right, move to the floor lamp between the door and the gray couch, then face the lamp shade.",
                        "Turn on the floor lamp."
                    ],
                    "task_desc":"Examine a cardboard box using the light from a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3PW9OPU9PT1WM2G8ZBE1GK9EGY112Z",
                    "high_descs":[
                        "Turn around and go to the dining table.",
                        "Pick up the box from the table.",
                        "Turn right and go to the lamp in front of you",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine the box by the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-SideTable-221/trial_T20190908_090523_517361/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3C44YUNSI4GURTJODAYPEL2IAORPDU",
                    "high_descs":[
                        "Turn right and walk across the room to face the couch.",
                        "Pick up the keys on the couch.",
                        "Turn around and walk around to face the right side of the living room table.",
                        "Place the keys on the plate on the living room table.",
                        "Pick up the plate with the keys on it on the living room table.",
                        "Turn right and walk over towards the TV and face the table on the left side of the TV.",
                        "Place the plate with keys on it on the table to the left of the TV."
                    ],
                    "task_desc":"To put a plate with keys on it on the table to the left of the TV.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3IAEQB9FMHBKB2GPPWCK6FAE3L1DWK",
                    "high_descs":[
                        "Go to the couch",
                        "Pick up the keys",
                        "Go to the white center table",
                        "Put the keys on the plate",
                        "Pick up the plate",
                        "Go to the white table next to the TV",
                        "Put the plate down on the table"
                    ],
                    "task_desc":"Plate keys and put them next to the TV",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3RWE2M8QWK10PO6HLJX2VPD4GJE0NB",
                    "high_descs":[
                        "Move forward toward the table, then turn left and go around the coffee table, then turn left to face the couch.",
                        "Pick up the keys on the couch.",
                        "Turn left, move forward, then turn left and face the end of the coffee table.",
                        "Put the keys on the plate, on the coffee table.",
                        "Pick up the plate from the coffee table.",
                        "Turn right, move forward, then turn left to go toward the yellow chair, then turn right to face the white table.",
                        "Put the plate on the white table."
                    ],
                    "task_desc":"Put a plate with keys on it on the white table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-SideTable-221/trial_T20190908_090434_438779/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3PJ71Z61R7TF7BN5GSIXRT1UGM419H",
                    "high_descs":[
                        "Turn around and walk across the room, then turn right to face the desk.",
                        "Pick up the keys on the desk.",
                        "Turn around and step forward to face the living room table.",
                        "Place the keys on the plate on the bottom right corner of the living room table.",
                        "Pick up the plate with the keys on it on the bottom right corner of the table.",
                        "Turn around to face the desk.",
                        "Place the plate with keys on it on the desk."
                    ],
                    "task_desc":"To put keys on a plate as well as set them on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3ZV9H2YQQGYMTAESW768T6O2C733W1",
                    "high_descs":[
                        "Turn right and walk forward, then turn right again and walk over to the yellow chair, once there turn right to face the white table.",
                        "Pick up the set of keys off of the white table.",
                        "Turn right and walk forward, then hang a right and walk up to the coffee table.",
                        "Put the set of keys on the closest plate on the white table.",
                        "Pick up the plate with the keys on it off of the coffee table.",
                        "Turn right and walk over to the yellow chair, then turn right to face the white table.",
                        "Put the plate with the keys on it onto the white table in between the statue and blue credit card."
                    ],
                    "task_desc":"Put a plate with keys on it on a white table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_38SKSKU7R4OL8JKCDW6TO19BXJ4ILX",
                    "high_descs":[
                        "Go to the white table next to the TV",
                        "Pick up the keys",
                        "Go to the center table",
                        "Put the keys on the closer plate",
                        "Pick up the plate",
                        "Go to the white table next to the TV",
                        "Put the plate on the table"
                    ],
                    "task_desc":"Put keys on a plate and return them to a table",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-RemoteControl-None-FloorLamp-221/trial_T20190909_102109_109171/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2DN53DIE3049T_39PAAFCODPRED2CHLC73PH9MZDEVTW",
                    "high_descs":[
                        "Turn around, walk to the couch behind you",
                        "Pick up the remote from the couch",
                        "Turn left, walk to the light that the on the left of the couch",
                        "Use the remote to turn the light on"
                    ],
                    "task_desc":"Use the remote to turn the light on",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3DZQRBDBSO6TMTXJC2W7WHLH6BNS3P",
                    "high_descs":[
                        "walk to face couch",
                        "remove remote from couch",
                        "walk to face floor lamp",
                        "turn on floor lamp"
                    ],
                    "task_desc":"turn on floor lamp with remote in hand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A22ON3MIIG0IJA_3WLEIWSYHR8FB2NKX8639T9NRLC2H7",
                    "high_descs":[
                        "Turn around and walk to the blue couch on the other side of the room.",
                        "Pick up the remote control from the couch.",
                        "Step to the left to face the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a remote control under the light of a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "FloorLamp"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-CoffeeTable-221/trial_T20190906_185419_750853/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3DI28L7YXDVOHISOSV92ILI3CSVE1Z",
                    "high_descs":[
                        "walk over to the white table in the living room",
                        "grab the keys off of the table",
                        "walk over to the smaller white table next to the television",
                        "put the keys on the plate on the table",
                        "grab the plate with the keys on it",
                        "walk over to the white coffee table in between the TV and the couch",
                        "place the plate down on the table there"
                    ],
                    "task_desc":"place a plate with keys down on the coffee table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3T111IHZ5H7VFR0OIE8VWYZ5PTI9RP",
                    "high_descs":[
                        "Go to the lamp then turn left and move to the white table",
                        "Grab the keys on top of the table to the left of the box",
                        "Turn left and head straight towards the white coffee table then turn left to the yellow chair",
                        "Turn right towards the white side table",
                        "Place the keys on the round brown tray that was on the white side table",
                        "Turn right and carry the tray straight to the white coffee table",
                        "Place the tray on top of the coffee table"
                    ],
                    "task_desc":"Locate keys to place them on the tray on top of the coffee table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3JZLYQ606HJJR_3Y5140Z9D0X3EFDC9GAJ4WYT707PIK",
                    "high_descs":[
                        "Move to the white dinner table where you will see a brown box and keys. ",
                        "Pick up the keys that are on the table. ",
                        "Move across the room to the small white desk with drawers by the TV. ",
                        "Pick up the gold plate that is on the desk. ",
                        "Put the keys on the plate. ",
                        "Carry the plate to the long, low table on the green rug.",
                        "Put the plate with the keys on the table. "
                    ],
                    "task_desc":"Putting the keys where they belong. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-CoffeeTable-221/trial_T20190906_185438_727520/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3TAYZSBPLOPWGMF2CUTLCLWN5N2S2B",
                    "high_descs":[
                        "Turn right and walk until you're past the table on your right then walk to the wall then turn right and walk to the other wall then turn right.",
                        "Pick up the car keys to the left of the remote.",
                        "Move to the opposite side of the table so you are looking at the table.",
                        "Put the keys on the plate near the laptop.",
                        "Pick up the plate with the keys on it.",
                        "Walk to the tv and face it then turn around so you are facing a white coffee table.",
                        "Put the plate on the table near the edge to the left of the table."
                    ],
                    "task_desc":"Put a plate with car keys on it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3UN61F00HZ6CE4YCFOVEKIU33WMR51",
                    "high_descs":[
                        "turn around and walk to the white desk",
                        "grab the keys off of the white desk",
                        "turn and walk to the other side of the desk",
                        "place the keys on the plate on top of the desk",
                        "pick up the plate off of the desk",
                        "turn and walk to the white table",
                        "place the plate on top of the white table"
                    ],
                    "task_desc":"place a place with keys on it on top of the white table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3WSELTNVR6JM0PNLE9RQS8B7JWRATC",
                    "high_descs":[
                        "Go forward, then around white dining table to opposite side",
                        "Pick up keys from table",
                        "Go around table to opposite side by gold plate",
                        "Place keys on gold plate",
                        "Pick up plate with keys",
                        "Go to white coffee table sitting on a green rug, to side closest to the television",
                        "Place plate with keys on coffee table"
                    ],
                    "task_desc":"Move key to plate, plate to coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-CoffeeTable-221/trial_T20190906_185334_837088/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_384PI804XVIPKCCOX7P7TX388VVS0G",
                    "high_descs":[
                        "Turn around, walk past the coffee table then make a left, then turn left and face the short side of the coffee table.",
                        "Take the keys next to the remote control from the coffee table.",
                        "Turn around go straight to the wall, turn left and face the table.",
                        "Put the keys on the plate on the table.",
                        "Take the plate from the table.",
                        "Turn left, go straight, at the coffee table turn right, go between the TV and the coffee table and face the coffee table.",
                        "Put the plate in between the remote control and the vase on the coffee table."
                    ],
                    "task_desc":"Put a plate with keys on it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3MHW492WW3U2FI0ZG7HA2HUSAWMVMJ",
                    "high_descs":[
                        "Turn around and walk over to the far end of the coffee table.",
                        "Look down and find the keys on the coffee table, then pick them up.",
                        "Turn around and walk over to the plate that is on the  white table.",
                        "Place the keys on the plate.",
                        "Pick up the plate with the keys on it.",
                        "Turn left and walk over to the side of the coffee table across from the couch.",
                        "Place the plate with keys on it onto the coffee table in front of the left most laptop."
                    ],
                    "task_desc":"Place a plate with keys on it onto the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3WS1NTTKE1TGG772RNP8MYKTJZOF0V",
                    "high_descs":[
                        "Turn around and walk until you are past the coffee table on your left then turn left and walk a step the turn left again so you are facing the white coffee table with two laptops on it.",
                        "Pick up the car keys.",
                        "Turn left and walk a step then turn left and walk to the wall then turn left..",
                        "Put the keys on the plate. on the right side of the table in front of you.",
                        "Pick up the plate with the keys on it.",
                        "Walk to the tv so you are facing it then turn around to face the coffee table with laptops on it.",
                        "Put the plate on the table in front of the laptop to the left of the other laptop."
                    ],
                    "task_desc":"Put a plate with car keys on it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190909_060010_825835/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left, take a left at the small white table and walk to the yellow chair.",
                        "Pick up the set of keys from the back of the chair in the middle.",
                        "Turn around, hang a right at the white table and walk to the tall lamp.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a tall lamp."
                },
                {
                    "high_descs":[
                        "Turn to the left, walk past the white coffee table, towards the white table against the wall, then turn left until you are facing the green chair.",
                        "Pick up the set of keys that are on the back cushion of the green chair.",
                        "Turn around and walk between the tv and white coffee table, turn left at the white desk, then walk forward until you are standing in front of the tall floor lamp and lift the keys up to the shade. ",
                        "Turn on the floor lamp."
                    ],
                    "task_desc":"Examine a set of keys under the light of a tall floor lamp."
                },
                {
                    "high_descs":[
                        "Turn left and walk to the small white end table then turn left and walk to the chair.",
                        "Pick up the keys that are on the chair.",
                        "Turn around and walk to the table then turn right and walk to the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Inspect keys by lamp light."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        }
    }
}