{
    "scene_name":"FloorPlan329",
    "trials":{
        "train/pick_and_place_with_movable_recep-Pen-Mug-SideTable-329/trial_T20190908_011830_889238/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3A9AA95ATZ3R2RIX2WRPFNUO3PK5PW",
                    "high_descs":[
                        "Turn right and walk around the bed, veering right to the far end of the black table.",
                        "Pick up the pen behind the black mug.",
                        "Put the pen in the mug.",
                        "Pick up the mug.",
                        "Turn right and walk to the wall, then turn right again and go to the night stand to the left of the bed.",
                        "Place the mug on the front left corner of the table."
                    ],
                    "task_desc":"Place a mug with a pen in it on a night table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1O3TWBUDONVLO_3PH3VY7DJOEFTEZNL6C0WL9FXLMWZG",
                    "high_descs":[
                        "Walk to the opposite corner of the room to face the left side of the desk.",
                        "Pick up the middle pen on the left side of the desk.",
                        "Put the pen in the cup on the left side of the desk.",
                        "Pick up the cup with the pen in it on the desk.",
                        "Turn right and walk across the room, then turn right and cross the room and then turn right to face the night stand to the left of the bed.",
                        "Place the cup with a pen in it on the night stand."
                    ],
                    "task_desc":"Place a pen in a cup and put in on the night stand on the left side of the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3XIQGXAUMFPBY4Y7CGG37KUNWST7X2",
                    "high_descs":[
                        "turn around and head towards the  table",
                        "pick up the pen",
                        "drop the pen inside the mug",
                        "pick up the mug",
                        "turn around and head for the bed table",
                        "drop the mug on the bed table"
                    ],
                    "task_desc":"drop a mug with a pen in it on the table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-SideTable-329/trial_T20190908_033435_139611/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_34Z02EIMIVUQZCP3M7UX32ZUBLDT0P",
                    "high_descs":[
                        "Turn left and take a step then turn right and walk to the box to your right then turn left and walk to the wall then turn left and walk to the night stand.",
                        "Pick up the pen that's near the alarm clock.",
                        "Turn around and walk past the bed then turn right and walk almost to the laptop then turn left and walk to the desk.",
                        "Put the pen in the mug in front of you.",
                        "Pick up the mug with the pen in it.",
                        "Turn right and walk to the wall then turn right and walk to the night stand.",
                        "Put the mug to the left of the pen."
                    ],
                    "task_desc":"Put a mug with a pen in it on the night stand.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3IKZ72A5B7XJ13Z9STR6XAG6S5VFNT",
                    "high_descs":[
                        "Move to the corner of the room to the right o the bed where the night stand is",
                        "Pick up the pen behind the clock on the night stand",
                        "Carry the pen to the back of the room where the white and grey table is ",
                        "Place the pen inside of the black coffee mug on the table",
                        "Pick up the black coffee mug with the pen in it on top of the table",
                        "Carry the black mug with the pen in it to the night stand",
                        "Place the mug with the pen on top of the night stand behind the pencil"
                    ],
                    "task_desc":"Move a pen in a mug to the night stand",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALKQPW0O9C98N_3PQMUDRV7UNBXTQ8WLKZVZXHMYEIIS",
                    "high_descs":[
                        "Go around the bed to the bedside table by the wall",
                        "Pick up the pen on the table",
                        "Turn around and walk to the desk",
                        "Put the pen in the coffee cup",
                        "Pick up the pen and coffee cup",
                        "Turn right and walk to the bedside table nearest the door",
                        "Place the pen and cup on the table"
                    ],
                    "task_desc":"Put a pen and cup on a bedside table.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-SideTable-329/trial_T20190908_033459_623204/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3HQUKB7LNIVB5344KLKTVBVNM7QHH9",
                    "high_descs":[
                        "Walk passed the bed, turn left towards the middle of the bed and then turn right towards the desk.",
                        "Pick up the right white pen on the desk.",
                        "Place the pen in the black up on the desk.",
                        "Pick up the cup with the pen.",
                        "Turn left, walk towards the window, and then turn left towards the bedside table.",
                        "Place the cup to the left of the alarm clock."
                    ],
                    "task_desc":"Place a black cup with a pen on the bedside table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AU34T9OMHN4Z4_3IQ1VMJRYW13GAE7G3M918AVQZBA9K",
                    "high_descs":[
                        "Go forward before turning left between the desk and bed and turning right towards the desk",
                        "Pick up the pen to the right and above the pencil on the desk",
                        "Place the pen in the mug that is to the right of the phone",
                        "Pick up the mug with the pen inside it",
                        "Turn around and go between the bed to the left and the wall to the right towards a small nightstand ",
                        "Place the mug with the pen on the side table to the right of the bed and to the left of the clock"
                    ],
                    "task_desc":"Placing a mug with a pen on a nightstand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3QBD8R3Z240RL82W9RV0LVJKTO8O48",
                    "high_descs":[
                        "Walk ahead to the black desk.",
                        "Pick up the pen to the right of the other pen.",
                        "Place the pen in the black mug.",
                        "Pick up the mug.",
                        "Turn around and veer right to the nightstand to the right of the bed.",
                        "Place the mug on the nightstand to the left of the alarm clock."
                    ],
                    "task_desc":"Place a mug with a pen in it on a night table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Drawer-329/trial_T20190909_002000_414199/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_3YDGXNSEO2LWL51EYIVLPVDM85S84I",
                    "high_descs":[
                        "Turn left then face the bed to your right.",
                        "Take the phone off of the bed in front of you.",
                        "Face the cabinet next to the bed on your left.",
                        "Place the phone inside the cabinet and close it.",
                        "Turn around and face the lap top to your right.",
                        "Take the phone off the bed next to the lap top in front of you.",
                        "Turn left then face the cabinet next to the bed to your right.",
                        "Place the phone in the cabinet in front of you and close it."
                    ],
                    "task_desc":"Place phone in the cabinet by the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-DiningTable-329/trial_T20190906_203156_360427/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A23HZ18KTCK2DA_39GAF6DQWUH5JTEANLYCIP6PCQGV1A",
                    "high_descs":[
                        "Turn and go to the night stand that has an alarm clock on it.",
                        "Pick up the grey pen that is directly behind the alarm clock on the night stand.",
                        "Put the pen in the coffee mug that is to the left of the alarm clock.",
                        "Pick up the coffee mug that is next to the alarm clock with the pen in it.",
                        "Turn all the way around and go to the dresser.",
                        "Place the coffee mug with the pen in it on the top of the dresser.  Put it to the left of the alarm clock on the dresser."
                    ],
                    "task_desc":"Move the pen with the coffee mug to a new location.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3OWEPKL08CT6MAK3AATU9I3PT6I7N0",
                    "high_descs":[
                        "walk over to the night stand next to the bed",
                        "pick up a white pen off of the night stand",
                        "put the pen inside the black cup on the night stand",
                        "pick up the black cup off of the night stand",
                        "walk over to the computer desk",
                        "place the cup in front of the computer"
                    ],
                    "task_desc":"place a cup with a pen in it in front of the computer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Pen",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pen-Mug-DiningTable-329/trial_T20190906_203225_714252/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_32Q90QCQ1V2QNJEA05FKN0E2L25EKK",
                    "high_descs":[
                        "Turn right, head towards the bed, and then turn left to face the table.",
                        "Pick up the pen beside the lamp on the table.",
                        "Look for the cup on the table.",
                        "Place the pen in the cup on the table.",
                        "Pick up the cup from the table.",
                        "Turn around, walk towards the desk on the other side of the room.",
                        "Place the cup with the pencil in front of the laptop on the desk."
                    ],
                    "task_desc":"Place the cup with a pencil in front of the laptop on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3B2X28YI3ZWLH1H1OAJTC93ZH9KB6M",
                    "high_descs":[
                        "Move to the small table with the lamp.",
                        "Pick up the pen from the table.",
                        "Move to the mug on the table.",
                        "Put the pen in the mug on the table.",
                        "Pick up the mug from the table.",
                        "Bring the mug to the long table. ",
                        "Put the mug on the left side of the table. "
                    ],
                    "task_desc":"Put a mug with a pen in it on the long table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3L4PIM1GQWXAGS8WQQ0BVFSWY6BRYC",
                    "high_descs":[
                        "turn right and walk over to the night stand to the left of the bed",
                        "grab a pen off of the nightstand",
                        "move to the left of the night stand and face it",
                        "place the pen down in a cup on the night stand",
                        "pick up the cup off of the nightstand",
                        "turn right and move over to the desk at the foot of the bed",
                        "place the cup down on the desk there"
                    ],
                    "task_desc":"place a cup with a pen in it down on the desk at the foot of the bed",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Pen",
                "Laptop",
                "Mug",
                "Bed",
                "Pencil"
            ]
        },
        "train/pick_and_place_simple-Pen-None-SideTable-329/trial_T20190907_133455_179363/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AWEPZMK7825JQ_37W3JXSD69PFOOPIPKAHIE0DRCCYWR",
                    "high_descs":[
                        "Turn right and take a step toward the wall, then turn right again to face the table.",
                        "Pick up the pen that is lying on the table.",
                        "Turn left and take a step forward then turn left again and walk to the night stand.",
                        "Put the pen on the night stand. "
                    ],
                    "task_desc":"Move the pen from the table to the night stand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3RYC5T2D76AG7EGVZ34SIOZKVS1PRS",
                    "high_descs":[
                        "Turn right, walk a few feet, then turn right to face the table by the door",
                        "Pick up the white pen near the right edge of the table",
                        "Turn left and walk around the right side of the bed to the side table in the corner",
                        "Put the pen on top of the side table"
                    ],
                    "task_desc":"Put the white pen on the side table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3ZGVPD4G6WYN1XVTQ17P912GTC9TZY",
                    "high_descs":[
                        "Turn right, move forward, turn right, move to the table. ",
                        "Pick up the pen on the table. ",
                        "Turn left, head to the window, turn left, head to the night stand.",
                        "Put the pencil on the night stand. "
                    ],
                    "task_desc":"Put a pencil on the night stand. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_33IZTU6J84IXH2IZ0JEE2BQJJXOXSF",
                    "high_descs":[
                        "Turn right, take a few steps, turn right, stand in front of the table",
                        "Pick up the white pen from the table",
                        "Turn left, head toward the night stand in the corner",
                        "Put the white pen on the night stand"
                    ],
                    "task_desc":"Take the white pen from the table, put it on the night stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3KB8R4ZV1HONEU670NSFO0GOCJFGBE",
                    "high_descs":[
                        "Turn around and walk to the desk which is against the wall.",
                        "Pick up the pen to the right of the cell phone on the desk.",
                        "Turn around and walk to the end table which is on the right side of the bed.",
                        "Put the pen on the front of the end table."
                    ],
                    "task_desc":"Move a pen from a desk to an end table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3KWTYT0873K1B63ZA4YIY6L4Y4K5LD",
                    "high_descs":[
                        "Turn around and face the dresser with the clock on it.",
                        "Pick the pen up from the dresser.",
                        "Turn around and go to stand in front of the night stand to the right of the bed.",
                        "Put the pen down on the night stand."
                    ],
                    "task_desc":"Put a pen on a night stand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Pen"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-SideTable-329/trial_T20190909_013608_170798/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3EF8EXOTT4M4DN0E249AGNFXCWS1JY",
                    "high_descs":[
                        "Turn around completely, walk almost to the wall, then turn right to face the desk. ",
                        "Pick up the alarm clock that is closest to the front of the desk. ",
                        "Turn to the left, walk to the wall, turn to the left again and walk up to the nightstand. ",
                        "Place the alarm clock down on the nightstand between the two CDs."
                    ],
                    "task_desc":"Move an alarm clock to the nightstand. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3N2BF7Y2VTL5I6RD7QPNO2NLXFNHML",
                    "high_descs":[
                        "Turn around then head to the desk top against the wall ",
                        "Pick up the clock on top of the desk",
                        "Carry the clock over to the night stand to the right of the bed",
                        "Place the clock in the night stand between the CDs"
                    ],
                    "task_desc":"Moe a clock to the night stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3PPTZCWALTBIU6PZ552B5IBV360QZ6",
                    "high_descs":[
                        "Turn around and walk to the desk on the right. ",
                        "Pick up the alarm clock to the left of the CD. ",
                        "Turn left, turn left at the window, walk to the night stand to the right of the bed. ",
                        "Put the alarm clock on the night stand in between the two CD's. "
                    ],
                    "task_desc":"Move the alarm clock to the night stand. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-DiningTable-329/trial_T20190909_011821_404731/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A20FCMWP43CVIU_3IQ1VMJRYWBB1Z05CBBQ2UUXKLC9AP",
                    "high_descs":[
                        "walk to face the night stand on the right of the bed",
                        "pick up the clock from the night stand",
                        "walk to the desk at the foot of the bed",
                        "put the clock on the desk"
                    ],
                    "task_desc":"put a clock on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3M1CVSFP63WHTYHRTDMCOPKMUK8QAI",
                    "high_descs":[
                        "Go left and then left again to face the night stand on the right side of the bed.",
                        "Pick the clock up from the night stand.",
                        "Turn around and go to the right and turn to the left to face the white and gray shelves.",
                        "Put the clock down on the top."
                    ],
                    "task_desc":"Put a clock on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3Z7ISHFUH3MCO2P3JBLBJRQV9Z0Z8O",
                    "high_descs":[
                        "Turn around and walk to the window, then turn left and walk to the night stand to the right of the bed.",
                        "Pick up the alarm clock from the night stand.",
                        "Turn around and walk past the bed to the table by the wall.",
                        "Put the alarm clock on the table, in front of the CD near the pencils."
                    ],
                    "task_desc":"Move an alarm clock from a night stand to a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "AlarmClock",
                "Book"
            ]
        },
        "train/pick_and_place_simple-AlarmClock-None-DiningTable-329/trial_T20190909_011727_722798/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A13OOAT2ORKH6V_3137ONMDKJWT6M4P6MJMQU6B9D8GEL",
                    "high_descs":[
                        "Walk to the night stand to the right of the bed and look down.",
                        "Pick up the alarm clock on the night stand and look up.",
                        "With the alarm clock, turn around and walk straight to the desk against the wall.",
                        "Place the alarm clock between the keys and cup on the desk."
                    ],
                    "task_desc":"Place an alarm clock on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3SKRO2GZ74IZO76WKP9MH2FARLQ1KV",
                    "high_descs":[
                        "Turn right and walk all the way around the night stand on the opposite side of the bed",
                        "Pick up the alarm clock from the night stand",
                        "Turn around and walk forward to the shelf",
                        "Put the alarm clock on top of the shelf"
                    ],
                    "task_desc":"Put the alarm clock on top of the shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3Z7EFSHGNC5PVAF1Z5DVOS63RRUXC4",
                    "high_descs":[
                        "Turn right, walk a few steps, turn left, walk to the wall, then turn left and walk up to the nightstand.",
                        "Pick up the alarm clock that is on the nightstand. ",
                        "Turn around completely, walk to the end of the bed, turn right, then turn left and walk up to the table. ",
                        "Place the alarm clock down on the table. "
                    ],
                    "task_desc":"Move an alarm clock to the table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "train/pick_and_place_simple-CD-None-SideTable-329/trial_T20190908_002246_523800/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_32VNZTT0AALUILUC1JC4FQOP4A24R5",
                    "high_descs":[
                        "turn around, walk to the cabinet",
                        "grab the disc on the cabinet",
                        "turn around, walk to the night stand",
                        "put the disc on the night stand"
                    ],
                    "task_desc":"move the disc from the cabinet to the night stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3UN61F00HZ6CE4YCFOVEKIU346C5RQ",
                    "high_descs":[
                        "Move across the room to the white and grey desk",
                        "Pick up the CD on top of the desk",
                        "Carry the CD to the night stand to the right of the bed",
                        "Place the CD on top of the night stand in front of the phone"
                    ],
                    "task_desc":"Place a CD on the night stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3Y9N9SS8L1SFZFS3J4C10WFFB9D3DB",
                    "high_descs":[
                        "Turn around and walk towards the desk.",
                        "Pick up the CD at the top left corner of the desk.",
                        "Turn around and walk towards the bedside table.",
                        "Place the CD in front of the cell phone on the table."
                    ],
                    "task_desc":"Transfer the CD from the desk to the bedside table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CD-None-SideTable-329/trial_T20190908_002233_981326/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3SFPSMFRSRTB3_32XVDSJFP2ETIR2XSXXZ0CXHEBYM2Y",
                    "high_descs":[
                        "Turn around, move slightly to the left and proceed to the table.",
                        "Remove the left cd, closest to the lower alarm clock.",
                        "Turn left, proceed to window.  Turn left, proceed to nightstand.",
                        "Place cd on left side of nightstand to the left of the pen and pencil."
                    ],
                    "task_desc":"Move cd from table to nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3L4PIM1GQWXAGS8WQQ0BVFSWZDVYRI",
                    "high_descs":[
                        "Turn right and walk to the bed then turn right and walk just past the bed then turn left and walk until you're even with the table to your right and when you are turn right and walk to it.",
                        "Pick up the cd farthest to the left.",
                        "Turn left and walk to the wall then turn left and walk to the nightstand.",
                        "Put the cd on the nightstand to the left of the pencil on the bottom edge."
                    ],
                    "task_desc":"Put a cd on the nightstand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3P4RDNWND8N7S4AEE35Z70CHZD1IJ2",
                    "high_descs":[
                        "Move to the white table opposite of the foot of the bed with the CD on top of it",
                        "Pick up the CD on top of the table",
                        "Carry the CD to the brown night stand to the right of the bed",
                        "Place the CD on the front left corner of the night stand"
                    ],
                    "task_desc":"Move a CD to the night stand",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-DiningTable-329/trial_T20190909_013555_714877/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1SX8IVV82M0LW_33NF62TLXMT6JOM0AEFSL2BWL1HJK6",
                    "high_descs":[
                        "Walk to the nightstand on the left of the bed.",
                        "Grab a card from the nightstand.",
                        "Go to the dresser in front of the bed.",
                        "Place the card on the dresser."
                    ],
                    "task_desc":"Move a card from the nightstand to the dresser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3QXNC7EIPLMF0M2NK9EXDOIKBYU09H",
                    "high_descs":[
                        "Walk over to the wooden nightstand that is to the left of the bed.",
                        "Pick up the leftmost credit card off of the nightstand.",
                        "Turn around and walk forward, then hang a left and walk towards the windows, then turn right to face the table.",
                        "Put the credit card on the table to the left of the closest disc."
                    ],
                    "task_desc":"Move a credit card to a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3Y54SXRO1OCE0NNHGMXYTV73LU0TUC",
                    "high_descs":[
                        "Turn right, walk across the room past the bed, then turn right and walk to the night stand to the left of the bed.",
                        "Pick up the credit card on the left side of the night stand.",
                        "Turn around and walk forward past the bed to the table against the wall.",
                        "Put the credit card on the table, to the left of the CD and in front of the key chain."
                    ],
                    "task_desc":"Move a credit card from a night stand to a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "Pencil",
                "CreditCard",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-DiningTable-329/trial_T20190909_003233_231673/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ANBWJZYU2A68T_37UQDCYH60MRF4FA8942KLH4A4J7V4",
                    "high_descs":[
                        "Go to the small cabinet at the corner to the right of the bed",
                        "Pick up the card from the top of the cabinet",
                        "Turn around and move across the room to the table",
                        "Put the card on the table"
                    ],
                    "task_desc":"Pick up the card from the cabinet top and put it on the table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_39PAAFCODPRED2CHLC73PH9MZ1AVT4",
                    "high_descs":[
                        "Turn right, walk up to the window, then turn left and walk up to the nightstand.",
                        "Pick up the credit card that is sitting on top of the nightstand.",
                        "Turn around, walk to the end of the bed, make a right, then turn to face the desk.",
                        "Place the credit card down on the desk, to the right of the book."
                    ],
                    "task_desc":"Move a credit card to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3L70J4KAZJDN4PDMORGSOQDNB5KDA1",
                    "high_descs":[
                        "Walk to the night stand on the right side of the bed in front of you.",
                        "Pick up the credit card on the top of the night stand.",
                        "Turn around and walk past the bed to the table that is against the wall.",
                        "Put the credit card on the table, to the right of the book."
                    ],
                    "task_desc":"Move a credit card from a night stand to a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_simple-CreditCard-None-DiningTable-329/trial_T20190909_013611_626994/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_33FOTY3KEPCH59U8SCSOTJ22MCD1CE",
                    "high_descs":[
                        "Turn around and walk to the wall then turn left and walk to the night stand.",
                        "Pick up the credit card that's in front of you.",
                        "Turn around and walk past the bed then turn right and take a step forward then turn left and walk to the small table with three clocks.",
                        "Put the credit card below the phone that's surrounded by three clocks."
                    ],
                    "task_desc":"Put a credit card on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3RU7GD8VPRK0TI26A0TE9KOIBUVSPR",
                    "high_descs":[
                        "Turn around and walk to the small nightstand to the left.",
                        "Pick up the blue credit card from the middle of the nightstand near the back.",
                        "Turn around, hang a right at the bed and turn left to face the table with many clocks to the left.",
                        "Put the blue credit card in front of the cell phone on the left side near the edge of the table."
                    ],
                    "task_desc":"Place a credit card on a table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-DiningTable-329/trial_T20190909_074056_730233/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_3634BBTX0RLZ8RAGRL3VTO4R0U6IFU",
                    "high_descs":[
                        "Turn left at the cardboard box and take a left at the wall to reach the small nightstand next to the bed.",
                        "Pick up the cell phone from the back left corner of the nightstand.",
                        "Turn around, hang a right at the end of the bed and walk to the table on the left.",
                        "Put the cell phone to the right of the laptop computer on the left side of the table."
                    ],
                    "task_desc":"Place a cell phone on a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_388U7OUMFASL4MY9EQEJ49IEHO30RF",
                    "high_descs":[
                        "Turn left walk toward the wall then turn left facing the side table",
                        "Pick up the phone on the side table",
                        "Turn left then head to the desk",
                        "Put the phone on the desk in front of the laptop"
                    ],
                    "task_desc":"Put the phone on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3PZDLQMM0WCOUUC4BGS2Y2C7ELKC25",
                    "high_descs":[
                        "Take a step forward then turn left and walk to the wall then turn left and walk to the night stand.",
                        "Pick up the phone that's in front of you on the night stand to the left of the alarm clock.",
                        "Turn around and walk to the desk with the laptop on it.",
                        "Put the phone on the desk under the laptop."
                    ],
                    "task_desc":"Put a phone on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-Pen-None-SideTable-329/trial_T20190906_203209_061579/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_317HQ483IA93BU1ZT1XR07TY7T6INX",
                    "high_descs":[
                        "Move across the room to the white desk with the black surface. ",
                        "Pick up the black and white pen near the back center of the desk. ",
                        "Turn around and move across room to the small, black night stand on the right side of the bed. ",
                        "Place the pen on the night stand in front of the alarm clock. ",
                        "Move across the room to the white desk with the black surface. ",
                        "Pick up the black and white pen near the black coffee mug.",
                        "Turn around and move across room to the small, black night stand on the right side of the bed. ",
                        "Place the pen on the night stand in front of the alarm clock. "
                    ],
                    "task_desc":"Gather pens from the desk to be place on the night stand by the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "train/pick_two_obj_and_place-Pen-None-SideTable-329/trial_T20190906_203138_714800/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3BWI6RSP7JQ2S47QHBQBJV9GFLOE73",
                    "high_descs":[
                        "Move across the room to the white desk with the black surface.",
                        "Pick up the white and black pen located in the far back left corner of the desk. ",
                        "Move back across the room to the small night stand next to the bed. ",
                        "Place the pen on the night stand.",
                        "Move across the room to the white desk with the black surface.",
                        "Pick up the white and black pen located on the right side of the black mug. ",
                        "Move back across the room to the small night stand next to the bed. ",
                        "Place the pen on the night stand."
                    ],
                    "task_desc":"Gathering pens to move from desk to night stand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "valid_seen/pick_and_place_simple-Book-None-SideTable-329/trial_T20190908_050633_745514/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3C8HJ7UOPABJO259H46DNN7OZR2ZM2",
                    "high_descs":[
                        "turn left, take a few steps, turn right to face bed",
                        "pick up magazine that was on the bed",
                        "turn right, walk forward, turn left after the bed, walk forward to small table",
                        "put magazine on to small table"
                    ],
                    "task_desc":"move a magazine from the bed to the table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3KB8R4ZV1HONEU670NSFO0GOC24GB5",
                    "high_descs":[
                        "go to left end of bed",
                        "pick up book on left, front corner of bed",
                        "go to empty bedside table to the right of bed",
                        "place book on bedside table"
                    ],
                    "task_desc":"Place book on right bedside table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ALKQPW0O9C98N_3LQ8PUHQFO9B1YFOQ32EVNW2MSZIHD",
                    "high_descs":[
                        "Turn left and go to the bottom left edge of the bed",
                        "Pick up the game that is on the bottom left edge of the bed",
                        "Go right and around the bed to the bedside table",
                        "Put the game on top of the table"
                    ],
                    "task_desc":"Move a game from the bed to the bedside table",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Book"
            ]
        },
        "valid_seen/pick_and_place_simple-Mug-None-SideTable-329/trial_T20190909_032340_274147/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_34PGFRQONR2XEOGHZSYV9D5R8D0WJZ",
                    "high_descs":[
                        "Walk ahead and right to the gray table on the right.",
                        "Pick up the mug closest to the long side of the table, facing out.",
                        "Turn around and walk ahead and right to the side table on the right side of the bed.",
                        "Place the mug on the table on top of the CD."
                    ],
                    "task_desc":"Place a CD on a table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3LOZAJ85YG4CXSNZ2COPCFXHF4BX2X",
                    "high_descs":[
                        "Make a right to walk towards the desk.",
                        "Pick up the black mug that is closest to you from the desk.",
                        "Turn around to walk to the nightstand next to the bed.",
                        "Set the black mug down on the nightstand."
                    ],
                    "task_desc":"Move a black mug from the desk to the nightstand.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_323Q6SJS8L7ZCWZWL3LATC3C0I8FHH",
                    "high_descs":[
                        "Walk forward to the laptop on the bed then turn right and walk to the table.",
                        "Pick up the mug that's closest to you on the table in front of you.",
                        "Turn left and walk to the wall then turn left and walk to the night stand.",
                        "Put the mug on the cd."
                    ],
                    "task_desc":"Put a mug on the stand.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "CD"
            ]
        },
        "tests_seen/trial_T20190909_013645_008319/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move right then left to face the clock on top of the desk",
                        "Pick up the clock on top of the desk",
                        "Carry the clock over to the night stand to the right of the bed",
                        "Place the clock on the night stand to the left of the book"
                    ],
                    "task_desc":"Place a clock on the night stand"
                },
                {
                    "high_descs":[
                        "Turn right then face the black table to your left.",
                        "Take the clock off the table in front of you.",
                        "Turn left then face your bed side table on your left.",
                        "Place the clock on top of your bedside table in front of you."
                    ],
                    "task_desc":"Place the clock on the bedside table."
                },
                {
                    "high_descs":[
                        "Turn to your right and walk past the laptop on the table to your left, then face the right end of the table. ",
                        "Pick up the alarm clock to the right of the computer. ",
                        "Turn to your left and go to the window, then turn to your left again and go to the night stand on the right side of the bed. ",
                        "Place the alarm clock on the left side of the night stand, by the bed. "
                    ],
                    "task_desc":"Put the alarm clock on the night stand. "
                }
            ],
            "relative_objects":[
                "AlarmClock"
            ]
        },
        "tests_seen/trial_T20190909_013620_927181/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left, walk to the edge of the bed, turn left again, walk a few steps, then turn right to face the table.",
                        "Pick up the alarm clock that is sitting on the table.",
                        "Turn to the left, walk to the window, then turn left again and walk up to the nightstand.",
                        "Place the alarm clock down on the nightstand, behind the CD."
                    ],
                    "task_desc":"Move an alarm clock to the nightstand."
                },
                {
                    "high_descs":[
                        "Turn left, turn left after the led and turn right to face the right side of the dresser. ",
                        "Pick up the alarm clock to the right of the keys. ",
                        "Turn left, turn left at the window, walk up to the night stand to the right of the bed. ",
                        "Put the alarm clock on the night stand behind the CD. "
                    ],
                    "task_desc":"To move an alarm clock to the night stand. "
                },
                {
                    "high_descs":[
                        "Turn left and walk past the bed then turn left and walk to the middle of that side of the bed then turn right and walk to the small table.",
                        "Pick up the alarm clock that's in front of you.",
                        "Turn left and walk to the wall then turn left and walk to the night stand.",
                        "Put the clock above the cd on the nightstand."
                    ],
                    "task_desc":"Put a clock on the nightstand."
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "Pillow"
            ]
        },
        "tests_seen/trial_T20190907_133507_260131/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Go to the black desk.",
                        "Pick up the pen",
                        "Carry the pen to the black end table beside the bed.",
                        "Set the pen on the front of the end table beside the bed."
                    ],
                    "task_desc":"Move the pen from the Black desk to the black end table that sits beside the bed."
                },
                {
                    "high_descs":[
                        "Turn left, walk to the grey table on the right",
                        "Grab the pen near the door",
                        "Turn left, walk to the window, turn left, walk to the night stand",
                        "Put the pen down on the night stand"
                    ],
                    "task_desc":"Move the pen from the grey table to the night stand"
                },
                {
                    "high_descs":[
                        "Turn to the left and then right to the face the table. ",
                        "Pick up the pen on the right edge of the table. ",
                        "Turn around and walk across the room to the table on the right side of the bed. ",
                        "Place the pen on the edge of the table in front of the alarm clock."
                    ],
                    "task_desc":"To move the pen to the bedside table. "
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "tests_seen/trial_T20190909_074109_560186/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and go past the bed, then turn right and go to the night stand to the left of the bed. ",
                        "Pick up the cell phone to the left of the lamp on the night stand. ",
                        "Turn around and go across the room to the desk across from the bed. ",
                        "Place the cell phone on the desk in between the two pencil's, on the desk ."
                    ],
                    "task_desc":"Put the phone on the desk. "
                },
                {
                    "high_descs":[
                        "Turn around and walk past the bed, then walk right to the end table on the left side of the bed.",
                        "Pick up the cellphone on the table.",
                        "Turn around and walk ahead, veering left to the gray and white table.",
                        "Place the phone on the table to the left of the rightmost pencil."
                    ],
                    "task_desc":"Place a cellphone on a table."
                },
                {
                    "high_descs":[
                        "Turn around completely and go forward. Turn to the right and walk to the nightstand.",
                        "Pick up the cellphone from the nightstand.",
                        "Turn around completely and walk forward. Turn to the left then right to face the desk.",
                        "Place the cellphone on the desk"
                    ],
                    "task_desc":"Move a cellphone to a desk."
                }
            ],
            "relative_objects":[
                "Desk",
                "CellPhone"
            ]
        }
    }
}