{
    "scene_name":"FloorPlan430",
    "trials":{
        "train/pick_two_obj_and_place-DishSponge-None-Cart-430/trial_T20190908_123809_084488/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2YUCJ28XANFOX_3CN4LGXD50FB0BSWBMTFO81O1G04YP",
                    "high_descs":[
                        "Turn to the right and cross over to the counter",
                        "Pick up the sponge sitting on the left ",
                        "Turn to the right and head towards the toilet and then turn left crossing over to the silver shelves",
                        "Place the sponge on the second shelf",
                        "Turn around and go towards the toilet turning left again and crossing the room to the bath tub",
                        "Pick up the sponge sitting in the bath tub",
                        "Turn right and cross the bathroom turning left to go to the silver shelves against the wall. ",
                        "Place sponge on shelf beside the other sponge."
                    ],
                    "task_desc":"Move both sponges to the second shelf ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-Cart-430/trial_T20190907_075716_990340/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_34HJIJKLP8DMBSBTA3HEGNDSP1TV49",
                    "high_descs":[
                        "Turn right and head to the black vanity table.",
                        "Pick up the pink bar of soap to the left of the green sponge on the vanity top.",
                        "Turn around, cross the room, hang a left at the shower to reach the wall and turn right to face the gray sink.",
                        "Put the soap inside the sink, fill with water to rinse it, and pick up the clean bar of soap.",
                        "Turn right, hang a left at the bathtub, walk to the white door and head left to the silver wire rack near the window.",
                        "Place the bar of soap on the lowest steel shelf in the middle behind the two yellow spray bottles."
                    ],
                    "task_desc":"Place a clean bar of soap on a steel shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3X4JMASXCPQQ3QVMML3C38T85YIB0Q",
                    "high_descs":[
                        "Turn right, walk to the counter,.",
                        "Pick up the soap on the counter.",
                        "Turn around, walk straight to the toilet, turn left to face the tub, walk straight to the tub and turn right to face the bathroom sink.",
                        "Place the soap in the sink, run water, turn off the faucet, then pick up the soap in the sink.",
                        "Turn right, walk straight, turn left to face the bathroom door, walk straight, turn left when you reach the door to face the rack.",
                        "Place the clean soap on the rack."
                    ],
                    "task_desc":"Place clean soap on a rack.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3Z7VU45IP1YMSDJKOINF3VJL1T11ZG",
                    "high_descs":[
                        "Turn to your right and walk to the vanity across the room",
                        "Pick up the soap that is sitting on the vanity",
                        "Turn around and take a few steps, then turn left and walk to the sink across the room",
                        "Place the soap in the sink then turn on the sink. Turn off the sink and pick up the soap.",
                        "Walk past the sink to the metal shelf that is on your left",
                        "Place the soap on the middle shelf"
                    ],
                    "task_desc":"Place wet soap on a shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A11LSO6D7BMY99_30JNVC0ORC1OIW373B7N4PNODK6QHE",
                    "high_descs":[
                        "turn right and go to the counter with the kleenex sitting on top",
                        "pick up the pink soap",
                        "turn around face the toilet then go to your left towards the grey sink",
                        "turn the water on place the soap in the sink rinse it off",
                        "take the soap the the wire shelving to the right of the sink",
                        "place the soap on the middle shelf"
                    ],
                    "task_desc":"take rinsed off sink to a shelf and put it there",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_38JBBYETQRR59HP7FDS4GJP6PCYE46",
                    "high_descs":[
                        "Turn to the right and go straight back to the desk.",
                        "Pick up the bar of soap on the desk, beside the sponge.",
                        "Take the bar of soap and turn around. Take a few steps and turn right to find the grey sink. ",
                        "Place the soap in the sink and turn the water on. Turn the water off and pick up the soap.",
                        "Carry the soap and go to the left around the sink, to the metal tower.",
                        "Place the soap on the middle shelf of the tower."
                    ],
                    "task_desc":"Rinse off a bar of soap and place it on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1AKL5YH9NLD2V_3TXMY6UCAH5X1OSRHJTMTYQ80S6CQW",
                    "high_descs":[
                        "Turn right and walk to the pink soap on the counter.",
                        "Pick up the pink soap on the counter.",
                        "Turn around and walk to the gray sink.",
                        "Rinse the soap in the pink and then pick the soap up from the sink.",
                        "Walk to the metal shelf to the left of the blue trash can.",
                        "Place the soap behind the yellow spray bottles on the shelf."
                    ],
                    "task_desc":"Place a rinsed bar of pink soap behind the yellow spray bottles on the shelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "SprayBottle",
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-Cart-430/trial_T20190907_075738_959822/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A13OOAT2ORKH6V_3NC5L260MR31JOZLT8RJCZGBITAFOA",
                    "high_descs":[
                        "Turn around, walk straight to the wall, then turn left to face rack.",
                        "Look down the rack to grab the soap on top of the rack.",
                        "Turn left to walk straight, walk straight, make a quick left, then turn right, walk straight to the tub, turn right when you reach the tub, turn around to face the sink.",
                        "Place the soap in the sink, run the water, turn the water off, and grab the soap from the sink.",
                        "Turn right, walk straight, turn left to face the bathroom door, walk straight, turn left when you reach the door to face the rack.",
                        "Place the clean soap on the rack."
                    ],
                    "task_desc":"Place the clean soap on the rack.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3PQ8K71NH01HLTOC8909X3LFWUOAAK",
                    "high_descs":[
                        "turn right and walk until the bathroom towel rack is on your left, then turn towards the towel rack and walks to it",
                        "grab a bar of soap out of the top rack of the towel holder rack",
                        "turn left and walk over to the bathtub at the end of the room, then turn right and walk to the wall, then one more right turn to face the left side of the sink",
                        "rinse off the soap in the sink",
                        "turn right and walk forwards a bit to be center with the tub, then take a left and walk to the end of the room, then another left to stand in front of the towel rack",
                        "place the soap back on the top shelf of the towel rack"
                    ],
                    "task_desc":"place a clean bar of soap on the towel rack",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_31T4R4OBOVXNV6NCLKKGT79DVR2C70",
                    "high_descs":[
                        "Head towards the metal rack in front of you.",
                        "Pick up the top bar soap on the rack. ",
                        "Turn left and head towards the sink.",
                        "Place the soap in the sink, wash it, and pick it back up.",
                        "Take a step to the right towards the metal rack.",
                        "Place the bar soap on the second to top shelf on the rack."
                    ],
                    "task_desc":"Wash the top bar soap on the metal rack.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-SoapBar-None-Cart-430/trial_T20190907_075807_163356/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3ERET4BTVPQ9SNNTSUZYVMDRVWXK97",
                    "high_descs":[
                        "Turn right, then turn left and head to the rack",
                        "Pick up the soap on the first level of the rack",
                        "Turn to your left and head to the sink",
                        "Put the soap on the sink then rinse it and pick it up",
                        "Turn to your right and go back to the rack",
                        "Put the soap on the second level of the rack"
                    ],
                    "task_desc":"Put clean soap on the rack",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3IUZPWIU1ROK4J01L59Q96L2TXZKWE",
                    "high_descs":[
                        "Move to the silver rack to the right of the sink.",
                        "Pick up the soap from the rack.",
                        "Move to the left side of the sink to the left of you.",
                        "Place the soap in the sink and run some water before turning off the water and picking up the soap.",
                        "Move to the silver rack to the right of the sink.",
                        "Place the soap on the silver rack."
                    ],
                    "task_desc":"Put a wet bar of soap from the silver rack on the silver rack.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3URFVVM168Z21AAIQ6XZEXOICQNUZX",
                    "high_descs":[
                        "walk to the right a bit",
                        "grab the pink bar on the shelf",
                        "walk to the left a little",
                        "put the pink bar in the sink, wash it with water, take it out",
                        "turn right, walk back to the shelf",
                        "put the pink bar on the third shelf"
                    ],
                    "task_desc":"wash the pink bar from the shelf, put it back on the shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AUTYWXILTACCR_3DBQWDE4Y9FRZ66KMHEXBYPT31EN5V",
                    "high_descs":[
                        "Turn to your right, walk, and then turn left to reach the metal shelf.",
                        "Pick up a bar of soap from the top shelf.",
                        "Walk over to the sink.",
                        "Wash the soap in the sink.",
                        "Walk back over to the metal shelf. ",
                        "Put the soap on the middle shelf. "
                    ],
                    "task_desc":"Place a washed bar of soap on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3OS4RQUCRCWH0UACP3MX6FGCB5QBFN",
                    "high_descs":[
                        "Head across the room to the metal shelf that is to the right of the sink",
                        "Pick up the soap that is on the top shelf",
                        "Turn left and walk to the bathtub, then turn around and face the side of the sink",
                        "Place the soap into the sink and turn on the water. Turn off the water then pick up the soap",
                        "Head to the metal shelf that is on the other side of the sink",
                        "Place the soap on the second shelf"
                    ],
                    "task_desc":"Place a wet bar of soap on a shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3VFJCI1K42GAU1NWWKE5OFLSU8LRGB",
                    "high_descs":[
                        "Turn right and walk over to the rack.",
                        "Pick up the soap from the rack.",
                        "Turn left and walk to the far side of the sink.",
                        "Put the soap in the sink and fill it up with water.",
                        "Take the soap back to the rack.",
                        "Put the soap back on the rack."
                    ],
                    "task_desc":"Rinse of the soap.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-Drawer-430/trial_T20190908_122230_051247/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A14IPKOBOPID9H_33PPO7FECY62A7WK0F855O16O93IDG",
                    "high_descs":[
                        "Turn to the right and head towards the shower then turn right and go to the counter",
                        "Pick up the middle sponge from the counter",
                        "Turn around and go halfway to the toilet then turn left and go past the bathtub then turn right and go to the sink",
                        "Put the sponge in the sink and turn on the water",
                        "Pick up the sponge and turn right and head to the shower then turn right and go to the counter",
                        "Put the sponge in the bottom drawer of the counter"
                    ],
                    "task_desc":"Put a clean sponge in the bottom drawer of the counter",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3QL2OFSM999KJG1XXZQMQQF5P8YNCE",
                    "high_descs":[
                        "Turn around and walk to the counter. ",
                        "Pick up the green sponge that is in the middle. ",
                        "Turn around and take two steps, then turn left and walk across the room, then turn right. ",
                        "Put the sponge in the sink and turn on the faucet for three seconds, then turn the faucet off and pick up the sponge. ",
                        "Turn to the right and walk across the room, then turn to the right and walk across the room. ",
                        "Open the bottom drawer of the table and put the sponge inside. "
                    ],
                    "task_desc":"To wash the sponge. ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3ZGVPD4G6W8VMMHRM9W6ANMIN8DTZR",
                    "high_descs":[
                        "Walk to the kitchen counter behind you.",
                        "Grab the middle sponge from the counter.",
                        "Walk to the kitchen sink on your left.",
                        "Put the sponge in the sink, wash it, then take it out of the sink.",
                        "Walk to the kitchen counter again on your left.",
                        "Put the sponge in the bottom drawer."
                    ],
                    "task_desc":"Wash a sponge and put it back in a drawer.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge",
                "Drawer"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-Drawer-430/trial_T20190908_122202_842520/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A32W24TWSWXW_31QNSG6A5UKT4SJX0GTSS7XWZ2687G",
                    "high_descs":[
                        "Turn left and take four steps, turn right for one step, then turn left to face the tub.",
                        "Pick up the scrub sponge that is to the left of the two sponges nearest the drain.",
                        "Turn right for one step; turn right again to face the sink.",
                        "Put the sponge in the sink, standing vertically with the green side to the right, turn the water on for a few seconds and turn off, then pick up the sponge when the water has drained.",
                        "Turn right and take nine steps, take another right and walk to the black and white desk. ",
                        "Open the bottom drawer on the left, place the sponge lying down on the far left with the green side up. Close the drawer."
                    ],
                    "task_desc":"Put a cleaned scrub sponge in the bottom drawer of a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_323Q6SJS8L7ZCWZWL3LATC3C093HFW",
                    "high_descs":[
                        "Turn left and walk up to the bathtub",
                        "Pick up the far left green sponge from the bathtub",
                        "Turn around and go up to the side of the sink",
                        "Wash the sponge under water in the sink and remove it",
                        "Turn right and go forward, then turn right again and approach the vanity",
                        "Open the bottom vanity drawer and put the sponge in it"
                    ],
                    "task_desc":"Put the cleaned sponge in the bottom drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3C6FJU71TTKAH9MBQSKX1CZI0RIYUW",
                    "high_descs":[
                        "Turn left and walk to the tub.",
                        "Pick up the sponge in the back.",
                        "Turn around and face the sink.",
                        "Put the sponge in the sink, turn on the water, turn off the water, and pick up the sponge.",
                        "Turn right and walk to the shower, turn right, and walk to the counter.",
                        "Open the bottom drawer, put the sponge in the bottom drawer, and close the drawer."
                    ],
                    "task_desc":"Put a clean sponge in the bottom drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SprayBottle",
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-Drawer-430/trial_T20190908_122130_366898/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3XIQGXAUMFZJJTK58O5K86EPQCNX7N",
                    "high_descs":[
                        "Turn to your left and go to the bathtub, in the back corner of the bathroom. ",
                        "Pick up the green sponge that is in the bathtub. ",
                        "Turn to your right  and go to the sink that is just past the bathtub, on your left. ",
                        "Place the sponge in the sink, turn the water on, rinse out the sponge, turn the water off, and remove the sponge from the sink. ",
                        "Turn to your right and walk to the shower, turn right again and go to the sink across from you.",
                        "Place the sponge in the bottom, left drawer, underneath the sink. "
                    ],
                    "task_desc":"Put a clean sponge in the bathroom drawer. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3ZWFC4W1UXYC1QDZH8X47G5INJCRFG",
                    "high_descs":[
                        "turn around, walk to face the left side of the bath tub",
                        "pick up the green sponge from inside the tub",
                        "walk right to face the sink",
                        "put the sponge in the sink, wash sponge, pick up sponge from sink",
                        "walk around to cabinets underneath the mirror",
                        "open the bottom left drawer, put the sponge inside, close the door"
                    ],
                    "task_desc":"put a washed sponge inside a drawer",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1CY7IOJ9YH136_3IQ1VMJRYWBB1Z05CBBQ2UUXKHJ9AO",
                    "high_descs":[
                        "turn around, go to the tub to the right",
                        "pick up green sponge from out of tub",
                        "go to the gray sink to the right",
                        "place green sponge in sink, turn on water, pick up green sponge from sink",
                        "turn around, go to black and white counter to the right",
                        "open bottom left drawer of counter, place green sponge in left side of drawer, close drawer"
                    ],
                    "task_desc":"Place clean green sponge in bottom drawer",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_two_obj_and_place-SoapBar-None-Cart-430/trial_T20190909_145927_629447/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2DN53DIE3049T_3JBT3HLQFBTXUUOK5SNM5DLLYL0PZM",
                    "high_descs":[
                        "Turn to the left, walk to the counter in front of you",
                        "Pick the soap up from the counter",
                        "Turn around, walk to the toilet then take a left, walk to the shelf",
                        "Place the soap on the shelf",
                        "Turn to the left, walk to the sink next to you",
                        "Pick the soap up from the sink",
                        "Turn to the right, walk back to the shelf that you placed the other soap on",
                        "Place the soap on the shelf"
                    ],
                    "task_desc":"Place all bars of soap on the shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Cart-430/trial_T20190906_194234_663749/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_37Q970SNZHPPR1X6TQT772MIDG3S17",
                    "high_descs":[
                        "Turn around, go to the barred rack.",
                        "Pick up the rag from the bottle shelf of the barred rack.",
                        "Go to the sink on the left.",
                        "Put the rag in the sink, turn on then turn off the water.",
                        "Go to the barred rack to the right of the sink.",
                        "Put the rag on the top shelf of the barred rack."
                    ],
                    "task_desc":"Put a clean rag on the top shelf of a barred rack.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3E47SOBEYTDKKQ484BODKWZM8ENICO",
                    "high_descs":[
                        "Turn around and go the shelf",
                        "Pick up the pink towel on the shelf",
                        "Turn around and put the towel in the sink",
                        "Fill the sink with water and wash the towel, take the towel out",
                        "Go back to the shelf",
                        "Put the towel back on the shelf"
                    ],
                    "task_desc":"Wash the pink towel on the shelf, put it back on the shelf",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3U5JL4WY5NQEFHGOAIIW48AD4H0X4M",
                    "high_descs":[
                        "walk on over to the towel drying rack",
                        "pick up a dirty red cloth from the towel rack",
                        "walk over to the left side of the bathroom sink",
                        "turn on the water to rinse the dirty red cloth and pick it back up again",
                        "walk back over to the towel drying rack",
                        "place the clean cloth on the drying rack"
                    ],
                    "task_desc":"clean a red cloth",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Cart-430/trial_T20190906_194203_696787/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A22051NK9RQ4FV_37QW5D2ZRJ3721HRSB2MMC9QRSTS8N",
                    "high_descs":[
                        "Head towards the silver rack to the right of the sink.",
                        "Pick up the dirty rag next to the yellow bottle.",
                        "Turn left and stand on the left side of the sink, facing the sink.",
                        "Put the rag in the sink, rinse it, and pick it up.",
                        "Turn right and head towards the silver rack.",
                        "Put the rag on the top shelf of the silver rack next to the yellow bottle."
                    ],
                    "task_desc":"Pick up the dirty pink rag, rinse it in the sink, return it.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_39GXDJN2OWVNUTYVM67RXZTXQVQV8W",
                    "high_descs":[
                        "Turn around, head towards the toilet, turn left and head towards the metal rack.",
                        "Pick up the dirty towel on the rack.",
                        "Turn left and head towards the sink on your right.",
                        "Place the towel in the sink, rinse it, and pick it back up.",
                        "Turn right and head towards the metal rack on your left.",
                        "Place the towel on the second rack right beneath the yellow bottle."
                    ],
                    "task_desc":"Clean the dirty towel on the metal rack.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3Z7EFSHGNCVHALT33XOEN6M1WYIXC8",
                    "high_descs":[
                        "Move to the metal rack.",
                        "Pick up the dirty rag from the rack.",
                        "Bring the rag to the sink.",
                        "Wash the rag in the sink.",
                        "Bring the rag back to the rack.",
                        "Put the cleaned rag on the rack. "
                    ],
                    "task_desc":"Put a cleaned rag on the metal rack. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-TissueBox-None-Cart-430/trial_T20190906_172408_729431/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3B3WTRP3DEJEB7J33OTUVQRWB5629B",
                    "high_descs":[
                        "Walk towards the toilet, turn right, walk in front of the makeup vanity.",
                        "Take the box of tissues from the makeup vanity.",
                        "Turn around, walks towards the toilet, turn left, walk in front of the barred rack.",
                        "Put the tissues on the barred rack.",
                        "Turn around, walks in front of the toilet.",
                        "Take the box of tissues from the top of the toilet.",
                        "Turn left, walk in front of the barred rack.",
                        "Put the tissues on the barred rack."
                    ],
                    "task_desc":"Put all the boxes of tissues on the barred rack.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_38JBBYETQRR59HP7FDS4GJP5MFC4EB",
                    "high_descs":[
                        "Walk towards the toilet and then turn right towards the bathroom vanity.",
                        "Pick up the tissue box from the vanity.",
                        "Turn around, walk towards the toilet, make a left towards the metal shelf.",
                        "Place the tissue box on the top shelf next to the red towel.",
                        "Turn around, walk towards the toilet.",
                        "Pick up the tissue box on top of the toilet.",
                        "Turn left and walk towards the metal shelf.",
                        "Place the tissue box to the right of the two candles."
                    ],
                    "task_desc":"Place all the tissue boxes on the metal shelf in the bathroom.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-430/trial_T20190908_102045_139402/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3NLZY2D53SGYPH8VQ4B2X30XOSQLQ6",
                    "high_descs":[
                        "Turn around and go to the toilet behind yo. ",
                        "Pick up the roll of toilet paper on the back of the toilet. ",
                        "Move over to the toilet paper holder, on the wall, to the left of the toilet. ",
                        "Place the roll of toilet paper on the toilet paper holder, hanging from the wall. "
                    ],
                    "task_desc":"Put a roll of toilet paper on the toilet paper dispenser. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3YDTZAI2W07EA5HTZXM6ALQEUUD148",
                    "high_descs":[
                        "Turn right and take one step, then turn right to face the toilet. ",
                        "Pick up the toilet paper on top of the toilet. ",
                        "Look up from the floor. ",
                        "Place the toilet paper on the holder that is on the wall. "
                    ],
                    "task_desc":"To put the toilet paper away.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3XUHV3NRVNP7AZ67FR8170CZBS2H5G",
                    "high_descs":[
                        "Turn around and walk to the left side of the white toilet.",
                        "Pick up the full roll of toilet paper from the left side of the toilet tank.",
                        "Look up at the metal bar of the holder on the wall to the left of the toilet.",
                        "Put the full roll of toilet paper on the metal bar of the holder."
                    ],
                    "task_desc":"Place a full toilet paper roll on a metal holder.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-430/trial_T20190908_102028_194585/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_31QTRG6Q2W4XP4EF96L3R6CJSAWPYX",
                    "high_descs":[
                        "Turn left, hang a left at the shower and walk to the left side of the white toilet ahead.",
                        "Pick up the roll of toilet paper from the left side of the toilet tank.",
                        "Look up at the black metal holder on the wall to the left of the toilet tank.",
                        "Put the roll of toilet paper on the metal holder on the wall."
                    ],
                    "task_desc":"Place a roll of toilet paper on a metal holder.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3PW9OPU9PTB47R26VJ3IH6TGAFV21P",
                    "high_descs":[
                        "Turn to your left and head straight, then turn left at the shower and go to the toilet. ",
                        "Pick up the roll of toilet paper on the back of the toilet.",
                        "Move closer to the toilet paper holder, to the left of the toilet. ",
                        "Put the toilet paper on the toilet paper dispenser, hanging on the wall, to the left of the toilet. "
                    ],
                    "task_desc":"Put toilet paper on the toilet paper dispenser. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3VJ40NV2QLEJNI3KK0LPUPFE34KTOZ",
                    "high_descs":[
                        "Turn left and then left again and cross the room to face the left side of the toilet.",
                        "Pick the toilet paper up from the back of the toilet",
                        "Look up to face the toilet paper holder on the wall to the left of the toilet.",
                        "Put the toilet paper roll on the toilet paper holder."
                    ],
                    "task_desc":"Put a roll of toilet paper on a toilet paper holder.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-430/trial_T20190908_102055_678050/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_323Q6SJS8L7ZCWZWL3LATC3C095FHW",
                    "high_descs":[
                        "Turn left and veer right to the toilet.",
                        "Pick up the toilet paper roll on the toilet tank.",
                        "Look left.",
                        "Put the roll on the toilet roll dispenser."
                    ],
                    "task_desc":"Place a toilet paper roll in a toilet paper dispenser.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2Q3FS9G8ITCN7_3II4UPYCOMYFR5K3DNDEEQSSFI6QDB",
                    "high_descs":[
                        "Walk forward toward the shower and then turn left and walk to the toilet paper holder to the left of the toilet. ",
                        "Pick up the roll of toilet paper from the tank of the toilet. ",
                        "Walk forward and closer to the wall. ",
                        "Place the toilet paper on the holder. "
                    ],
                    "task_desc":"Place toilet paper on the holder. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3MX2NQ3YCCL4WP6MKVQNAM0TZ54X5I",
                    "high_descs":[
                        "Walk to the toilet on your left.",
                        "Grab the toilet paper roll from the toilet.",
                        "Locate the toilet paper holder.",
                        "Put the roll in the holder."
                    ],
                    "task_desc":"Put paper towels in a holder.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "ToiletPaper"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-BathtubBasin-430/trial_T20190908_122347_043547/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3TVRFO09GN6IYE97CI6URBWQLWDXLH",
                    "high_descs":[
                        "Turn around and walk across the room, then go to the bathtub, to your left, in the corner. ",
                        "Pick up the sponge in the back of the bathtub. ",
                        "Turn to the sink on your right. ",
                        "Place the sponge in the sink, turn the water on, soak up some water with the sponge, turn the water off, and remove the sponge from the sink. ",
                        "Turn back to the bath tub on your right. ",
                        "Place the sponge back into the bathtub, to the right of the other sponge. "
                    ],
                    "task_desc":"Put a wet sponge in the bathtub. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PPLDHC3CG0YN_3Z9WI9EOZ2FASIRAMEC79PVH867HKN",
                    "high_descs":[
                        "Walk to the tub on the other side of the room. ",
                        "Pick up the sponge that's farthest away in the tub. ",
                        "Turn around to face the sink. ",
                        "Put the sponge inside of the sink, rinse the sponge off with water, pick the sponge up from the sink. ",
                        "Turn around to face the tub again. ",
                        "Place the sponge in the tub to the right of the other sponge. "
                    ],
                    "task_desc":"To rinse off a sponge and put it in the tub. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3M68NM076KYGIXKOGFU0DAS5UKKR6O",
                    "high_descs":[
                        "Turn around, move to the tub. ",
                        "Pick up the right sponge in the tub. ",
                        "Turn around, bring the sponge to the sink.",
                        "Wash the sponge in the sink. ",
                        "Bring the cleaned sponge back to the tub behind you.",
                        "Put the sponge in the tub, right of the other sponge. "
                    ],
                    "task_desc":"Put a cleaned sponge in the tub. ",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-BathtubBasin-430/trial_T20190908_122316_002024/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_31Z0PCVWUN6C2CBL3E4NJ3TJDFCT7B",
                    "high_descs":[
                        "Turn around and walk straight, then right to the corner vanity.",
                        "Pick up the sponge on the counter.",
                        "Turn around and veer left to the sink.",
                        "Wash the sponge in the sink.",
                        "Turn left to the bath tub.",
                        "Place the sponge in the bath tub to the left of the drain."
                    ],
                    "task_desc":"Place a rinsed sponge in a bath tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3WI0P0II64JF36Z3Q22EJG2XB49DR0",
                    "high_descs":[
                        "Turn around, hang a right at the shower and walk to the vanity table ahead.",
                        "Pick up the green sponge behind the box of tissues on top of the vanity counter.",
                        "Turn around, hang a left at the shower and turn right at the wall to reach the sink.",
                        "Put the sponge in the sink, rinse it for a few seconds and pick it back up.",
                        "Turn around to face the white tub.",
                        "Put the rinsed sponge in the tub in front of the red towel."
                    ],
                    "task_desc":"Place a rinsed sponge in a tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_33TIN5LC071CXHY8SHP65GC4N699YH",
                    "high_descs":[
                        "Walk to the kitchen counter on your left.",
                        "Grab a sponge from the counter.",
                        "Walk to the left edge of the kitchen sink.",
                        "Place the sponge in the sink, wash it, then grab it.",
                        "Turn around to the tub behind you.",
                        "Put the sponge in the tub."
                    ],
                    "task_desc":"Wet a sponge for use in a tub.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "DishSponge",
                "SoapBar",
                "SoapBottle",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-BathtubBasin-430/trial_T20190908_122245_195809/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ARB8SJAWXUWTD_354P56DE9NUBNCY6EEZX9YXXBW57S7",
                    "high_descs":[
                        "Go to the bathroom rack",
                        "Pick up a sponge from the rack",
                        "Go to the bathroom sink",
                        "Wash the sponge in the sink",
                        "Go to the bath tub",
                        "Put the sponge in the bath tub"
                    ],
                    "task_desc":"Wash and place a sponge in a bath tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A14IPKOBOPID9H_3K3R2QNK8EUVG8E3IGSH2V6RRJFU9N",
                    "high_descs":[
                        "Turn right and head to the toilet then turn left and head to the cart in front of the window",
                        "Pick up the sponge from the bottom of the cart",
                        "Turn left, then turn left, then turn right and go to the bathtub, then turn right, then right and go to the sink",
                        "Put the sponge in the sink and turn on the water, then take the sponge from the sink",
                        "Turn around to face the bathtub",
                        "Put the sponge in the bathtub"
                    ],
                    "task_desc":"Put a clean wet sponge in the bathtub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3VNL7UK1XIAPH5QRLX2Z7V60B2LTF3",
                    "high_descs":[
                        "Walk across the room to the steel rack.",
                        "Pick up the sponge.",
                        "Turn left, walk across the room to the tub, and turn around to face the sink.",
                        "Put the sponge in the sink, turn on the water, turn off the water, and pick up the sponge.",
                        "Turn around to face the tub.",
                        "Put the sponge in the tub."
                    ],
                    "task_desc":"Put a clean sponge in the tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_and_place_simple-Candle-None-Cart-430/trial_T20190909_055319_119903/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3A1COHJ8NMMQXHP9DPF4JKMQDDEH8J",
                    "high_descs":[
                        "Go forward to the counter in front of you.",
                        "Pick up the candle from the counter.",
                        "Turn to your right and cross the room to the corner to the right of the sink.",
                        "Put the candle on the top shelf of the metal rack in the corner."
                    ],
                    "task_desc":"Move a candle to a bathroom rack.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3G2UL9A02G560E0971WU8T15TFS76L",
                    "high_descs":[
                        "Move the the table in front of you, to the left. ",
                        "Pick up the candle on the table. ",
                        "Turn around, bring the candle to the toilet, turn left, bring the candle to the metal rack. ",
                        "Put the candle on the top shelf of the middle rack."
                    ],
                    "task_desc":"Put a candle on the top rack. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3OWEPKL08C3E7Z616IIBA4NRO5GN7A",
                    "high_descs":[
                        "Turn to the left then turn right and go to the counter.",
                        "Pick up the candle from the counter.",
                        "Turn around and then turn left. Head to the silver shelf unit.",
                        "Place the candle on the bottom of the silver shelf."
                    ],
                    "task_desc":"Move the candle to a silver shelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Candle"
            ]
        },
        "train/pick_and_place_simple-DishSponge-None-Toilet-430/trial_T20190907_144807_198266/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_32SCWG5HIKLNLVIB7F1U7T8OYWY6P3",
                    "high_descs":[
                        "take a step forward and turn to the right and walk to the table and turn to the right and look down",
                        "pick up the green sponge from the bath tub",
                        "step forward and turn to the right and walk to the wall and turn to the right and face the side of the toilet",
                        "Place green sponge on toilet tank"
                    ],
                    "task_desc":"Place green sponge on toilet tank",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3EJJQNKU9UMOUXI7GQWN9FXT9T8HRG",
                    "high_descs":[
                        "Turn around to face the bath tub ",
                        "Pick up the green sponge inside of the tub",
                        "Turn around and carry the green sponge towards the toilet",
                        "Place the green sponge to the right of the tissue box on the back of the toilet"
                    ],
                    "task_desc":"Move a sponge from the tub to the back of the toilet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3JC6VJ2SAE0KFNCVDD9SPS5T4GT5AF",
                    "high_descs":[
                        "Turn right, and turn right to the tub",
                        "Grab the green sponge from the tub",
                        "Turn right, walk to the side of the toilet",
                        "Put the sponge on the toilet"
                    ],
                    "task_desc":"Move the green sponge from the tub to the toilet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_and_place_simple-DishSponge-None-Toilet-430/trial_T20190907_144839_536922/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1DMXEJGJY02E1_39JEC7537XIP6WO83INWZLPGH7MVCK",
                    "high_descs":[
                        "Turn left and go to the shelf.",
                        "Pick up the sponge.",
                        "Turn around and walk to the toilet",
                        "Put the sponge on the back of the toilet."
                    ],
                    "task_desc":"Put the sponge on the back of the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3C6FJU71TTA2WK0DUKVG0QFG6O4UYB",
                    "high_descs":[
                        "Go straight, then turn left at the metal shelf. ",
                        "Take the sponge from the shelf.",
                        "Turn right, then turn right, then go straight, to the toilet.",
                        "Place the sponge on the back of the toilet."
                    ],
                    "task_desc":"Put a sponge on the back of the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3DIP6YHAPF96SIC9RGIHXV5BRLVE8O",
                    "high_descs":[
                        "Walk to the steel rack to the right of the sink.",
                        "Pick up the sponge from the steel rack.",
                        "Turn around and walk to the toilet.",
                        "Put the sponge on the top of the toilet, just to the right of the toilet paper."
                    ],
                    "task_desc":"Place a sponge on the top of a toilet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-SoapBottle-None-Cart-430/trial_T20190909_100609_714213/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_31Z0PCVWUN6C2CBL3E4NJ3TJDW97TK",
                    "high_descs":[
                        "Turn around and walk forward to the bottle of soap near the pink cloth.",
                        "Pick up the bottle of soap from the counter.",
                        "Turn around, walk forward to the toilet, then turn left and head to the metal cart.",
                        "Put the bottle of soap on the top rack of the metal cart."
                    ],
                    "task_desc":"Move a bottle of soap from a counter top to a metal cart.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A12HZGOZQD5YK7_3B837J3LDRNL5VILNSX3EFOXCOOSRC",
                    "high_descs":[
                        "Turn to the right and go to the counter with the rag on it.",
                        "Pick up the bottle on the left of the counter.",
                        "Turn around, go to the toilet, turn left and go to the wire rack.",
                        "Put the bottle on the top shelf of the rack."
                    ],
                    "task_desc":"Put a bottle on the top shelf of the wire rack.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ZE52NWZPN85P_3JAOYWH7VLVSXIR9920GB8A8E8U9LC",
                    "high_descs":[
                        "Turn around and side step left so that you are facing the left side of the bathroom counter",
                        "Pick up the bottle off of the counter",
                        "Turn around and head towards the toilet before making a left turn to end up facing the silver shelves",
                        "Set the bottle down on the top shelf"
                    ],
                    "task_desc":"Move a bottle to the bathroom shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SoapBar"
            ]
        },
        "train/pick_and_place_simple-SoapBottle-None-Cart-430/trial_T20190909_100644_741963/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_32UTUBMZ7JNEHGI0LQGIPN30T69VB1",
                    "high_descs":[
                        "turn right and walk towards the shower and turn right towards the counter then turn left then right again towards the mirror",
                        "pick up the spray bottle on the counter",
                        "turn right walk straight then turn right again and walk straight to the toilet then turn left then turn right again then left towards the shelf",
                        "put the spray bottle down on the shelf"
                    ],
                    "task_desc":"move the spray bottle from the counter to the shelf",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3R08VXYT7FM4UTFFYJ9Y6N0IHPGW7M",
                    "high_descs":[
                        "Turn right and walk to the shower then turn right and walk to the make-up table then take step to your left.",
                        "Pick up the object in front of you with a red top.",
                        "Turn around and walk to the toilet then turn left and walk to the metal rack to the left of the blue recycling bin.",
                        "Put the spray bottle on the top rack by the tissues."
                    ],
                    "task_desc":"Put a spray bottle on a rack.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3FY6THWKRYN9M_3WS1NTTKE13O1WT0NVEPNK4VFOKF04",
                    "high_descs":[
                        "Turn around, walk to counter",
                        "Pick up spray bottle on left side of counter",
                        "Turn around, walk to toilet, take left walk to metal shelf",
                        "Place spray bottle on metal shelf next to tissue box"
                    ],
                    "task_desc":"Move spray bottle to shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "Shelf"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-Cart-430/trial_T20190906_233436_645915/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3QECW5O0KKIPUJB4JD09KXVLRHA5TJ",
                    "high_descs":[
                        "Move to the metal rack right of the sink. ",
                        "Pick up the sponge from the rack. ",
                        "Bring the sponge to the sink. ",
                        "Wet the sponge in the sink. ",
                        "Bring the sponge to the metal rack. ",
                        "But the sponge on the metal rack. "
                    ],
                    "task_desc":"Put a wet sponge on the metal rack. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3C81THYYSBGVD_3X73LLYYQ4V3FZQFNJF60VSJ79PHNN",
                    "high_descs":[
                        "Walk forward, then left towards the sink.",
                        "Take green sponge from the rack on the right.",
                        "Turn left and face the sink on from the left side.",
                        "Wash sponge in the sink and take it out.",
                        "Turn right and walk left to face the rack.",
                        "Put the green sponge back on the rack."
                    ],
                    "task_desc":"Wash a sponge in the sink.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RQMEPIHW5BOS_3EKVH9QME1LQEXWKF4YWHMAN5NE2DK",
                    "high_descs":[
                        "Cross the room to the toilet, turn left, and cross the room to the steel rack.",
                        "Pick up the sponge.",
                        "Turn around, cross the room to the tub, and turn around to face the sink.",
                        "Put the sponge in the sink, turn the water on, turn the water off, and pick up the sponge.",
                        "Cross the room to the door and turn left.",
                        "Put the sponge on the steel rack."
                    ],
                    "task_desc":"Put a clean sponge on the steel rack.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_35USIKEBNUXNIA6YR0O2343TYHG6NQ",
                    "high_descs":[
                        "Move across the room to the silver shelves to the right of the sink",
                        "Pick up the green sponge on the lower shelf",
                        "Carry the green sponge to the sink",
                        "Place the sponge in the sink and turn the sink on then turn it off",
                        "Carry the sponge back to the shelf",
                        "Place the sponge on the second shelf from the top"
                    ],
                    "task_desc":"clean and return a sponge to the shelf",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-Cart-430/trial_T20190906_233529_080163/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_38SKSKU7R4EDNUYEHOHCNFP92RDILO",
                    "high_descs":[
                        "Turn left towards the toilet and then turn left towards the metal shelf.",
                        "Pick up the green sponge from the shelf.",
                        "Turn left towards the sink on your right side.",
                        "Place the sponge in the sink, rinse it, and pick it back up.",
                        "Turn right and head towards the shelf on your left side.",
                        "Place the sponge back on the shelf."
                    ],
                    "task_desc":"Rinse the sponge from the metal shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3GA6AFUKOR5WBVX550VRRHUD2S83H3",
                    "high_descs":[
                        "go to the towel rack in the bathroom",
                        "grab the sponge off of the towel rack",
                        "bring the sponge over to the left side of the bathroom sink",
                        "wash the sponge out in the sink and pick it back up",
                        "bring the sponge over to the towel rack again",
                        "place the sponge in the towel rack"
                    ],
                    "task_desc":"place a clean sponge in the towel rack",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3C81THYYSBGVD_3TPZPLC3M3TOOCVTOD3W0QW4OKP3PH",
                    "high_descs":[
                        "Turn left, then left again and head to the rack.",
                        "Pick up the green sponge from the rack in front of you.",
                        "Turn left, then turn left again to face the black sink from the side.",
                        "Put the green sponge in the black sink in front of you, wash it, turn the faucet off and take it out of the black sink.",
                        "Turn left, then left again and face the rack by the black sink.",
                        "Place the green sponge on the rack in front of you."
                    ],
                    "task_desc":"Put a clean green sponge on a steel rack.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "DishSponge"
            ]
        },
        "train/pick_clean_then_place_in_recep-DishSponge-None-Cart-430/trial_T20190906_233458_108018/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3IGI0VL64A1D7GC2RWAWK4PKJVJONY",
                    "high_descs":[
                        "walk on over to the toilet",
                        "grab the green sponge off the top of the toilet",
                        "walk over to the sink",
                        "place the sponge in the sink and rinse it off, then pick it up again",
                        "bring the sponge over to the drying racks",
                        "place the sponge on the rack"
                    ],
                    "task_desc":"place a green sponge on the drying racks",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2BLQ1GVEHJR8T_3JW0YLFXRWXBZJUIAJSTXHFXF9AWWX",
                    "high_descs":[
                        "Go near the toilet.",
                        "Pick up the sponge that is on the back of the toilet.",
                        "Take the sponge to the sink to your left.",
                        "Wash the sponge in the sink.",
                        "Go forward to the rack at the right of the sink.",
                        "Place the sponge vertically on the rack."
                    ],
                    "task_desc":"Put a clean sponge on the rack next to the sink.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3XUHV3NRVNFZPAK9JJJK6ESXGNE5H8",
                    "high_descs":[
                        "Move to the toilet.",
                        "Pick up the sponge from the toilet lid tank. ",
                        "Bring the sponge to the sink. ",
                        "Wet the sponge in the sink with water. ",
                        "Bring the sponge to the metal rack. ",
                        "Put the sponge on the metal rack. "
                    ],
                    "task_desc":"Place a wet sponge on the metal rack. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DishSponge"
            ]
        },
        "tests_seen/trial_T20190909_055404_570388/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move straight back to the white counter top by the sink",
                        "Pick up the nail polish on top of the counter",
                        "Carry the nail polish to the white shelf cart on wheels against the wall",
                        "Place the nail polish on the second shelf from the bottom"
                    ],
                    "task_desc":"Move nail polish to the shelf rack"
                },
                {
                    "high_descs":[
                        "Go straight ahead to the table in front of you.",
                        "Pick up the nail polish that is behind the roll of toilet paper on the table.",
                        "Turn and go to the silver rack to the right of the sink with the nail polish in your hand.",
                        "Place the nail polish on the top rack in the front middle of the silver rack."
                    ],
                    "task_desc":"Put the nail polish on the rack."
                },
                {
                    "high_descs":[
                        "move to the table",
                        "pick up a  candle stand",
                        "turn right and heard to the rack ",
                        "drop the candle stand on the rack"
                    ],
                    "task_desc":"drop a candle stand on a rack"
                }
            ],
            "relative_objects":[
                "Candle"
            ]
        }
    }
}