{
    "scene_name":"FloorPlan212",
    "trials":{
        "train/pick_and_place_simple-Box-None-ArmChair-212/trial_T20190908_032842_573641/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1GVTH5YS3WOK0_336KAV9KYT9TC8RBB0LAU7KONKK2YA",
                    "high_descs":[
                        "Turn around, take a step forward, and turn right towards the red dresser.",
                        "Pick up the box on the dresser.",
                        "Turn around towards the green chair.",
                        "Place the box on the chair."
                    ],
                    "task_desc":"Transfer the box from a red dresser on to the green chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A13OOAT2ORKH6V_3IXEICO7950LDNBIOWAEC39LON66T8",
                    "high_descs":[
                        "Look down, Turn around, walk straight to the wall, turn right, walk straight to the cabinet, turn left when you reach the cabinet, walk straight to the sofa seat, turn right to face the table, walk straight, turn right to face the box on the cabinet.",
                        "Pick up the box and statue on the cabinet.",
                        "Turn right, walk straight, turn right, walk straight to the sofa seat and look down.",
                        "Place the statue and empty box on the sofa seat."
                    ],
                    "task_desc":"Place an empty box and statue on the sofa seat.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3MHW492WW3U2FI0ZG7HA2HUSB82VMO",
                    "high_descs":[
                        "turn around, walk down hallway, turn left, take one step, turn right, walk forward a few steps, turn right to face shelves with a box on top",
                        "pick up the box that is on the shelf",
                        "turn around, walk forward to the green chair",
                        "put the box on the green chair"
                    ],
                    "task_desc":"move a box from the shelf to the chair",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "WateringCan",
                "Newspaper",
                "TissueBox",
                "CreditCard",
                "Pen",
                "Boots",
                "Laptop",
                "RemoteControl",
                "Box",
                "Statue",
                "Pencil",
                "Pillow",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Box-None-ArmChair-212/trial_T20190908_032830_891800/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_39O5D9O87W95UNMPJ8HQGQXXQ90C3J",
                    "high_descs":[
                        "Turn right, move to the first wooden shelf, face the box on the shelf. ",
                        "Pick up the box on the shelf. ",
                        "Turn around, bring the box to the green chair.",
                        "Put the box on the chair."
                    ],
                    "task_desc":"Put a box on a chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3WAKVUDHUZXJH04C7B5GNDVJ2BV7UV",
                    "high_descs":[
                        "Turn right and walk forward to the empty box near the newspaper on the table.",
                        "Pick up the empty box from the table.",
                        "Turn around and walk forward to the green armchair.",
                        "Put the box on the seat of the armchair."
                    ],
                    "task_desc":"Move an empty box from a table to an armchair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ACSS93E03ZUGX_3Z9WI9EOZ2527T5CQ6NQ83BFENOHK5",
                    "high_descs":[
                        "Turn right and walk straight then turn right to face the brown shelf with the box on top of it.",
                        "Pick the box up off of the brown shelf.",
                        "Turn around and go towards the green chair.",
                        "Place the box on the green chair."
                    ],
                    "task_desc":"Place the box that was on the brown shelf on the green chair.\n",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "train/pick_and_place_simple-Box-None-ArmChair-212/trial_T20190908_032818_426471/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_34FNN24DCPQLB5AYTJN8SEN07UU5YX",
                    "high_descs":[
                        "Turn around and walk through the hall, to the front of the first short, brown shelf you come to.",
                        "Pick up the cardboard box on top of the short, brown shelf.",
                        "Turn around and walk to the green, arm chair across from you. ",
                        "Place the cardboard box on the seat of the green arm chair. "
                    ],
                    "task_desc":"Put a cardboard box on the green chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3A9AA95ATZ3R2RIX2WRPFNUO3PNP5J",
                    "high_descs":[
                        "Move down the hall then to the right where the red table is",
                        "Pick up the empty box on top of the table",
                        "Carry the empty box to the green chair on the opposite side of the room",
                        "Place the empty box on top of the chair"
                    ],
                    "task_desc":"Move an empty box to the chair",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3ZPPDN2SLYD66NVJW8OVXR0MBFE9EL",
                    "high_descs":[
                        "Turn around and walk forward to the empty box on the table near the newspapers.",
                        "Pick up the box from the table.",
                        "Turn around and walk forward to the green armchair.",
                        "Put the empty box on the seat of the armchair."
                    ],
                    "task_desc":"Move an empty box from a table to an armchair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-212/trial_T20190906_185930_256772/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CY7IOJ9YH136_39LOEL67OVM3IKWC2W1LE41EZ9283D",
                    "high_descs":[
                        "Go to yellow couch to the left",
                        "Pick up keys from far right couch cushion",
                        "Go to lamp to the left",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Pick up keys, turn on lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3I33IC7ZWIJSGQT8VU7URL2HJHHA2J",
                    "high_descs":[
                        "Walk forward, then turn left and walk up to the lime green couch with the keys on the seat.",
                        "Pick up the closest set of keys off of the couch seat.",
                        "Turn right and walk over to the small black table, then turn left and walk up to the tall lamp.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a set of keys in the light of a tall lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3SEPORI8WQGIM1WKK1G8EWCO4QZAZA",
                    "high_descs":[
                        "Move over to the the green couch.",
                        "Pick up the keys on the couch next to the remote. ",
                        "Bring the keys over to the lamp in the corner.",
                        "Turn on the lamp in the corner. "
                    ],
                    "task_desc":"Turn on the lamp in the corner. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pen",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-212/trial_T20190906_185836_710138/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ZYJ9H5USAI8P_37Q970SNZHPPR1X6TQT772MIDFR1S2",
                    "high_descs":[
                        "Turn right walk into the other room ",
                        "Turn left then turn right then turn left walk to the green table.",
                        "Pick up the key chain on the right",
                        "Turn right then turn left then turn right then turn left go straight to the lamp turn it on put the keys on the lamp"
                    ],
                    "task_desc":"take key chain to lamp, turn on lamp ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2L22HZ50T83UK_3WZ36BJEV6XRJZSDKNRMNJVD1A0BTO",
                    "high_descs":[
                        "Turn right and walk forward to the right side of the grey table and turn to face it. ",
                        "Pick up the set of keys on the right",
                        "Turn right, then turn left and stand in front of the lamp. ",
                        "Use the button on the keys to turn on the lamp."
                    ],
                    "task_desc":"Pick up the set of keys in order to use the button on the keyring to turn on the lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3VJ40NV2QL4B2THMOSW8T3VC89COTY",
                    "high_descs":[
                        "Turn around and go to the coffee table, so you are standing between the table and the TV.",
                        "Pick up the keys on the corner behind the lap top.",
                        "Carry the keys to the lamp in the corner to your right.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at keys by the light of the lamp.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Pen",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Box-CoffeeTable-212/trial_T20190906_214302_421299/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AITP2LUW8GPB_31QNSG6A5UALJ3XZ484BRLDU48287Q",
                    "high_descs":[
                        "Turn left, then turn right to see white table.",
                        "Pick up pencil on table",
                        "carry pencil near the couches",
                        "put pencil into box on the couch",
                        "pick up the brown box",
                        "Turn left, carry box down the room near the table",
                        "Put the box onto the table. "
                    ],
                    "task_desc":"Place pencil into the brown box, put box onto table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PGS1Q1XAY79I_3JAOYWH7VLLKCT5BDUBZAMQ6J0J9LN",
                    "high_descs":[
                        "Go to the coffee table directly in front of you.",
                        "Pick up the pencil near the end of the table closest to you.",
                        "Turn left, go to the green sofa with the window behind it.",
                        "Locate the cardboard box to the right of the red pillow on the sofa.",
                        "Place the pencil in the box so that it lays parallel to the back of the sofa at the end of the box closest to the window .",
                        "Pick up the box, turn around towards the coffee table.",
                        "Place the box on the table at the short end farthest from the computer."
                    ],
                    "task_desc":"Place the box with a pencil in it on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A35P2RX8HKZM96_3R08VXYT7FCW94TH2BKH51GGMF7W7V",
                    "high_descs":[
                        "Walk to the coffee table.",
                        "Pick up the pencil on the table.",
                        "Walk forward and turn left to face the box.",
                        "Place the pencil in the box.",
                        "Pick up the box on the couch.",
                        "Turn left and walk back to the coffee table.",
                        "Place the box on the coffee table."
                    ],
                    "task_desc":"Get a pencil, place it in the box, put the box on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Box"
            ]
        },
        "train/look_at_obj_in_light-TissueBox-None-FloorLamp-212/trial_T20190907_043419_992449/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1QDQU3TJHQYAU_3W8CV64QJ5GIQXMLM9W1IUXZ38B9HW",
                    "high_descs":[
                        "turn right to face the dark brown desk",
                        "pick up the box of tissues on the desk",
                        "turn left and look up to face the green lamp",
                        "turn on the green lamp while holding the box of tissues"
                    ],
                    "task_desc":"turn on the green lamp while holding a box of tissues",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3WMOAN2SREE8X0LZS8WAFWJSGBKVNM",
                    "high_descs":[
                        "Turn right towards the tissue box on the table.",
                        "Pick up the tissue box from the table.",
                        "Turn left towards the floor lamp in front of you.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a tissue box by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3X1FV8S5J082N84D54JFPCAVF0SVGA",
                    "high_descs":[
                        "Turn to the right and face the tissue box from the table.",
                        "Pick up the tissue box on the table.",
                        "Head left and bring the box to the lamp.",
                        "Turn on the tall lamp on the floor. "
                    ],
                    "task_desc":"Examine the tissue box by the light of the tall lamp on the floor. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox"
            ]
        },
        "train/look_at_obj_in_light-TissueBox-None-FloorLamp-212/trial_T20190907_043405_860560/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_333U7HK6ICWQKTUSMP4OG3W47KVDJL",
                    "high_descs":[
                        "Turn to the left and walk past the coffee table, then turn to the left and walk to the middle of the coffee table before turning left to face it. ",
                        "Take the box of tissue in the middle of the table. ",
                        "Turn to the left and walk across the room, then turn left and walk to the lamp. ",
                        "Turn on the lamp. "
                    ],
                    "task_desc":"To look at the tissue in the light. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2M7VEYAS1405L_3X73LLYYQ4V3FZQFNJF60VSJ8WQNH5",
                    "high_descs":[
                        "turn left, cross the room to the green seat, turn left, go forward until you are next to the laptop, and then turn to face the laptop",
                        "take the box of tissues",
                        "turn left and cross the room to the floor lamp in the corner",
                        "turn on the lamp"
                    ],
                    "task_desc":"look at the tissue box by the light of the floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3YWRV122CVGNHE9VHGXM1DREC8LU8E",
                    "high_descs":[
                        "Turn left, walk to the sofa, turn around, facing the coffee table",
                        "Grab the tissue box on the coffee table",
                        "Turn left, walk to the corner with a floor lamp",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Grab the tissue box on the coffee table, turn on the floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CoffeeTable",
                "TissueBox",
                "FloorLamp"
            ]
        },
        "train/pick_two_obj_and_place-RemoteControl-None-Sofa-212/trial_T20190907_235309_480100/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3URFVVM168Z21AAIQ6XZEXOIC5SZU1",
                    "high_descs":[
                        "Go around the table to the side facing the sofa. ",
                        "Pick up the closest remote on the right side.",
                        "Turn around and face to sofa.",
                        "Place the remote on the sofa in front of the keys to the right of the red cushion.",
                        "Turn around and go to the right side of the table.",
                        "Pick up the other remote on the table.",
                        "Go back to the sofa.",
                        "Place the remote on the left of the first remote. "
                    ],
                    "task_desc":"Move both remotes to the sofa seat.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box"
            ]
        },
        "train/look_at_obj_in_light-Pencil-None-FloorLamp-212/trial_T20190907_144240_326472/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_38YMOXR4MXGD54FCJ1FPZNGKSU7W6X",
                    "high_descs":[
                        "Turn left, walk across the room to the white coffee table",
                        "Grab the pencil on the coffee table",
                        "Turn right, and turn left, walk to the floor lamp",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Grab the pencil from the coffee table, turn on the floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3I2PTA7R3WBFKM4F9WAKHH3G4NWQKB",
                    "high_descs":[
                        "Turn to your left and go down the hallway. Make a left to go into the living room and walk toward the coffee table.",
                        "Pick up the yellow pencil from the coffee table. ",
                        "Take the pencil over to the metal container to your right. Make a left at  the metal container and go straight towards the lamp.",
                        "Place the pencil on thee front leg of the lamp. Turn on lamp."
                    ],
                    "task_desc":"Pick up a pencil in addition to turning on the light. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3ON104KXQNDZQHBY0DMA2PW6V2XW45",
                    "high_descs":[
                        "turn left and walk down to hall, avoid the red cabinet in front and continue walking towards the end of the room, but stop just short and face the coffee table on your left",
                        "pick up a pencil off of the coffee table",
                        "turn right and walk to the end of the room, then turn left and walk to the lamp in the corner at the other end of the room",
                        "turn on the lamp in the corner of the room"
                    ],
                    "task_desc":"turn on a lamp while holding a pencil",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CoffeeTable",
                "Pencil",
                "FloorLamp"
            ]
        },
        "train/pick_two_obj_and_place-KeyChain-None-CoffeeTable-212/trial_T20190907_220845_602950/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_34S9DKFK766P1UG4XJJUMVNMY74YNA",
                    "high_descs":[
                        "Walk straight, turn left and walk over to the armchair.",
                        "Pick up the keys off of the chair.",
                        "Turn around and the turn left and walk to the coffee table.",
                        "Set the keys on the coffee table.",
                        "Turn around and walk to the bookcase on the wall.",
                        "Pick up the keys from the top of the bookcase.",
                        "Walk back to the coffee table.",
                        "Set the keys onto the coffee table."
                    ],
                    "task_desc":"Put both sets of keys on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-Newspaper-None-Sofa-212/trial_T20190908_112704_150966/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2XSGALF8O9ISQ_3F0BG9B9MS40Y9OHHC25QY1WY1AY7S",
                    "high_descs":[
                        "Turn left and go down the hall, now turn right and go toward the coffee table in the middle of the room",
                        "Reach down and pick up the newspaper on the end of the table",
                        "Go around the table to the end of the long green couch, turn and face the couch",
                        "Place the newspaper on the middle cushion ",
                        "Turn and walk to the green lounge chair with grey arm rests",
                        "Pick up the newspaper that is on the chair",
                        "Turn back and walk back to the middle of the couch",
                        "Place the newspaper on the second cushion next to the other paper"
                    ],
                    "task_desc":"Gather the newspapers and place them in the middle of the couch",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "tests_seen/trial_T20190906_185855_916436/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and walk a step then turn left.",
                        "Pick up the keys that are in front of you.",
                        "Turn left and walk to the wall then turn left and stand facing the light that's in the right corner in front of you.",
                        "Turn on the light that's in front of you."
                    ],
                    "task_desc":"Inspect a set of keys in lamp light."
                },
                {
                    "high_descs":[
                        "Move to the right and turn left to face the wooden shelf right of the house plant",
                        "Pick up the keys from the shelf",
                        "Turn and walk around the room to the floor lamp in the corner",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Examine the keys under the light of the lamp"
                },
                {
                    "high_descs":[
                        "Move to the shelf on the right.",
                        "Pick up the keys.",
                        "Turn left and go to the lamp in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine the keys by the lamp."
                },
                {
                    "high_descs":[
                        "Move to the red book shelf ",
                        "Pickup the keys to the left of the box on top of the shelf",
                        "Take the keys and move to the green floor lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry keys from the table to the lamp, turn on the lamp"
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        }
    }
}