{
    "scene_name":"FloorPlan410",
    "trials":{
        "train/pick_and_place_simple-Candle-None-Toilet-410/trial_T20190908_124744_886566/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_30ZX6P7VFBMB28IAL89OL6P24XW2JW",
                    "high_descs":[
                        "Turn around and walk across the room to the toilet, then turn right and go to the sink across from you. ",
                        "Pick up the candle closest to the ledge of the counter.",
                        "Turn around and walk across the room.",
                        "Place the candle on the left side of the back of the toilet."
                    ],
                    "task_desc":"Put a candle on the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_37W3JXSD69ZN9DBGLSZYJ0KFL81WY3",
                    "high_descs":[
                        "Turn left and walk to the tub then turn left and walk to the toilet then turn right and walk to the sink so you are facing the left side of the middle of the sink.",
                        "Pick up the candle that's closest to you.",
                        "Turn left and take a small step then turn left and walk to the toilet then take a small step to your right when you get to it.",
                        "Put the candle on the back of the toilet."
                    ],
                    "task_desc":"Put a candle on the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TUUIV61CR0C7_3TDXMTX3CEL3PYH5QS0RZIRE7M3I69",
                    "high_descs":[
                        "Turn around, walk forward towards the wall and turn to face the center of the sinks.",
                        "Grab the closest candle to the edge of the counter.",
                        "Turn around and walk to the front of the toilet.",
                        "Place the candle on the lid of the toilet."
                    ],
                    "task_desc":"Grab a candle from between the sinks and place it on the lid of the toilet.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Toilet",
                "Candle"
            ]
        },
        "train/pick_two_obj_and_place-SprayBottle-None-CounterTop-410/trial_T20190908_161608_081694/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3OYZK65C2G39N_3QAPZX2QN74402HOZ0ZI31A65TL20U",
                    "high_descs":[
                        " turn and walk to the toilet",
                        "\n pick up a bottle of cleaner that is on the back of the toilet",
                        " turn and walk to the sink",
                        " put the bottle of cleaner on the counter by the sink",
                        " turn back around and walk to the toilet",
                        " pick up  the bottle of cleaner on the back of the toilet",
                        "  walk back to the bathroom counter",
                        " put the bottle of cleaner on the counter"
                    ],
                    "task_desc":";Put the cleaner by the sink.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_two_obj_and_place-SprayBottle-None-CounterTop-410/trial_T20190908_161634_318819/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_392CY0QWG4IPABDR747C2K70B2CI4H",
                    "high_descs":[
                        "Turn right and face the black bin near the toilet in front of you.",
                        "Take out the purple spray bottle from the black can in front of you.",
                        "Turn right and face the sink in front of you.",
                        "Place the purple spray bottle on the counter in front of you.",
                        "Turn around and face the toilet in front of you.",
                        "Take the purple spray bottle on top of the toilet in front of you.",
                        "Turn around and face the sink in front of you.",
                        "Place the purple spray bottle on the counter in front of you."
                    ],
                    "task_desc":"Place the spray bottles near the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_two_obj_and_place-SprayBottle-None-CounterTop-410/trial_T20190908_161543_945343/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1E0WK5W1BFPWR_3F0BG9B9MSE8JYAFDKRMRKLYSMZ7YT",
                    "high_descs":[
                        "Walk forwards toward the black bin.",
                        "Pick up the purple spray bottle in the black bin.",
                        "Turn around and stop in the middle of the sinks on the left.",
                        "Place the purple spray bottle onto the counter.",
                        "Turn to the left and walk towards the toilet on the right.",
                        "Take the purple spray bottle closer to you from the top of the toilet tank.",
                        "Turn around and walk towards the sinks.",
                        "Place the purple spray bottle on the left side of the right sink."
                    ],
                    "task_desc":"Organize some of the purple spray bottles onto the counter.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        },
        "train/pick_two_obj_and_place-HandTowel-None-BathtubBasin-410/trial_T20190907_115448_201229/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3VJ40NV2QL4B2THMOSW8T3VC93FTOV",
                    "high_descs":[
                        "Turn to your left and walk towards the sink",
                        "Grab the cloth on the rack from the wall",
                        "Turn around and head to the tub",
                        "Drop the cloth on the tub",
                        "Turn to your left walk towards the wall there is a rack  with cloth",
                        "Grab the cloth on the rack",
                        "Turn to your right and head to the tub",
                        "Drop the cloth in between the other two things in the tub"
                    ],
                    "task_desc":"Put the cloth on the bathtub.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-HandTowel-None-BathtubBasin-410/trial_T20190907_115600_177970/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A16184N1RO5OJV_3COPXFW7XETUKA309JVVHCD601TKPI",
                    "high_descs":[
                        "Turn left a little bit, walk pass the bath tub to go to the first sink you see and look up to the mirror. ",
                        "Grab the hand towel next to the mirror. ",
                        "Turn around, walk towards the wall and turn to the bath tub. ",
                        "Put the towel inside the bath tub. ",
                        "Walk to the left towards the wall and turn right to go to another sink with a yellow cloth inside it. Look up to the mirror. ",
                        "Take the hand towel that is hanging near the wall next to the mirror. ",
                        "Turn around and go to the left to go back to the bath tub.",
                        "Put the hand towel inside the bath tub as well. "
                    ],
                    "task_desc":"Put 2 bath towel hanging near the mirror to the bath tub. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3DBQWDE4Y9FRZ66KMHEXBYPT3UUN5X",
                    "high_descs":[
                        "Turn around, take a step forward, and turn right towards the towel holder on the wall in front of you.",
                        "Take the towel from the holder.",
                        "Turn right to face the tub.",
                        "Place the towel in the tub.",
                        "Turn around and walk towards the towel holder on the wall next to the sink.",
                        "Pick up the towel from the holder.",
                        "Turn around and walk towards the tub.",
                        "Place the towel in the tub."
                    ],
                    "task_desc":"Transfer the towels on the towel holders into the tub.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_two_obj_and_place-ToiletPaper-None-Drawer-410/trial_T20190908_111427_862927/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AISNLDPD2DFEG_354P56DE9NUBNCY6EEZX9YXXBYB7SH",
                    "high_descs":[
                        "Turn right, go forward, turn right and go to the counter",
                        "Pick up the empty toilet paper on the counter",
                        "Turn around, go forward a bit, turn around",
                        "Open the drawer under the counter, put the empty toilet paper in the drawer, close the drawer",
                        "Turn right, go forward a bit, turn left, go to the counter",
                        "Pick up the toilet paper on the counter",
                        "Turn around, go forward a bit, turn around",
                        "Open the drawer under the counter, put the toilet paper in the drawer, close the drawer"
                    ],
                    "task_desc":"Put toilet papers into drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AHBWX3WYMAB0E_3I2PTA7R3WLN5BQD54Z1I3NIZVFQK8",
                    "high_descs":[
                        "Turn around and move towards the bathroom vanity.",
                        "Pick up the empty toilet paper roll from the counter.",
                        "Move a few inches to the left towards the middle of the vanity.",
                        "Put the empty roll in the top middle drawer in the front left corner.",
                        "Move a few inches towards the right sink.",
                        "Pick up the full roll of toilet paper.",
                        "Move left towards the center of the vanity.",
                        "Put the full roll of toilet paper in the top middle drawer behind the empty roll."
                    ],
                    "task_desc":"Put a full and an empty roll of toilet paper in the upper middle drawer of the bathroom vanity.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3P4RDNWND8XFDTWCABUG8MWJTT7JI2",
                    "high_descs":[
                        "Turn right, go forward, turn left at the sinks, go forward to the counter between the two sinks.",
                        "Take the cardboard roll from the counter.",
                        "Turn around, go forward a step, turn around to face the counter.",
                        "Put the cardboard roll in the drawer below the counter on the left outside corner.",
                        "Turn right, go forward a step, turn left, go forward to the toilet paper on the counter.",
                        "Take the toilet paper from the counter.",
                        "Go back to facing the drawer below the counter with the cardboard roll in it.",
                        "Put the toilet paper in the drawer below the counter behind the cardboard roll."
                    ],
                    "task_desc":"Put toilet papers rolls in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-Cloth-None-BathtubBasin-410/trial_T20190908_214728_043712/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A98E8M4QLI9RS_38SKSKU7R4OL8JKCDW6TO19BXMRLIT",
                    "high_descs":[
                        "turn to the left and move to the counter with the double sinks, face the sink on the right",
                        "pick up the yellow cloth from the sink",
                        "turn to the right to face the bath tub",
                        "put the yellow cloth in to the bath tub"
                    ],
                    "task_desc":"put a yellow cloth in to the bath tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3LS2AMNW5IH6V2BS3WRUPK4RJ1EQOJ",
                    "high_descs":[
                        "Turn around and walk towards the wall, then hang a right and walk up to the counter.",
                        "Pick up the yellow rag out of the sink.",
                        "Turn around and walk towards the door, then hang a left and walk over to the tub.",
                        "Put the yellow rag into the tub."
                    ],
                    "task_desc":"Put a yellow rag in the tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TUUIV61CR0C7_3PMBY0YE2AUZUEX3WP7H8PKLKNU9CM",
                    "high_descs":[
                        "Turn completely around, take a step forward, turn right and face the right hand sink. ",
                        "Pick up the yellow wash cloth from the sink.",
                        "Turn completely around, take a step, turn left and walk to the bath tub. ",
                        "Put the yellow wash cloth in the bath tub. "
                    ],
                    "task_desc":"Move the wash cloth from the sink to the bath tub. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-Cloth-None-BathtubBasin-410/trial_T20190908_214739_817788/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_37U1UTWH9YD3MB3C9URYXOOW0ICR8I",
                    "high_descs":[
                        "Turn around and walk to the sink on the right.",
                        "Take the yellow rag out of the sink.",
                        "Make a right and walk to the bathtub.",
                        "Put the yellow rag in the bathtub."
                    ],
                    "task_desc":"Move a yellow rag from the sink to the bathtub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ANBWJZYU2A68T_3P4RDNWND8XFDTWCABUG8MWJTXKJIN",
                    "high_descs":[
                        "Turn around, move toward the tub, turn left as you are close to the tub, and face the sink with a yellow cloth",
                        "Pick the cloth up from the sink",
                        "Turn around and turn back to stand in front of the tub",
                        "Place the cloth in the tub"
                    ],
                    "task_desc":"Pick up the cloth in sink and put it in the tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3TPZPLC3M33W91HRKLSD1CG6JF4P36",
                    "high_descs":[
                        "Walk to the right kitchen sink behind you.",
                        "Grab a towel from the sink.",
                        "Go to the edge of the tub.",
                        "Place the towel in the tub."
                    ],
                    "task_desc":"Move a towel from the sink to the tub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Drawer-410/trial_T20190908_122824_123331/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_33JKGHPFYFLXS2DOAOK0TMKHJNNNMJ",
                    "high_descs":[
                        "Turn right and sink counter",
                        "Pick up the cloth in between the sinks",
                        "Turn left and face the left side of the sink ",
                        "Put the cloth in the sink and rinse it",
                        "Turn left then face the sink drawer",
                        "Open the first left side sink drawer put in the cloth and close the drawer"
                    ],
                    "task_desc":"Put in the clean cloth in the drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3GS6S824STOTXE72EQQN2KM8HP9WNR",
                    "high_descs":[
                        "Turn around and take a step then turn left and walk to the toilet then turn right and walk to the sink.",
                        "Pick up the yellow wash cloth that's in front of you.",
                        "Take a small step to your left.",
                        "Get the cloth wet in the sink and then pick it back up and shut off the water.",
                        "Take a big step backwards so you can use the drawer under the sink.",
                        "Open the drawer under the left sink and put the cloth in it then close it again."
                    ],
                    "task_desc":"Put a wet wash cloth in the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3WJ1OXY92D7BNUHV7J5C2YZM0A8A85",
                    "high_descs":[
                        "Walk over to the middle of the sink counter.",
                        "Pick up the yellow rag off of the counter.",
                        "Turn left and walk towards the wall, then turn right to face the sink.",
                        "Put the yellow rag in the leftmost sink basin and turn on the water, after a couple seconds turn the water off and remove the now clean rag.",
                        "Turn around and walk forward, then turn right and take a step forward, turn right again to face the counter.",
                        "Open the leftmost upper drawer below the cabinets and put the clean yellow rag inside, then close the drawer."
                    ],
                    "task_desc":"Put a clean yellow rag in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-Drawer-410/trial_T20190908_122837_611974/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3DR23U6WE85XBRQVQMITPDL0Z2NTE4",
                    "high_descs":[
                        "Turn around face the tub on the right.",
                        "Pick up the cloth from inside the tub.",
                        "Hold the cloth and turn around, then face the first sink on the right.",
                        "Place the cloth in the sink and turn on the water. Turn off the water and pick up the cloth.",
                        "Carry the cloth and take a step to the right.",
                        "Open the top right drawer in the cabinet below the sink, and place the cloth inside."
                    ],
                    "task_desc":"Rinse a cloth and put it in the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3SNLUL3WO7EQHAFC7DV774XMRDAULY",
                    "high_descs":[
                        "Turn around, move to the sink, turn right, go to the tub.",
                        "Pick up the yellow rag in the tub. ",
                        "Turn around, bring the rag to the first sink on your right.",
                        "Wash the rag in the right sink. ",
                        "Bring the washed rag to the drawer under the right sink.",
                        "Open the drawer under the right sink and put the cleaned rag in there. "
                    ],
                    "task_desc":"Put a cleaned rag in the drawer under the right sink. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_3XLBSAQ9Z738OOKK96T55RU0YB7Z76",
                    "high_descs":[
                        "turn to the left and move to the bath tub",
                        "remove the yellow cloth from the bath tub",
                        "turn around, move forward, stop at the first sink and turn to the right to face the sink",
                        "put the yellow cloth in to the sink, turn on the water to rinse the cloth, turn off the water and remove the cloth from the sink",
                        "move back slightly to face the drawer under the sink on the right side",
                        "open the drawer, put the clean cloth in to the drawer and shut it"
                    ],
                    "task_desc":"put a clean cloth in to the drawer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-Drawer-410/trial_T20190908_162032_928842/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_3LBXNTKX0UMNXC8YNL34M25VL6HX9D",
                    "high_descs":[
                        "Turn to the right then go forward to the sinks.",
                        "Pick up the empty  toilet paper roll from the sink counter. ",
                        "Turn around and step back from the sinks.",
                        "Open the drawer in the counter and place the empty toilet paper roll inside. "
                    ],
                    "task_desc":"Put an empty toilet paper roll in a drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3RXCAC0YIUGCXLUYTJXMYKAPYA1G8D",
                    "high_descs":[
                        "walk to face sink on right side",
                        "pick up toilet roll from counter to left of sink",
                        "back up to face drawers and cabinet under sinks",
                        "put toilet roll into drawer beneath sinks"
                    ],
                    "task_desc":"put a toilet roll into a bathroom drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3Z2R0DQ0JK53RSWI77YXOQCAZUO2E9",
                    "high_descs":[
                        "Turn right walk few steps  then  head to the sink counter",
                        "Pick up the empty toilet roll on the left side of the  right sink",
                        "Turn around then face the drawer in between the others",
                        "Open the middle cabinet and put in the empty roll in the cabinet"
                    ],
                    "task_desc":"Put the empty tissue roll in the cabinet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-Drawer-410/trial_T20190908_162056_552400/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_33L7PJKHCJPG2QG4DJWTX3PEO3A8TD",
                    "high_descs":[
                        "Turn to the right, and then the right again to face the sinks.",
                        "Pick up the toilet paper from the counter, in between the sinks.",
                        "Hold the toilet paper and take a step backward.",
                        "Open the top middle drawer and place the toilet paper in the drawer. Shut the drawer."
                    ],
                    "task_desc":"Move toilet paper to the drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3HMVI3QICMJU8CVDO4ADQAULP0V1YM",
                    "high_descs":[
                        "walk to face counter in between sinks",
                        "pick up toilet paper on the left side of the counter",
                        "back up to face drawers under counter between sinks ",
                        "put toilet paper into top middle drawer"
                    ],
                    "task_desc":"put a toilet paper into a bathroom drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3JV9LGBJWW5FIDHE00MIV60PDE9GOI",
                    "high_descs":[
                        "Turn around and go to the small counter space between the two bathroom sinks across from you. ",
                        "Pick up the roll of toilet paper, to the right of the back right corner of the left sink. ",
                        "Step back from the bathroom counter and center yourself between the two sinks. ",
                        "Place the roll of toilet paper in the top drawer, under the empty counter space, between the two sinks. "
                    ],
                    "task_desc":"Put a roll of toilet paper in the bathroom drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-Drawer-410/trial_T20190908_162046_046480/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3ERET4BTVP0HDC9RO2OFW8XTPW19KX",
                    "high_descs":[
                        "Walk closer to the toilet, then turn right to face the toilet paper holder. ",
                        "Take the roll of toilet paper off of the the toilet paper holder that is on the wall. ",
                        "Turn to the right and walk up to the bathroom sink.",
                        "Place the roll of toilet paper in the bottom drawer underneath the sink."
                    ],
                    "task_desc":"Move a roll of toilet paper to a drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3IKZ72A5B77RMSL7O1GNYW08MP2NF9",
                    "high_descs":[
                        "Turn to the right and face the toilet paper holder on the wall to the right of the toilet.",
                        "Pick the toilet paper off the toilet paper holder from the wall.",
                        "Turn to the right and face the sink.",
                        "Put the toilet paper in the bottom drawer under the sink and shut the drawer."
                    ],
                    "task_desc":"Put a roll of toilet paper in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3IX2EGZR7EAS6SZV0YOPMEXAGT8JRW",
                    "high_descs":[
                        "Walk up to the toilet, then turn right and look down.",
                        "Pick up the toilet paper roll off of the toilet paper holder on the wall.",
                        "Turn right and walk over to the counter.",
                        "Open the leftmost lower drawer below the counter and put the toilet paper roll in the front left corner, then close the drawer."
                    ],
                    "task_desc":"Move a toilet paper roll into a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Drawer",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-410/trial_T20190908_064246_842694/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3A0VPWPASCO9J_3FIUS151DYJJ5BEIG9KTPB7LRZ4GGX",
                    "high_descs":[
                        "Walk past the tub to the sink.",
                        "Pick up the empty toilet paper roll on the sink.",
                        "Walk across the room to the toilet.",
                        "Put the empty toilet paper roll on the holder."
                    ],
                    "task_desc":"Put an empty toilet paper roll on the holder. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1P0XSCJ9XAV74_3I7DHKZYGQHFBET3OTVK3TGK0BSF5H",
                    "high_descs":[
                        "Walk straight ahead to the counter and sink.",
                        "On the sink there is an empty toilet paper roll, pick it up.",
                        "Turn around and walk straight to the door then turn to your right and stand in front of the bar that is above the trash can.",
                        "Place the roll on the bar."
                    ],
                    "task_desc":"Moving a toilet paper roll from the sink to the bar.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3R6P78PK7NSNAG0O09J0OUMAHRFGT5",
                    "high_descs":[
                        "walk to the right side of the sink",
                        "grab the yellow tube off the right side of the sink",
                        "walk over to the toilet",
                        "place the yellow tube on the toilet paper holder"
                    ],
                    "task_desc":"place a yellow tube on the toilet paper holder",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-410/trial_T20190907_021609_052545/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AKW57KYG90X61_30ZX6P7VFBC3HJWCP0K7KK5093U2J8",
                    "high_descs":[
                        "turn left, towards the sink",
                        "pick up the tissue paper roll",
                        "turn around and head towards the wall and then turn right and head towards the water closet",
                        "set the tissue paper roll on the tissue paper stand"
                    ],
                    "task_desc":"place a tissue paper on the tissue paper stand ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3AUQQEL7U8A5C4TSR2UC4KNF7TC0V4",
                    "high_descs":[
                        "Turn left and face the right side of the sink.",
                        "Take the roll of toilet paper to the right of the sink.",
                        "Turn left and then go left towards the toilet.",
                        "Put the toilet paper roll on the toilet paper holder to the right of the toilet."
                    ],
                    "task_desc":"Put a toilet paper roll on a toilet paper holder.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3W8CV64QJ5GIQXMLM9W1IUXZ2HFH9P",
                    "high_descs":[
                        "Walk to the tub and turn left",
                        "Grab the toilet paper by the sink",
                        "Turn around and walk to the toilet",
                        "Put the toilet paper on the holder"
                    ],
                    "task_desc":"Put the toilet paper roll by the sink to the holder by the toilet",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "ToiletPaper"
            ]
        },
        "train/pick_and_place_simple-ToiletPaper-None-ToiletPaperHanger-410/trial_T20190907_021559_670421/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_345LHZDED091GH3P5Z2QAWJ3WZLU34",
                    "high_descs":[
                        "Turn around and walk to the toilet.",
                        "Pick up the roll of toilet paper on the toilet tank.",
                        "Put the roll of toilet paper on the toilet paper holder."
                    ],
                    "task_desc":"Put a roll of toilet paper on a toilet paper holder.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3OUYGIZWRAFS7KWW5QLDYSYXL8Z0PD",
                    "high_descs":[
                        "turn around and move over to the toilet to the right",
                        "grab the toilet paper off of the top of the toilet",
                        "put the toilet paper on to the toilet paper holder"
                    ],
                    "task_desc":"put some toilet paper on the toilet paper holder",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A23HZ18KTCK2DA_3U5JL4WY5NQEFHGOAIIW48AD4GU4XL",
                    "high_descs":[
                        "Turn around and go towards the wall.  Turn right then go towards the toilet.",
                        "Pick up the roll of toilet paper that is on the back of the toilet.",
                        "Put the roll of toilet paper on the toilet paper holder."
                    ],
                    "task_desc":"Put toilet paper on the toilet paper holder.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "ToiletPaper"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-CounterTop-410/trial_T20190907_181358_754193/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1S1K7134S2VUC_3MD9PLUKKLVP6KQ9T5LD02WO42DZN9",
                    "high_descs":[
                        "Turn right, move to the tub.",
                        "Pick up the rag from the tub.",
                        "Turn left, move to the counter in front of the right hand sink.",
                        "Put the dirty rag into the right hand sink, rinse it, pick it back up.",
                        "Turn left, move to the counter between the sinks.",
                        "Put the clean rag on the counter."
                    ],
                    "task_desc":"Rinse the rag removed from the tub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3NLZY2D53S6Q4SMXUWMLWHGVU4JQLV",
                    "high_descs":[
                        "Turn around and go to bathtub.",
                        "Pick up cloth out of the tub.",
                        "Turn around and walk to first sink on right.",
                        "Put cloth in sink, turn on water then turn it back off.  Pick up cloth.",
                        "Move to the area between sinks.",
                        "Put cloth in front of the first bottle on the counter."
                    ],
                    "task_desc":"Wash cloth then place on counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36A780ODXBDEH_3ZV9H2YQQGOE8LSU0ZHRSK40IJ93WY",
                    "high_descs":[
                        "Turn around and move toward the tub.",
                        "Pick up the hand towel in the tub.",
                        "Turn around and move to the counter facing the sink.",
                        "Place the hand towel in the sink, run water over the hand towel and pick it back up.",
                        "Move toward the soap bottles to the left of the sink.",
                        "Place the hand towel on the counter in front of the soap bottles."
                    ],
                    "task_desc":"Soak a hand towel in the sink.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-CounterTop-410/trial_T20190907_181320_769618/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_384PI804XVIPKCCOX7P7TX389URS0B",
                    "high_descs":[
                        "Take a few steps to the left to face the sink.",
                        "Pick up the yellow cloth on the counter.",
                        "Take the cloth and face the sink to the right.",
                        "Place the cloth in the sink, turn the water on and then off. Pick up the cloth from the sink.",
                        "Take the cloth and take a step to the left.",
                        "Place the cloth on the counter."
                    ],
                    "task_desc":"Rinse a cloth and place it on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3RKNTXVS3PF2J48VZ8QIK0ZF40CA4P",
                    "high_descs":[
                        "Move to right to be in front of cloth on counter.",
                        "Pick up cloth from counter.",
                        "Move to right to be in front of sink.",
                        "Put cloth in the sink, turn on water, turn off water.  Pick up cloth.",
                        "Move left to be between the two sinks, facing the counter.",
                        "Put cloth on the counter, in front of the spray bottle."
                    ],
                    "task_desc":"Wash cloth with water.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFU00NU09CFXE_3U84XHCDIFU3KCG3B06H1TQODLS4ZT",
                    "high_descs":[
                        "Move a bit to stand closer to the sink on the right. ",
                        "Pick up the wash cloth next to the right sink. ",
                        "Move to stand directly in front of the right sink while carrying the wash cloth. ",
                        "Place the wash cloth in the sink, turn on the water, and then remove once it is wet. ",
                        "Carry the wash cloth to stand at the counter between the two sinks. ",
                        "Place the wash cloth on the counter in front of the spray bottle."
                    ],
                    "task_desc":"Place a wet wash cloth on the counter by the spray bottle. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-CounterTop-410/trial_T20190907_181451_902505/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1WJU1IQ3UTRC6_3N4BPTXIOB97CFBWQ5UPRI058O6UKL",
                    "high_descs":[
                        "Turn right and walk to the counter.",
                        "Pick up the cloth from the counter.",
                        "Go to the sink on the left with the cloth.",
                        "Wash the cloth in the sink.",
                        "Go back to the middle of the sinks.",
                        "Set the cloth on the counter."
                    ],
                    "task_desc":"Wash the cloth in the sink on the left.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3P1L2B7AD46NJG9HFJUH7CLVF1GLOT",
                    "high_descs":[
                        "Turn right and walk over to the counter.",
                        "Pick up the yellow rag off of the counter.",
                        "Turn left and walk forward, the turn right to face the sink.",
                        "Put the yellow rag in the sink and turn on the water, after a couple seconds turn the water off and remove the rag.",
                        "Turn right and walk forward, then turn left to face the counter.",
                        "Put the clean rag on the counter in between the two sinks."
                    ],
                    "task_desc":"Clean a rag and put it back on the counter.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3R8YZBNQ9KZRP7XVQ2LBDCYUZJ0Q76",
                    "high_descs":[
                        "Turn to your right then  head to the sink",
                        "Pick up the cloth in the middle of the sink counter",
                        "Turn to your left and face the sink on your left",
                        "Put the cloth in the sink and rinse it",
                        "Turn to your right then move few steps face the middle sink counter",
                        "Place the cloth on the sink counter in front of the spray bottle"
                    ],
                    "task_desc":"Put clean cloth on the middle counter",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Cloth",
                "SoapBar"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-410/trial_T20190908_130136_264878/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A272X64FOZFYLB_326O153BMLPQU2UY4WIEK93EWH0DE8",
                    "high_descs":[
                        "Turn around, walk forward to the toilet, then turn right and walk forward to the counter top.",
                        "Pick up the yellow cloth on the counter top that is closest to you.",
                        "Turn left and walk to the sink.",
                        "Put the cloth in the sink, rinse it off, and take it back out.",
                        "Turn around, walk to the toilet, then turn left and walk to the bath tub.",
                        "Put the cloth in the bath tub basin, to the right of the soap."
                    ],
                    "task_desc":"Put a cleaned cloth in a bath tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3VHP9MDGRQB8VOOGZB79IL6WNI2FCR",
                    "high_descs":[
                        "Turn around and take one step, then turn right and walk to the sinks.",
                        "Pick up the yellow cloth that is closest to the blue bottle.",
                        "Turn left and take one step, then turn right to face the sink.",
                        "Put the yellow cloth in the sink, then turn the faucet on for three seconds, then turn it off and pick up the yellow cloth from the sink.",
                        "Turn around and take two steps, then turn left and walk to the bathtub, then turn left to face it. ",
                        "Put the yellow cloth in the bathtub."
                    ],
                    "task_desc":"Wash the yellow cloth.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A30M9SZYJKFDS9_39LNWE0K4XNOR976MAYUFO5UAA1IUV",
                    "high_descs":[
                        "turn around to the left go right towards the sink",
                        "pick up a yellow rag from the sink ",
                        "turn to the left  ",
                        "put the rag inside the sink rinse off the rag",
                        "turn around to the left towards the bath tub",
                        "put the rag inside the bath tub"
                    ],
                    "task_desc":"put a wet yellow rag inside the bath tub",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-410/trial_T20190908_130218_985162/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3A4NIXBJ79Q742A3YB4LGUGSESQMLJ",
                    "high_descs":[
                        "Turn around, move to the counter between the two sinks. ",
                        "Pick up the rag on the counter. ",
                        "Bring the rag to the sink on the left. ",
                        "Wash the rag in that sink with water. ",
                        "Bring the rag to the tub, which is right of the sinks. ",
                        "Put the rag in the tub."
                    ],
                    "task_desc":"Put a cleaned rag in the tub. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3R6BYFZZPA3WYMZBQ73WWYR6O0TXFE",
                    "high_descs":[
                        "Turn right and take a step then turn right and walk t the counter between the sinks.",
                        "Pick up the yellow wash cloth that's in front of you.",
                        "Take a step to your left so you can use the left sink.",
                        "Get the wash cloth wet in the sink and then pick it back up and shut off the water.",
                        "Turn around and walk to the toilet then turn left and walk to the right side of the tub then turn left.",
                        "Put the yellow wash cloth in the tub."
                    ],
                    "task_desc":"Put a wet wash cloth in the tub.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARB8SJAWXUWTD_3NS0A6KXC7ZRHHVL29XZB47TXFEZGZ",
                    "high_descs":[
                        "Go to the middle of the sinks",
                        "Pick up the towel",
                        "Go to the left sink",
                        "Wash the towel in the sink",
                        "Go to the tub",
                        "Put the towel in the tub"
                    ],
                    "task_desc":"Put a clean towel in the tub",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel",
                "Cloth"
            ]
        },
        "train/pick_clean_then_place_in_recep-Cloth-None-BathtubBasin-410/trial_T20190908_130257_917433/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A31681CCEVDIH3_3H8DHMCCWC2TG2M80ITHI4GJGD9DK3",
                    "high_descs":[
                        "Turn around to face the sinks.",
                        "Pick up the yellow rag closest to the wall.",
                        "Walk to the rightmost sink.",
                        "Put the yellow rag in the sink to rinse it, taking it back out again afterwards.",
                        "Walk across the room to the bathtub.",
                        "Place the yellow rag in the bathtub."
                    ],
                    "task_desc":"Rinse a rag to put in the bathtub.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3U8YCDAGXS7LSLJ91BPJZJ89LUVQ0I",
                    "high_descs":[
                        "turn around and walk over to the bathroom sink counter",
                        "grab a cloth off of the counter",
                        "move to the right a bit and face the bathroom sink on the right",
                        "place the cloth inside of the sink, rinse it off, then take it back out",
                        "turn right and walk to the bath tub ahead",
                        "place the cleaned cloth inside of the bath tub"
                    ],
                    "task_desc":"place a clean cloth inside of the bath tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3VSOLARPKE0BHE1K3WWGFMGRE6A939",
                    "high_descs":[
                        "Turn to the right and take one step, then turn to the right and walk to the counter.",
                        "Pick up the yellow cloth that closest to the pink bar of soap.",
                        "Turn to the right and take one step, then turn to the left to face the sink.",
                        "Put the cloth in the sink, turn the faucet on for three seconds, then turn the faucet off and pick up the cloth. ",
                        "Turn around and take one step, then turn left and take two steps.",
                        "Put the cloth in the bathtub. "
                    ],
                    "task_desc":"Wash the cloth.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "SoapBottle",
                "SprayBottle",
                "SoapBar",
                "Cloth"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-BathtubBasin-410/trial_T20190908_174259_048748/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_34S6N1K2ZY0DRZNUB6ZRN3OU3PNHL6",
                    "high_descs":[
                        "Turn to the left and walk up to the bathroom sink that is on the far left of the counter. ",
                        "Take the towel off the towel holder that is on the wall to the left of the sink.",
                        "Turn right and walk over to the bathtub.",
                        "Place the towel in the bathtub. "
                    ],
                    "task_desc":"Move a towel from a wall-mounted towel holder to the bathtub.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3U8YCDAGXSXD7WXB5302YXO7REA0QE",
                    "high_descs":[
                        "Turn left and walk to the hand towel on the wall by the sink.",
                        "Pick up the hand towel from the holder on the wall.",
                        "Turn right and walk to the bath tub.",
                        "Put the hand towel in the bath tub basin."
                    ],
                    "task_desc":"Move a hand towel from a holder on the wall to a bath tub.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3OF2M9AATJ5OYE56WSTX8AFKALZZKN",
                    "high_descs":[
                        "Walk to the left kitchen sink.",
                        "Grab the towel off of the ring to your left.",
                        "Walk to the bathtub on your right.",
                        "Place the towel inside the bathtub."
                    ],
                    "task_desc":"Move a towel off its ring to the bathtub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-BathtubBasin-410/trial_T20190908_040737_833076/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A38Z99XF4NDNH0_3E1QT0TDFSQI8NEVNZ88IA33J298IA",
                    "high_descs":[
                        "Move left to the wall on the right side of the sink where the towel holder is",
                        "Remove the hand towel from the towel holder on the wall",
                        "Carry the hand towel to the bathtub",
                        "Place the hand towel in the tub"
                    ],
                    "task_desc":"Carry a hand towel to the bath tub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3M0NZ3JDP4FLGVK3P5PR6LW2DP9Z5V",
                    "high_descs":[
                        "Turn right and walk up to the right side of the right sink",
                        "Grab the hand towel from the towel rack next to the sink",
                        "Turn around and walk to the end of the bathtub",
                        "Put the hand towel in the bathtub"
                    ],
                    "task_desc":"Put the hand towel in the bathtub",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3P59JYT76O1XVMSH1UYBMQS98JS2TD",
                    "high_descs":[
                        "Turn to the right and walk over to the towel holder on the wall in front of you.",
                        "Take the towel off the towel holder that is on the wall.",
                        "Turn around 360 degrees until you are at the bathtub.",
                        "Place the towel in the bathtub."
                    ],
                    "task_desc":"Move a towel from the towel holder to the tub. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-HandTowel-None-BathtubBasin-410/trial_T20190908_174242_159267/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_3JMSRU9HQLB43U8MZ9TRP9PJ25YVEK",
                    "high_descs":[
                        "Turn around, head to the bath tub",
                        "Facing the mirror, take the towel off the holder on the wall",
                        "Turn around, take a few steps",
                        "Turn around, put the towel in the bath tub"
                    ],
                    "task_desc":"Take the towel from the wall, put it in the bath tub",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3TEM0PF1Q8EJINT60HUIYYH88XW0DG",
                    "high_descs":[
                        "turn left, walk to the tub, turn left, walk to the vanity",
                        "grab the towel on the wall",
                        "turn around, turn around walk to the tub",
                        "put the towel in the tub"
                    ],
                    "task_desc":"move the towel from the wall to the tub",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3IAS3U3I0IXXZ0Y0187QMWMN2ISB28",
                    "high_descs":[
                        "Walk to the edge of the right kitchen sink.",
                        "Grab the towel off of the ring.",
                        "Walk to the edge of the bathtub.",
                        "Place the towel inside the bathtub."
                    ],
                    "task_desc":"Move the towel from a ring to a bathrub.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Towel",
                "HandTowel"
            ]
        },
        "train/pick_and_place_simple-SprayBottle-None-GarbageCan-410/trial_T20190908_122436_280277/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3Z7ISHFUH3MCO2P3JBLBJRQV9VK8Z9",
                    "high_descs":[
                        "Turn to the toilet on your left. ",
                        "Pick up the blue spray bottle on the left side of the back of the toilet. ",
                        "Move over to the plastic bin on the floor, to the right of the toilet. ",
                        "Place the blue spray bottle in the bin on the floor. "
                    ],
                    "task_desc":"Put a spray bottle in the bin. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_36V4Q8R5ZNRIVZQGQGCHXGFMOXIMQB",
                    "high_descs":[
                        "Turn to the left to face the trash can.",
                        "Pick up the spray bottle from the left side of the toilet tank.",
                        "Hold the spray bottle and look right and then back left again.",
                        "Place the spray bottle in the trash can below."
                    ],
                    "task_desc":"Place a spray bottle in the trash can.",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3UNH76FOCVWR41H2HQTBA2ION69MYO",
                    "high_descs":[
                        "walk over to the toilet",
                        "pick up the spray bottle from the toilet tank",
                        "take the bottle to the trash bin",
                        "put the bottle in the bin"
                    ],
                    "task_desc":"take the bottle from the toilet and put it in the trash",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "SprayBottle",
                "ToiletPaper"
            ]
        },
        "valid_seen/pick_clean_then_place_in_recep-SoapBar-None-Toilet-410/trial_T20190906_201106_979461/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1HKHM4NVAO98H_3P4RDNWND8N7S4AEE35Z70CHY2NIJ1",
                    "high_descs":[
                        "go to the toilet in the bathroom",
                        "pick up the soap out of the black bin to the right of the toilet",
                        "walk over to the bathroom sink",
                        "place the soap inside the sink and rinse it off, then pick it back up",
                        "walk over to the toilet again",
                        "place the soap on top of the toilet"
                    ],
                    "task_desc":"place clean soap on top of the toilet",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3HL2LL0LEPZT8_37Q970SNZHPPR1X6TQT772MIDLHS1V",
                    "high_descs":[
                        "Turn right, go straight, then turn and face the trash bin to the right of the toilet.",
                        "Take the pink soap from the trash bin.",
                        "Turn right and go to the left sink.",
                        "Put the soap in the sink. Turn the water on then off. Take the soap from the sink.",
                        "Turn left, go to the toilet ahead.",
                        "Put the soap on top of the tank of the toilet."
                    ],
                    "task_desc":"Put a clean bar of soap on top of a toilet's tank.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3OS4RQUCRCWH0UACP3MX6FGCAR5BF9",
                    "high_descs":[
                        "Move to the black trash bin to the right of the toilet",
                        "Pickup the pink bar soap in the trash",
                        "Take the bar soap to the sink",
                        "Place bar soap in the sink and turn on the water then turn it off, pick up soap again",
                        "Head to the toilet",
                        "Place the bar soap on top of the toilet tank"
                    ],
                    "task_desc":"Wash bar soap from the trash to place back on the toilet tank",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "HandTowel",
                "Towel",
                "SoapBar",
                "Cloth"
            ]
        },
        "tests_seen/trial_T20190908_214707_663766/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and take a step to your right.",
                        "Pick up the yellow wash cloth that's to the left of the left sink.",
                        "Turn around and take a few steps then turn left and walk to the tub.",
                        "Put the cloth in the tub."
                    ],
                    "task_desc":"Put a wash cloth in the tub."
                },
                {
                    "high_descs":[
                        "Turn around and walk towards the tub, then turn left to face the counter.",
                        "Pick up the yellow rag off of the counter.",
                        "Turn around and walk towards the wall, then hang a left and walk over to the tub.",
                        "Put the yellow rag into the tub."
                    ],
                    "task_desc":"Move a yellow rag from the counter to the tub."
                },
                {
                    "high_descs":[
                        "Turn to the empty counter space between the two sinks, on your right. ",
                        "Pick up the yellow rag on the counter. ",
                        "Turn to the bathtub on your right. ",
                        "Place the yellow rag inside the bathtub. "
                    ],
                    "task_desc":"Put a rag in the bathtub. "
                }
            ],
            "relative_objects":[
                "Towel",
                "Cloth"
            ]
        },
        "tests_seen/trial_T20190908_122901_215923/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move to the counter on your right.",
                        "Pick up the rag on the counter. ",
                        "Bring the rag to the sink on your right.",
                        "Wash the rag in the right sink. ",
                        "Bring the cleaned rag to the top drawer under the right sink. ",
                        "Put the cleaned rag in the top right drawer, close the drawer. "
                    ],
                    "task_desc":"Put a cleaned rag in a drawer under the right sink. "
                },
                {
                    "high_descs":[
                        "Go to the right and turn left to face the counter in between the two sinks.",
                        "Pick the yellow cloth up from the counter.",
                        "Move to the right and turn to face the sink on the right.",
                        "Put the yellow cloth in the sink and turn the water on and then off and pick the yellow cloth up again.",
                        "Back up and face the drawer under the sink on the right.",
                        "Put the cloth in the drawer under the sink on the right and shut it."
                    ],
                    "task_desc":"Put a clean cloth in a drawer."
                },
                {
                    "high_descs":[
                        "Turn right and take a step right.",
                        "Pick up the rag on the counter.",
                        "Take a step right.",
                        "Wash the rag in the right sink.",
                        "Take a step back.",
                        "Place the rag in the drawer under the right sink."
                    ],
                    "task_desc":"Place a clean rag in a drawer."
                }
            ],
            "relative_objects":[
                "Cloth"
            ]
        },
        "tests_seen/trial_T20190906_201129_656124/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn right and walk to the toilet.",
                        "Pick up the soap from the toilet tank.",
                        "Turn right and go to the sink.",
                        "Wash the soap in the sink.",
                        "Turn around and walk to the toilet.",
                        "Place the soap on the toilet tank."
                    ],
                    "task_desc":"Place washed bar of soap on a toilet tank."
                },
                {
                    "high_descs":[
                        "Move towards the door and then turn right and move to the front of the toilet brush between the toilet and rubbish bin.",
                        "Pick up the bar of soap on the back right corner of the toilet cistern.",
                        "Turn around and move toward the shower door and then turn left and move towards the sink next to the wall.",
                        "Place the bar of soap in the sink in front of the rag, rinse the bar of soap with water, and pick the bar of soap up again.",
                        "Turn around and move to the right side of the toilet near the toilet brush.",
                        "Place the bar of soap on the front corner of the toilet cistern closest to the wall. "
                    ],
                    "task_desc":"Place a rinsed bar of soap on a toilet cistern."
                },
                {
                    "high_descs":[
                        "Go straight, turn right towards toilet.",
                        "Pick up soap near toilet.",
                        "Turn right, then turn left, go to sink.",
                        "Turn sink on, wash with soap.",
                        "Pick soap back up, turn left.",
                        "go straight, towards toilet, place soap back onto rack."
                    ],
                    "task_desc":"Pick up soap from toilet, use it, wash hands, place it back."
                }
            ],
            "relative_objects":[
                "Cloth",
                "Towel",
                "HandTowel",
                "SoapBar"
            ]
        },
        "tests_seen/trial_T20190908_122402_482968/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and go to the right side of the toilet. ",
                        "Pick up the spray bottle in front on top of the tank. ",
                        "Move over right to the trash can no the floor. ",
                        "Place the spray bottle in the trash can. "
                    ],
                    "task_desc":"Throw out one spray bottle into the trash can."
                },
                {
                    "high_descs":[
                        "Turn around and walk to the toilet then turn to your right and walk to the toilet brush.",
                        "Pick up the spray bottle closest to you on the back of the toilet.",
                        "Take a step to your right.",
                        "Put the spray bottle in the garbage."
                    ],
                    "task_desc":"Put a spray bottle in the garbage."
                },
                {
                    "high_descs":[
                        "Walk to the toilet behind you and to your left.",
                        "Grab the left spray bottle from the toilet.",
                        "Walk to the trash bin near the toilet.",
                        "Throw the spray bottle in the trash bin."
                    ],
                    "task_desc":"Dispose of a spray bottle."
                }
            ],
            "relative_objects":[
                "SprayBottle"
            ]
        }
    }
}