{
    "scene_name":"FloorPlan308",
    "trials":{
        "valid_unseen/pick_and_place_simple-BaseballBat-None-Bed-308/trial_T20190906_185515_986084/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_39L1G8WVWT8L7KCR3BS6ZUE6L2031Q",
                    "high_descs":[
                        "Turn around and walk to the door",
                        "Pick up the baseball bat in the corner",
                        "Turn around, walk around the bed",
                        "Put the bat on the bed"
                    ],
                    "task_desc":"Move the bat in the corner to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3EO896NRAZCX1IQP8F43L7EQ9IWJTA",
                    "high_descs":[
                        "turn around and walk over to the bat leaning against the wall",
                        "pick up the bat leaning against the wall",
                        "turn around and walk over to the left side of the bed",
                        "place the bat on top of the bed"
                    ],
                    "task_desc":"place a bat on top of the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3LQ8PUHQFO9B1YFOQ32EVNW2LA3HIF",
                    "high_descs":[
                        "Turn around, walk towards the door, turn right and walk towards the bat on the floor.",
                        "Pick up the bat from the floor.",
                        "Turn right, head towards the desk, turn right head towards the bed.",
                        "Place the bat on the bed."
                    ],
                    "task_desc":"Place the bat on the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "valid_unseen/pick_and_place_simple-BaseballBat-None-Bed-308/trial_T20190906_185530_954329/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A320QA9HJFUOZO_3DH6GAKTY16JIJUN07UOHIUV7HCZYJ",
                    "high_descs":[
                        "Turn left and walk to the opposite corner of the room by the door",
                        "Pick up the baseball bat from the corner of the room",
                        "Turn around and walk over to the side of the bed",
                        "Put the bat down on the bed just right of the green books"
                    ],
                    "task_desc":"Put the baseball bat on the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AE861G0AY5RGT_3V5Q80FXI08SW5UNMFSK4DOBD6L239",
                    "high_descs":[
                        "Left away from the desk, right at the bed and take a left at the end of the bed then take a right and go forward to the wall.",
                        "Pick up the bat leaning against the wall.",
                        "Turn right and go to the desk take a right at the desk and a left at the bed, go forward take a right and turn around to the right to the bed.",
                        "Place the bat on the bed in front of the right laptop."
                    ],
                    "task_desc":"To put a bat on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3FY6THWKRYN9M_3YHH42UU5EW2GZHYDYS6HBPDGVSL0O",
                    "high_descs":[
                        "Take left, walk toward bed, take right, take left at end of bed, take right to bat",
                        "Pick up the bat on the wall",
                        "take right, walk to desk, take right to side of bed",
                        "Set the bat down on the bed"
                    ],
                    "task_desc":"Bring bat from the wall to the bed.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "valid_unseen/pick_and_place_simple-BaseballBat-None-Bed-308/trial_T20190906_185459_653538/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AKW57KYG90X61_3O7L7BFSHH6ZHOOM02U8AKZPTWYIER",
                    "high_descs":[
                        "turn right, move towards the chair and turn left and move towards the door.",
                        "pick up the bat",
                        "turn around, move towards the chair, and then turn right and move towards the  bed",
                        "drop the bat on the bed"
                    ],
                    "task_desc":"place a bat on the bed",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3WEV0KO0OP9JJWDI9JD284NR2F5DSL",
                    "high_descs":[
                        "Turn right and begin walking across the room, then hang a left once past the table and walk over to the wall, then turn right and walk up to the bat in the corner of the room.",
                        "Pick up the black bat lying in the corner of the room.",
                        "Turn right and begin walk towards the wooden desk, then walk over to the side of the bed that is not against the wall.",
                        "Place the bat standing up on the bed in front and to the right of the closest laptop to you."
                    ],
                    "task_desc":"Place a bat standing up on the bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3A4TN5196NZKOVTOYT6SKKY785QHCK",
                    "high_descs":[
                        "head to the corner of the room with the baseball bat",
                        "pick up the baseball bat against the wall",
                        "bring the bat over to the bed",
                        "put the bat on top of the bed"
                    ],
                    "task_desc":"put a baseball bat on top of the bed",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "BaseballBat"
            ]
        },
        "valid_unseen/pick_and_place_simple-Pencil-None-Shelf-308/trial_T20190908_121952_610012/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_3R5F3LQFV5BF9UCJQSA7GDGVOZ4ZOH",
                    "high_descs":[
                        "Turn to the right",
                        "head to the desk in the corner",
                        "Take the pencil from the desk",
                        "Turn around twice, put the pencil on the desk"
                    ],
                    "task_desc":"Take the pencil from the desk, put it back on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3U5NZHP4LUTB39OQZ6HF56HG2FKPH1",
                    "high_descs":[
                        "Turn right at the trash can and walk to the left of the bed. Turn left at the desk to your left.",
                        "Pick up the white pencil on the desk.",
                        "Turn around in a circle.",
                        "Put the pencil back down on the desk by the books."
                    ],
                    "task_desc":"Walk to the desk and pick up a pencil also put it back.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3VW04L3ZLWXDY8QWQ19I25RDS4MXX0",
                    "high_descs":[
                        "Turn to your right and walk past the desk, then turn left and go to the end of the desk, closest to the wall. ",
                        "Pick up the pencil on the desk, to the right of the lamp. ",
                        "Move over to your left slightly so that you are right next to the blue office chair. ",
                        "Place the pencil back on the desk, in front of the keys."
                    ],
                    "task_desc":"Move the pencil on the desk over.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "valid_unseen/pick_and_place_simple-Pencil-None-Shelf-308/trial_T20190908_122024_052056/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_38JBBYETQR1DU6B5BLHLH598J36E4T",
                    "high_descs":[
                        "Turn to your right and walk forward a few steps, then turn back to your left and go to the end of the desk, where it meets the wall. ",
                        "Pick up the pencil in the middle of the desk, between the clear bowl and the keys. ",
                        "Move over to your right, so that you are directly in front of the books on the desk. ",
                        "Place the pencil in front of the books that are directly behind the glass bowl, on the desk."
                    ],
                    "task_desc":"Move a pencil on the desk over. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3GM6G9ZBKQOVNFI87K6C2LQ984FMTN",
                    "high_descs":[
                        "turn right, walk a few steps, turn left, walk towards the wall, turn left to face desk",
                        "pick up the pencil that is on the desk",
                        "turn around, take a step, turn right, take a step, turn right to face desk",
                        "put the pencil next to the dish on the desk"
                    ],
                    "task_desc":"move pencil from one side of desk to the other",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3M0NZ3JDP4PT1K61LDE877G475AZ5P",
                    "high_descs":[
                        "Turn right, head to the desk",
                        "take the pencil from the desk",
                        "turn around, take a few steps to the right, face the desk",
                        "Put the pencil on the desk"
                    ],
                    "task_desc":"Take the pencil from the desk, put it on the other side of the desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Desk"
            ]
        },
        "valid_unseen/pick_and_place_simple-Pencil-None-Shelf-308/trial_T20190908_122154_042763/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_3TVRFO09GN6IYE97CI6URBWQLVVXLX",
                    "high_descs":[
                        "Turn right and take one step, then turn left and walk across the room, then turn left to face the desk. ",
                        "Pick up the pencil near the edge of the desk. ",
                        "Turn around and take one step, then turn back around to face the desk. ",
                        "Put the pencil down directly in front of the set of books on the left. "
                    ],
                    "task_desc":"Move the pencil to a different area of the desk.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A31681CCEVDIH3_3WRFBPLXRDFW6G5E46FLXNBBJ8KN35",
                    "high_descs":[
                        "Walk forward and left to face the desk.",
                        "Pick up the white pencil from the desk.",
                        "Turn to face the desk.",
                        "Put the white pencil down on the desk close to the standing books on the lower left side."
                    ],
                    "task_desc":"Move a pencil farther back on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "valid_unseen/pick_and_place_with_movable_recep-Pencil-Bowl-Shelf-308/trial_T20190909_232711_494127/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A30M9SZYJKFDS9_39ASUFLU60Y4S8ZFVWJQEG66CFBEX6",
                    "high_descs":[
                        "go forward go to the right turn to the right towards the desk",
                        "pick up the pencil from the book shelf",
                        "turn to the left go right turn to the left go right turn to the right towards  the desk ",
                        "put the pencil inside the bowl that is in the desk",
                        "pick up the bowl from the desk",
                        "turn to the right go left go right turn to the left towards the book shelf ",
                        "put the bowl on top of the book shelf"
                    ],
                    "task_desc":"put a bowl with a pencil in it on the desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3CTOC39K3AHIO9FGRKQJHX6AFUOJ7X",
                    "high_descs":[
                        "Move forward to the end of the desk, then turn right to face the desk.",
                        "Pick up the pencil from the desk.",
                        "Turn around and move forward to the bed, then turn right and go to the desk ahead.",
                        "Put the pencil in the bowl on the desk.",
                        "Pick up the bowl from the desk.",
                        "Go across the room, then turn left and go toward the wall, then turn left to face the desk.",
                        "Put the bowl on the desk."
                    ],
                    "task_desc":"Put a bowl with a pencil in it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2DN53DIE3049T_3OJSZ2ATDVNAHA0V2IMPGNN5XTT57X",
                    "high_descs":[
                        "Turn to the right, walk to the desk",
                        "Pick up the pencil from the desk",
                        "Turn to the left, walk to the second desk",
                        "Place the pencil in the bowl on the desk",
                        "Pick up the pencil and the bowl from the desk",
                        "Turn to the right, walk to the bed, then turn left and walk to the other desk",
                        "Place the pencil and bowl on the desk, between the books"
                    ],
                    "task_desc":"collect pencil and bowl for the desk",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil",
                "Desk"
            ]
        },
        "valid_unseen/pick_and_place_with_movable_recep-Pencil-Bowl-Shelf-308/trial_T20190909_125415_131061/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36A780ODXBDEH_32SVAV9L3I0PMXBPV2AGBHRBK5C3A0",
                    "high_descs":[
                        "Turn around and go to the left side of the brown desk to the right of the window.",
                        "Pick up the pencil on the desk.",
                        "Turn right and move closer towards the desk.",
                        "Place the pencil in the glass bowl on the desk.",
                        "Pick up the glass bowl with the pencil in it.",
                        "Turn right and head to the other desk with the lamp on it.",
                        "Put the glass bowl with the pencil in it on the top right hand shelf on the desk."
                    ],
                    "task_desc":"Move  the glass bowl containing a pencil from the desk near the window to the bookshelf on the other desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3DZQRBDBSO6TMTXJC2W7WHLH6BX3SA",
                    "high_descs":[
                        "Turn around, hang a right at the bed and walk to the wooden desk on the right.",
                        "Pick up the white pencil from the left side of the desk.",
                        "Turn right and walk to the wooden desk on the left.",
                        "Put the pencil inside a clear bowl on the desk.",
                        "Pick up the clear bowl with the pencil inside from the desk.",
                        "Turn right and walk to the wooden desk on the left.",
                        "Put the bowl with the pencil inside on the top right shelf of the desk."
                    ],
                    "task_desc":"Put a bowl with a pencil on a shelf.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A29ZQYDG9Q6TPK_3PZDLQMM0WCOUUC4BGS2Y2C7EUCC2F",
                    "high_descs":[
                        "Turn left across the room and head towards the table on your right.",
                        "Pick up the pencil at the edge of the table.",
                        "Turn around right and back to the table.",
                        "Drop the pencil on the transparent plate on the table.",
                        "Pick up the transparent plate from the table.",
                        "Turn right around the room and head towards the book shelf on your left.",
                        "Put the transparent plate in the book shelf."
                    ],
                    "task_desc":"Put a transparent plate with pencil in a book shelf.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "valid_unseen/pick_and_place_with_movable_recep-Pencil-Bowl-Shelf-308/trial_T20190909_185126_784929/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_3ATTHHXXWDFG8D11RF9HZV4Y48FIXG",
                    "high_descs":[
                        "go to the desk",
                        "pick up the pencil from the desk",
                        "re-approach the desk where the bowl is",
                        "put the pencil in the bowl",
                        "pick up the bowl with the pencil",
                        "take the bowl to the right side of the desk",
                        "set the bowl on the desk between the two rows of books on the bottom shelf "
                    ],
                    "task_desc":"put a bowl and a pencil between the books on the desk",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3CPLWGV3MRQILIUULFGVO0EXJ3Y9NI",
                    "high_descs":[
                        "Turn around and go to the desk",
                        "Grab the pencil off of the desk",
                        "Look down at the desk",
                        "Put the pencil in the container on the desk",
                        "Grab the container off of the desk",
                        "Back up from the desk",
                        "Put the container down at the back of the desk"
                    ],
                    "task_desc":"Putting a container with a pencil in it on the desk",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3ND9UOO81NT39E4H2DA8PSIJCAGLWH",
                    "high_descs":[
                        "turn around, walk to desk",
                        "pick up the pencil that is on the desk",
                        "take a step back from the desk",
                        "put the pencil in the bowl",
                        "pick up the bowl with the pencil in it",
                        "take a few steps to the right",
                        "put the bowl with pencil between books on desk"
                    ],
                    "task_desc":"put a bowl with a pencil in it on the desk",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil",
                "Book"
            ]
        },
        "valid_unseen/look_at_obj_in_light-CD-None-DeskLamp-308/trial_T20190908_141958_463362/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_39LNWE0K4XNOR976MAYUFO5UA9NIUF",
                    "high_descs":[
                        "Go to the garbage can on the floor, to the right of the desk, in front of you. ",
                        "Remove the CD from the garbage bin. ",
                        "Turn to your right and walk across the room, turn right at the wall and go to the end of the desk on your left.",
                        "Turn on the lamp on the front, far, right corner of the desk. "
                    ],
                    "task_desc":"Turn on the desk lamp.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3EFE17QCRFW8G14IRNL90BMRPZLSHE",
                    "high_descs":[
                        "walk forward to the gray trash can",
                        "take the CD out of the gray trash can",
                        "turn right, walk across the room, turn left, walk to the wall, turn left to face the lamp on the desk",
                        "turn the lamp on"
                    ],
                    "task_desc":"examine a CD with a lamp",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3HHRAGRYXBW033U6MUG83PE29X9O9M",
                    "high_descs":[
                        "Walk across the room. ",
                        "Pick up the CD that is in the bin on the floor. ",
                        "Turn right and take three steps, then turn left and walk across the room, then turn left to face the desk. ",
                        "Turn on the lamp. "
                    ],
                    "task_desc":"Look at the CD in the light. ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD",
                "DeskLamp"
            ]
        },
        "valid_unseen/pick_and_place_simple-Mug-None-Desk-308/trial_T20190909_203041_433487/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_3FTF2T8WLU988C38DG7IKJROCZP9W0",
                    "high_descs":[
                        "walk around to the desk and face the middle row of books",
                        "Pick up the white mug from the top shelf",
                        "walk the mug around to the side of the desk",
                        "set the mug on the desk"
                    ],
                    "task_desc":"take the mug from the desk shelf to put it on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3GA6AFUKORF4WKJ318K8S3EFXJKH39",
                    "high_descs":[
                        "Turn left, move to the bed, go to the desk left of the bed, face the books on the shelf above the desk.",
                        "Pick up the mug on the shelf. ",
                        "Turn around, move to the side of the desk closer to the bed, face the side of the desk.",
                        "Put the mug on the desk. "
                    ],
                    "task_desc":"Move a mug from the shelf to the desk. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3GNCZX450LEWTMGCT07NOKUCPKJPAF",
                    "high_descs":[
                        "Walk around the bed to the front of the computer desk on your left.",
                        "Pick up the coffee cup from the top shelf of the desk.",
                        "Walk to the side of the computer desk.",
                        "Place the cup on the edge of the desk."
                    ],
                    "task_desc":"Move a cup from the top shelf to the edge of the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug"
            ]
        },
        "valid_unseen/pick_and_place_simple-Mug-None-Desk-308/trial_T20190909_210238_431966/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A11LSO6D7BMY99_31HQ4X3T3V1A2XN8I807S3FY6GALSU",
                    "high_descs":[
                        "go to the desk that is in front of a book shelf with a computer on it",
                        "pick up the white coffee mug from the book shelf",
                        "go to the left end of the desk",
                        "place the mug on the left end of the desk"
                    ],
                    "task_desc":"take a coffee mug from a book shelf and place it on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3RJSC4XJ13LWZZ0BHJ1G18DIPYH50T",
                    "high_descs":[
                        "Turn to the right and then the left to the other side of the room, and face the desk on the left side. Look up to the books on the shelf.",
                        "Pick up the cup from the shelf.",
                        "Carry the cup and turn to the left and then face the desk on the right side. ",
                        "Place the cup on the short side of the desk, close to you."
                    ],
                    "task_desc":"Move a cup from the shelf to the desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2RUHO7I7Y4XFA_3WAKVUDHUZ7R2PQA3JUXOZFLWTL7UI",
                    "high_descs":[
                        "Turn right at the brown desk and walk between the bed and the desk. Turn left at the orange cylinder on the right of the bed on the floor. Walk to the desk on your left with a laptop on it.",
                        "Pick up the white coffee mug that's on the desk.",
                        "Turn around and walk to the bed. Turn right at the bed.",
                        "Put the coffee mug back down on the left side of the desk to the right of the bed."
                    ],
                    "task_desc":"Pick up a coffee mug from the desk and put it down on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Mug",
                "Book"
            ]
        },
        "valid_unseen/pick_two_obj_and_place-CD-None-Safe-308/trial_T20190907_051056_585414/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1KFTQRBMXSC13_37ZHEEHM6Z3ZI6RTSR9F045JPCR37R",
                    "high_descs":[
                        "Turn around and go to the table. ",
                        "Pick up the CD on the right.",
                        "Turn right, go straight, turn left, go straight to the white safe and open the door. ",
                        "Place the CD inside the safe and close the door. ",
                        "Turn around, walk towards the bed, turn right and go to the table. ",
                        "Pick up the remaining CD.",
                        "Turn right, go straight, turn left, go straight to the white safe and open the door. ",
                        "Place the CD inside the safe and close the door. "
                    ],
                    "task_desc":"Move the CD's from the table to the safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "valid_unseen/look_at_obj_in_light-BasketBall-None-DeskLamp-308/trial_T20190907_161210_531813/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1DMXEJGJY02E1_33SA9F9TR0BHIJ8RPJYNBB8X964WEJ",
                    "high_descs":[
                        "Turn around and go to the foot of the bed.",
                        "Pick up the basketball from the floor.",
                        "Turn around and go to the desk in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a basketball in the lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3DOCMVPBTQVVPVCQQHAJ5FPFULJNNO",
                    "high_descs":[
                        "Turn left and walk to the basketball on the floor by the bed.",
                        "Pick up the basketball from the floor.",
                        "Turn left and walk to the lamp on the desk which is to the left of the bed.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a basketball by the light of a desk lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3SKRO2GZ748R3IKYOHK5GGV8XP2K11",
                    "high_descs":[
                        "Move to the foot of the bed closest to the wall",
                        "Pick up the basketball sitting on the floor next to the foot of the bed",
                        "Carry the basketball to the left side of the wooden desk top",
                        "Turn on the lamp that is on top of the desk"
                    ],
                    "task_desc":"Turn on a lamp while holding a basketball",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "DeskLamp"
            ]
        },
        "valid_unseen/look_at_obj_in_light-AlarmClock-None-DeskLamp-308/trial_T20190908_222951_616606/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_39OWYR0EPNILYRPLV3PYFCYFQALYFR",
                    "high_descs":[
                        "Turn around and walk to the right then turn left and walk to the desk. ",
                        "Pick up the metal box that is on top of the desk. ",
                        "Turn right then turn left and walk around to the other side of the desk. Turn right to face the desk.",
                        "Use the metal box to turn on the lamp. "
                    ],
                    "task_desc":"Turn on a lamp with a metal box. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_3II4UPYCOMYFR5K3DNDEEQSSFOJQD0",
                    "high_descs":[
                        "Turn around and walk forward, then turn left and walk up to the side of the wooden desk",
                        "Pick up the alarm clock from the desk",
                        "Walk forward around to the right side of the desk",
                        "Turn on the lamp on the desk"
                    ],
                    "task_desc":"Examine the alarm clock under the light of the desk lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3QUO65DNQXFYNVI9K5BZZL1GMMOOUQ",
                    "high_descs":[
                        "Turn around and walk to the the desk behind the wall, to your left. ",
                        "Pick up the alarm clock, on the desk, in front of the blue chair. ",
                        "Walk past the desk and turn left, then go to the lamp on the end of the desk, by the wall. ",
                        "Turn on the lamp in the front, right corner of the desk. "
                    ],
                    "task_desc":"Turn on a desk lamp. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "DeskLamp"
            ]
        }
    }
}