{
    "scene_name":"FloorPlan228",
    "trials":{
        "train/pick_and_place_with_movable_recep-Watch-Box-DiningTable-228/trial_T20190908_215647_492785/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A255A9FFZD8PQW_3E4GGUZ1TBI6DSOS3T90MLPFJN32K4",
                    "high_descs":[
                        "Turn around completely then walk forward. Turn to the left and walk to the table.",
                        "Pick up the watch from the table.",
                        "Turn around completely and walk forward. Turn to the right then turn to the right again to face the coffee table.",
                        "Put the watch in the box.",
                        "Pick up the box from the coffee table. ",
                        "Turn to the right then turn to the left again to walk back to the table.",
                        "Place the box on the table. "
                    ],
                    "task_desc":"Place a watch in the box and place on the table. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3VHHR074H68OJZ3GU52WXCJ2J3YL7A",
                    "high_descs":[
                        "Head to the round dinner table",
                        "Grab the watch off of the table",
                        "Walk in front of the red sofa and face the coffee table",
                        "Put the wrist watch in the cardboard box on the table",
                        "Grab the box off of the table",
                        "Head to the dinner table",
                        "Put the box on the table"
                    ],
                    "task_desc":"Putting a cardboard box with a wrist watch in it on the dinner table",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AKW57KYG90X61_3C5W7UE9CIH24WRSCU79ROBFLDKMXD",
                    "high_descs":[
                        "move  right and head to the table",
                        "pick up the wrist watch from the table",
                        "turn around and head to the center table",
                        "drop the watch in the carton on the table",
                        "pick up the carton",
                        "move left to the dining table",
                        "place the carton on the table"
                    ],
                    "task_desc":"place a carton with a watch in it on the table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Box-DiningTable-228/trial_T20190908_215623_067168/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_37C0GNLMHIUMHN1JYEZG8LB1FIDD6M",
                    "high_descs":[
                        "Go forward to the couch, then turn left and move forward, then turn left to face the coffee table.",
                        "Pick up the watch on the coffee table.",
                        "Turn left, step forward, then turn left to face the couch.",
                        "Put the watch in the box on the couch.",
                        "Pick up the box from the couch.",
                        "Turn left, go forward, turn left at the end of the coffee table, then go straight to the round table.",
                        "Put the box on the round table."
                    ],
                    "task_desc":"Put a box with a watch in it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2JBNDG0U9IA6I_3FE2ERCCZ0ZLVQAD3JC5PFEHE1ZOPP",
                    "high_descs":[
                        "Walk straight then turn left at the red sofa and then left again to face the coffee table",
                        "Pick up the watch from the middle of the coffee table",
                        "Turn around and face the red sofa with the box on the seat cushion",
                        "Place the watch inside the box on the sofa cushion",
                        "Pick up the box with the watch inside from the red sofa ",
                        "Turn left and walk straight then turn left at the grey sofa and walk straight to the round table",
                        "Place the box on the round table top"
                    ],
                    "task_desc":"Have a watch inside a box on the round table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3JPSL1DZ5VQWQ14ZDLUVKVPHP5ENAD",
                    "high_descs":[
                        "Walk over to the coffee table.",
                        "Pick up the watch off of the coffee table.",
                        "Turn left and walk forward, then turn left to face the red couch.",
                        "Put the watch in the cardboard box that is on the seat of the couch.",
                        "Pick up the cardboard box with the watch in it off of the couch.",
                        "Turn left and walk around the coffee table to the round table in the corner of the room.",
                        "Put the cardboard box with the watch in it on the round table."
                    ],
                    "task_desc":"Put a cardboard box with a watch in it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Watch"
            ]
        },
        "train/look_at_obj_in_light-Watch-None-FloorLamp-228/trial_T20190907_172716_701600/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F51C49T9A34D_30X31N5D667LLPA6P9M0I3FLIGYSAX",
                    "high_descs":[
                        "turn to the left and take a few steps forward and turn to the left and go to the sofa and turn to the left and take a few steps and turn to the left facing the coffee table",
                        "pick up the watch from the coffee table",
                        "turn to the left and go to the wall and turn to the left and step forward to the floor lamp",
                        "turn on the floor lamp"
                    ],
                    "task_desc":"Examine a watch by the light of a floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_320DUZ38GA3TWD4JOF5WMOZ1KTJJG7",
                    "high_descs":[
                        "Moe across the room to the coffee table",
                        "Pick up the wrist watch that is next to the statue",
                        "Carry the wrist watch to the large floor lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry a watch while turning on a lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3QY5DC2MXU1WWTJIPU3SB5800U2FUL",
                    "high_descs":[
                        "Turn around and face the brown table by the statue.",
                        "Pick the watch up from the table.",
                        "Turn around and walk to face the lamp with the pink base.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Turn a lamp on with a watch in hand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_two_obj_and_place-Statue-None-DiningTable-228/trial_T20190906_222705_543880/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3I3WADAZ9TL9HR6WNWEAQNPYSE1O5Y",
                    "high_descs":[
                        "Walk to the coffee table the is in front of you off to the left.",
                        "Pick up the black statue that is closest to you ",
                        "Turn around and head to the table in front of you.",
                        "Place the statue on the table",
                        "Turn around and head to the other side of the coffee table in front of you.",
                        "Pick up the statue on the right ",
                        "Head across the room to the table in front of you.",
                        "Place the statue on the table to the right of the previously placed statue. "
                    ],
                    "task_desc":"Place statues on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-228/trial_T20190907_055122_673179/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_336YQZE83YVLHOLKAGZXYJ0TYX85MP",
                    "high_descs":[
                        "Turn around and walk to the door you can see behind the table then turn right and walk to the table.",
                        "Pick up the keys you see on the table.",
                        "Turn around and walk until you're about two feet from the green garbage and turn left and walk to the red couch and turn right to walk to the red wall then turn left and walk to the lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Turn on a lamp as you hold keys.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3R5F3LQFV517O5QLUKLQFRWTUWUOZT",
                    "high_descs":[
                        "Turn around and walk halfway across the room, then turn right and walk across the room before turning right to walk to the table. ",
                        "Take the keys that are next to the newspaper off the table. ",
                        "Turn to the right and walk across the room to the trash bin, then turn left and walk across the room, then turn right to face the lamp. ",
                        "Turn the lamp on. "
                    ],
                    "task_desc":"To look at the keys in the light. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3TK8OJTYM4280LXC8N92JLONGQ9PV0",
                    "high_descs":[
                        "Turn around and walk to the dining table.",
                        "Pick up the key chain on the table that is to the left of the newspaper.",
                        "Turn around and walk to the front of the floor lamp in the top right corner of the room.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a key chain by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-228/trial_T20190907_055048_650574/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3T9K2RY06UO14_336YQZE83YVLHOLKAGZXYJ0TY4H5MC",
                    "high_descs":[
                        "Turn around and go to the round table.",
                        "Pick up the keys on the round table. ",
                        "Turn around and go to the lamp by the window.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Get the keys from the round table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3AAJC4I4FJ9TNUZOE7TL7VF7VAHZJY",
                    "high_descs":[
                        "turn right and walk to the end of the room, then turn left and walk over to the table ahead",
                        "grab the keys off of the table there",
                        "turn around and walk to the red couch, then hang a right and walk over to the TV at the end of the room, then turn left and walk to the lamp",
                        "turn on the lamp in the corner of the room there"
                    ],
                    "task_desc":"turn on a lamp while holding keys",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3LEP4MGT3JHK2AWGYXR7IFDRZNXDBR",
                    "high_descs":[
                        "Turn to your right, then turn left walk straight to the  round table",
                        "Pick up the keys on the edge of the round table",
                        "Turn around to your left then walk a little, turn right past the sofa, turn left facing the lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine the keys by the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_326O153BMLFI9D808OTXJNJC2O3EDT",
                    "high_descs":[
                        "Walk around the coffee table to the dining table in front of you to the right.",
                        "Pick up the keys from the dining table.",
                        "Turn around and walk to the floor lamp that is to the right of the red sofa.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a set of keys by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_34J10VATJIFOERER9TP841O3DXLQI7",
                    "high_descs":[
                        "turn right, walk between couch and coffee table, turn left, walk towards kitchen table",
                        "pick up the keys that are on the table",
                        "turn around, walk towards couch, turn right, walk between couch and coffee table, turn left, walk to lamp, hold keys up to lamp",
                        "turn on the lamp"
                    ],
                    "task_desc":"examine keys with the lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3J2UYBXQQOTKXEERQUM4SS7GR1M06H",
                    "high_descs":[
                        "Go right and turn left to stand in front of the round table.",
                        "Pick the keys up from the table.",
                        "Turn around and cross the room to face the lamp with the pink base.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Turn a lamp on with keys in hand.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Plate",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Sofa-228/trial_T20190908_122649_115988/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A12HZGOZQD5YK7_3DZQRBDBSO6TMTXJC2W7WHLH6UAS3E",
                    "high_descs":[
                        "Turn around and go to the other side of the room, turn left to face the end of the table.",
                        "Pick up the keys from the table.",
                        "Turn right and turn towards the last sofa cushion.",
                        "Put the keys on the sofa cushion."
                    ],
                    "task_desc":"Put the keys on the sofa.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3U84XHCDIF4B512178VY2FAQ79EZ4J",
                    "high_descs":[
                        "Turn right and take a step forward, then turn right again and walk over to the far end of the coffee table.",
                        "Pick up the set of keys off of the coffee table.",
                        "Turn right and walk towards the table, then hang a left and walk forward, turn around to face the tan couch.",
                        "Put the seat of keys on the front edge of the leftmost couch cushion."
                    ],
                    "task_desc":"Move a set of keys to a couch.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3ZAZR5XV049E05FG0N1GLDMEZMNZCO",
                    "high_descs":[
                        "Turn around, head across the room to the coffee table",
                        "Take the keys from the table",
                        "Take a few steps to the right, turn around",
                        "Put the keys on the couch"
                    ],
                    "task_desc":"\nTake the keys from the coffee table, put them on the couch",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Sofa-228/trial_T20190908_122625_912366/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3PPLDHC3CG0YN_34T446B1C35HYK9QWTOOFEJSHFY0CR",
                    "high_descs":[
                        "Turn left and walk over to the other tide of the television stand. ",
                        "Pick up the keys that are behind the television on the television stand. ",
                        "Turn right and walk to the red couch on the right. ",
                        "Put the keys down on the couch to the left of the laptop. "
                    ],
                    "task_desc":"To move a set of keys to the couch. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3QFUFYSY91650KB16W1RZNU8V444FK",
                    "high_descs":[
                        "Turn left and walk to the tv stand then take a step left and walk to the red arm chair then turn right  and walk to the wall then turn right to face the side of the tv.",
                        "Pick up the keys that are by the tv's base.",
                        "Turn right and walk to the spot on the couch to the left of the laptop that's on your right and turn right to face it when you get there.",
                        "Put the keys near the edge of the couch in the crack to the left of the laptop."
                    ],
                    "task_desc":"Put the keys on the couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3TVSS0C0E4RRSRCMBMCZBJS066BTW3",
                    "high_descs":[
                        "Turn left and walk to the table, then turn left and take two steps, then turn right and take three steps, then turn right and then right again to face the table. ",
                        "Pick up the keys that are being the television on the table. ",
                        "Turn right and take three steps, then turn right to face the couch.",
                        "Put the keys down on the middle of the couch."
                    ],
                    "task_desc":"Move the keys to the couch. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-Statue-None-CoffeeTable-228/trial_T20190906_185451_580211/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3MHW492WW3U2FI0ZG7HA2HUSAXIVMH",
                    "high_descs":[
                        "Go to the table behind you and to the left.",
                        "Take the statue from on the table.",
                        "Turn right and go to the coffee table in front of the sofa.",
                        "Place the statue on the coffee table, next to the vase."
                    ],
                    "task_desc":"Put a statue on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3RKNTXVS3PF2J48VZ8QIK0ZF3UMA4M",
                    "high_descs":[
                        "Turn right and walk to the door, turn right walk to the table",
                        "Grab the statue on the table",
                        "Turn around and walk around the table to the coffee table",
                        "Put the statue on the coffee table"
                    ],
                    "task_desc":"Move the statue on the dining table to the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3ZAZR5XV04Z6FGTI4FCZKR2C4UXZCG",
                    "high_descs":[
                        "Move to the round table.",
                        "Pick up the man statue from the table. ",
                        "Bring the statue to the coffee table.",
                        "Put the statue down on the right side of the coffee table. "
                    ],
                    "task_desc":"Put the statue down on the right side of the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Statue"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-CoffeeTable-228/trial_T20190918_185454_494409/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3LS2AMNW5I7YADPU7O2DOYKPPGAQOC",
                    "high_descs":[
                        "Turn around and walk to the brown couch.",
                        "Pick up the keys on the couch near the box.",
                        "Place the keys in the box.",
                        "Pick up the box.",
                        "Turn around and walk to the right side of the coffee table and face it.",
                        "Place the box on the center of the table."
                    ],
                    "task_desc":"Place a box with keys in it on a table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AIICJA0A5J8NF_3NC5L260MR31JOZLT8RJCZGBIDZOFC",
                    "high_descs":[
                        "Turn around, walk to the light brown sofa. ",
                        "Pick up the keys in front of the box on the sofa. ",
                        "Put the keys in the box on the sofa. ",
                        "Pick up the box on the sofa. ",
                        "Turn around, walk to the coffee table. ",
                        "Place the box in front of the computer on the coffee table. "
                    ],
                    "task_desc":"Place the keys in the box on the coffee table. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3WS1NTTKE1TGG772RNP8MYKTKCYF0W",
                    "high_descs":[
                        "Turn around and cross the room to face the brown couch with the box on it.",
                        "Pick the keys up from the couch.",
                        "Put the keys in the box on the couch.",
                        "Pick the box up from the couch.",
                        "Turn around and face the brown table in front of the couch.",
                        "Put the box down on the table to the right of the computer."
                    ],
                    "task_desc":"Put a box on a table.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-CoffeeTable-228/trial_T20190908_004155_444217/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFU00NU09CFXE_33SA9F9TR0BHIJ8RPJYNBB8X9G2WE1",
                    "high_descs":[
                        "Turn around and cross the room to stand between the coffee table and sofa, facing the sofa.",
                        "Pick up the keys from the rightmost cushion of the sofa.",
                        "Turn around, pass the television, and stop in front of the small black table with an open box on top.",
                        "Place the keys in the open box on the table.",
                        "Pick up the box with the keys in it from the table.",
                        "Turn around and carry the box to the coffee table so you are facing the red sofa when you stop.",
                        "Place the box with keys inside on the coffee table."
                    ],
                    "task_desc":"Place a box with keys in it on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3RKNTXVS3PF2J48VZ8QIK0ZF489A42",
                    "high_descs":[
                        "Turn around and walk to the red couch.",
                        "Pick up the keys that are in front of you.",
                        "Turn around and walk until you're even with then small black table to the right of the tv and when you are turn left and walk to it.",
                        "Put the keys in the box on the table.",
                        "Pick up the box.",
                        "Turn around and walk to the middle of the coffee table.",
                        "Put the box on the coffee table."
                    ],
                    "task_desc":"Put a box with keys in it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3UNH76FOCVMJJCV4LI4U9GYMTQSMYE",
                    "high_descs":[
                        "Turn around and walk up to the right side of the red couch.",
                        "Pick up the set of keys off of the seat of the couch.",
                        "Turn right and take a step forward, then turn right and begin walking across the room, hang a left and walk up to the small black table.",
                        "Put the set of keys in the cardboard box on the small black table.",
                        "Pick up the cardboard box with the keys in it off of the table.",
                        "Turn around and walk forward, then turn right to face the coffee table.",
                        "Put the cardboard box with the keys in it on the coffee table."
                    ],
                    "task_desc":"Put a cardboard box with keys in it on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Plate-CoffeeTable-228/trial_T20190908_235628_443203/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_39K0FND3AK6Q8JJZ1KFV7G0HKK4MAM",
                    "high_descs":[
                        "Turn right and go across the room to the couch, turn left, then turn left to face the coffee table.",
                        "Pick up the watch nearest to you on the coffee table.",
                        "Turn right and go forward, then turn left at the couch and go straight, to the round table.",
                        "Put the watch on the plate on the round table.",
                        "Pick up the plate from the round table.",
                        "Turn left and go forward, then turn left to face the coffee table.",
                        "Put the plate on the coffee table."
                    ],
                    "task_desc":"Put a plate with a watch on it on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A17TKHT8FEVH0R_3D4CH1LGEDKCBQD8YB30YG50IGH9GT",
                    "high_descs":[
                        "Turn right and stand in front of the red sofa and look at the coffee table",
                        "Grab the watch off of the table",
                        "Turn right and go to the round dinner table",
                        "Put the watch on the plate on the table",
                        "Grab the plate off of the table",
                        "Turn around and go to the coffee table",
                        "Put the plate on the table"
                    ],
                    "task_desc":"Putting a plate with a watch on it on the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3VJ40NV2QLEJNI3KK0LPUPFE39YOTI",
                    "high_descs":[
                        "Turn right then head straight then turn left face the table in front of the sofa on your left",
                        "Pick up the wrist watch on the center table",
                        "Turn right then head to the round table",
                        "Put the wrist watch on the plate on the round table",
                        "Pick up the plate with wrist watch",
                        "Turn left head walk straight then turn left on the center table",
                        "Put the plate with wrist watch on the center table"
                    ],
                    "task_desc":"Put the plate with wrist watch on the center table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Plate-CoffeeTable-228/trial_T20190908_235519_761542/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1O3TWBUDONVLO_3JV9LGBJWW5FIDHE00MIV60PDFBGOM",
                    "high_descs":[
                        "Turn right and walk around to face the couch side of the living room table.",
                        "Pick up the watch on the living room table.",
                        "Turn left and walk across the room to face the kitchen table.",
                        "Place the watch on the plate on the kitchen table.",
                        "Pick up the plate with a watch on it on the kitchen table.",
                        "Turn right and walk forward to face the living room table.",
                        "Place the plate with a watch on it on the living room table."
                    ],
                    "task_desc":"To put a watch on a plate plus move them to the living room table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1G1OO4IWM8EP5_3TY7ZAOG5IBZHILEO65M3XW0MT4K0V",
                    "high_descs":[
                        "Turn right.  Walk to the other side of the room.  Turn left at the couch.  Walk to the middle of the couch and turn left, facing the coffee table.",
                        "Pick up the watch on the coffee table.",
                        "Turn left and walk to the edge of the couch.  Turn right and walk to the other side of the room.  At the wall, turn right.  Walk to the kitchen table.",
                        "Put the watch down on the plate sitting on the kitchen table.",
                        "Pick up the plate with the watch on it.",
                        "Turn around.  Turn left toward the coffee table and turn left at the coffee table.",
                        "Sit the plate with the watch down on the coffee table at the nearest right corner, next to the box."
                    ],
                    "task_desc":"Put a watch on a plate and moved it to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3Z7VU45IP18UD25IKQCW4H3NVUU1Z8",
                    "high_descs":[
                        "Take a step forward, then turn right and walk across the room, turn left before the red couch and walk over to the side of the coffee table.",
                        "Pick up the watch off of the coffee table.",
                        "Turn left and walk forward, hang a right after the coffee table and walk across the room, turn right before the wall and walk over to the round table.",
                        "Put the watch on the closest black and white plate on the table.",
                        "Pick up the plate with the watch on it off of the table.",
                        "Walk over to the closest side of the coffee table.",
                        "Put the black and white plate with the watch on it onto the front right corner of the coffee table."
                    ],
                    "task_desc":"Put a plate with a watch on it on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Box-Sofa-228/trial_T20190908_153153_601583/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_36PW28KO42NSWVRMKMRCU8V8BFWAEY",
                    "high_descs":[
                        "Turn to your left and walk to the end of the table, then turn left again and go past the table, then turn right going around to the other side of the table. ",
                        "Pick up the credit card in front of the cardboard box on the right side of the coffee table. ",
                        "Move over to your left so that you are in front of the cardboard box on the left side of the coffee table. ",
                        "Place the credit card in the cardboard box on the left side of the coffee table. ",
                        "Pick up the box with the credit card inside. ",
                        "Turn around so that you are facing the red couch. ",
                        "Place the box with the credit card inside on the right side of the remote, on the couch. "
                    ],
                    "task_desc":"Put a box containing a credit card on the couch. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3RKNTXVS3PPA4TUTVGFZLMJHYPM4A4",
                    "high_descs":[
                        "Turn left and walk towards the wall, then hang a right and walk around to the other side of the coffee table.",
                        "Pick up the credit card off of the coffee table.",
                        "Turn left and walk over to the couch, then turn right and walk around to the other side of the coffee table.",
                        "Put the credit card in the rightmost cardboard box on the coffee table.",
                        "Pick up the cardboard box with the credit card in it off of the coffee table.",
                        "Turn left and walk forward, then turn left to face the red couch.",
                        "Put the cardboard box with the credit card in it on the seat of the couch."
                    ],
                    "task_desc":"Put a cardboard box with a credit card in it on the couch.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3YMTUJH0DV7FJPT21G6GGR99MEW4TE",
                    "high_descs":[
                        "Move around to the other side of the coffee table, turn to face the card on the table.",
                        "Pick up the card on the table. ",
                        "Bring the card back around to the other side of the table, face the box on the right side of the table.",
                        "Put the card in the right box on the table. ",
                        "Pick up the box with card on the table. ",
                        "Turn around, bring the box to the red couch. ",
                        "Put the box with card on the red couch. "
                    ],
                    "task_desc":"Put a box with a credit card in it on the red couch. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Plate-SideTable-228/trial_T20190907_194425_124590/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_34QN5IT0T2871SXFJ9J2C637XY4807",
                    "high_descs":[
                        "Turn right, move forward, then turn right to face the left end of the table.",
                        "Pick up the watch on the table, to the left of the keys.",
                        "Turn left, then turn right to face the end of the table.",
                        "Put the watch on the left most plate on the table.",
                        "Pick up the plate with the watch on it.",
                        "Turn around, then turn right, then go forward, then turn right to face the table with the television on it.",
                        "Put the plate on the table, behind the television."
                    ],
                    "task_desc":"Put a plate with a watch on it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3LOTDFNYAAG9OX8NKUITTTTXL6IFWH",
                    "high_descs":[
                        "Turn to your right, face the center table on your right",
                        "Pick up the wrist watch on the center table",
                        "Turn to your left then face the tray on the table",
                        "Place the wrist watch on the tray",
                        "Pick up the tray with wrist watch on the table",
                        "Turn around to your right then go straight at the left side of the tv stand",
                        "Put the tray with wrist watch on the back side of the tv stand"
                    ],
                    "task_desc":"Put the tray with wrist watch at the back of the tv stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3ZOTGHDK5LSANT47ZSRIJYZQ7WFSO7",
                    "high_descs":[
                        "Turn around and move towards the brown table. ",
                        "Take the wrist watch to the left of the keys.",
                        "Move to the left of the table.",
                        "Place the wrist watch on the plate on the left.",
                        "Take the plate and the wrist watch on it.",
                        "Turn left and go to the brown end table with a computer monitor and white vase on it.",
                        "Place the plate with wrist watch behind the monitor."
                    ],
                    "task_desc":"Put the wrist watch on a plate behind the computer monitor.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-Sofa-228/trial_T20190908_130200_176412/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A028LRDJB7ZB_3HWRJOOET8TWWRDG1MD3F8PEXKDES6",
                    "high_descs":[
                        "Turn right walk across the room past the center table turn left facing the table",
                        "Pick up the keys on the center table",
                        "Move a little closer to the box at the table",
                        "Put the keys in the box",
                        "Pick up the box with keys",
                        "Turn right face the sofa ",
                        "Put the box with keys on the sofa close to the newspaper"
                    ],
                    "task_desc":"Put the box with keys on the sofa ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3N2BF7Y2VTL5I6RD7QPNO2NLXB3HMT",
                    "high_descs":[
                        "Turn around, move to the far side of the coffee table, turn left, move to the middle of the coffee table, turn left to face the keys on the coffee table. ",
                        "Pick up the keys on the coffee table.",
                        "Bring the keys to the box on the coffee table.",
                        "Put the keys in the box on the coffee table. ",
                        "Pick up the box with keys on the table. ",
                        "Turn around, bring the box to the red couch.",
                        "Put the box on the red couch."
                    ],
                    "task_desc":"Put a box with keys on the red couch. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1198W1SPF1R4_3WT783CTPE8II7C0U9LDZVFB8LABC7",
                    "high_descs":[
                        "Turn around and walk across the room to the red couch. Stop at the red couch and then turn left. Stop at the brown table. ",
                        "Take the keys from the table.",
                        "Turn left and stop at the edge of the table.",
                        "Put the keys into the white box on the brown table.",
                        "Take the white box from the table.",
                        "Turn around to the right to face the red couch.",
                        "Put the white box on the red couch."
                    ],
                    "task_desc":"Put keys into a white box and put the white box onto the red couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-Sofa-228/trial_T20190908_130048_547195/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1OWHPMKE7YAGL_34PGFRQONR2XEOGHZSYV9D5R851JW7",
                    "high_descs":[
                        "Turn around, go forward to the table, turn to the right to face the couch.",
                        "Pick up the set of keys that is on the couch.",
                        "Turn to the right, go forward to the table on the right where the cardboard box is. ",
                        "Put the keys inside the cardboard box that is on the table. ",
                        "Pick up the cardboard box from the table. ",
                        "Turn to the right, go forward, hang a left, turn around to face the couch.",
                        "Put the cardboard box down on the center cushion of the couch."
                    ],
                    "task_desc":"Put a cardboard box containing keys on a couch.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3EG49X351X30FT60PE0S2SETV1IX63",
                    "high_descs":[
                        "Turn around and walk to the left side of the couch on your right and then turn right to face it when you get there.",
                        "Pick up the keys that are in front of you.",
                        "Turn right and walk to the side of the coffee table on your right turning right to face it when you get there.",
                        "Put the keys in the box on the coffee table.",
                        "Pick up the box with the keys in it.",
                        "Turn around and take a step to your left then take a step back.",
                        "Put the box on the couch where the cushion all the way to the left meets the middle cushion near the edge."
                    ],
                    "task_desc":"Put a box with keys in it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3R5F3LQFV5BF9UCJQSA7GDGVO1BOZH",
                    "high_descs":[
                        "Turn around, move forward toward the end of the couch, then turn right.",
                        "Pick up the keys from the couch.",
                        "Turn right, move forward, then turn right to face the coffee table.",
                        "Put the keys in the box on the coffee table.",
                        "Pick up the box from the coffee table.",
                        "Turn right, move forward, turn left, then turn around to face the couch.",
                        "Put the box on the couch."
                    ],
                    "task_desc":"Put a box with keys in it on the couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Laptop",
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-CoffeeTable-228/trial_T20190909_010447_443796/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_34HJIJKLP8NUWHXR6B6VH9XUJ32V4J",
                    "high_descs":[
                        "Turn to the right and find the round table.",
                        "Pick up the keys from the back of the table.",
                        "Place the keys on the plate in between the computers on the table.",
                        "Pick up the plate from the table.",
                        "Carry the plate and turn around, then left and face the coffee table on the right.",
                        "Place the plate on the coffee table, on the right side."
                    ],
                    "task_desc":"Move keys and a plate to the coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3RWE2M8QWK10PO6HLJX2VPD4GOKN0E",
                    "high_descs":[
                        "Walk forward, then turn right and walk over to the round table.",
                        "Pick up the set of keys off of the round table.",
                        "Put the set of keys on the plate that is on the round table.",
                        "Pick up the plate with the keys on it off of the table.",
                        "Turn around and walk towards the wall, then turn left and walk over to the coffee table.",
                        "Put the plate with the keys on it on the coffee table in front of the statue."
                    ],
                    "task_desc":"Put a plate with keys on it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ABR580YP0ST7X_33PPUNGG3BWI674ZIKRBA8L0ZROZR0",
                    "high_descs":[
                        "Turn right, walk to table",
                        "Pick up keys off of table",
                        "Put keys on plate on table",
                        "Pick up plate with keys off of table",
                        "Turn around, walk past table, turn left, walk forward past table, turn left, walk forward, turn right facing coffee table",
                        "Put plate with keys on coffee table"
                    ],
                    "task_desc":"Pick up keys with plate off of kitchen table and move to coffee table",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Plate-CoffeeTable-228/trial_T20190909_010419_678976/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CY7IOJ9YH136_32SCWG5HIKVV6K493NQB8FSQT6P6PC",
                    "high_descs":[
                        "turn around, go to space between couch and coffee table, face coffee table",
                        "pick up keys to the right of remote on coffee table",
                        "go around coffee table to dining table with chairs",
                        "place keys on gray tray closest to laptop on dining table",
                        "pick up gray tray with key from table",
                        "turn right, go to front of coffee table",
                        "place tray with keys on coffee table"
                    ],
                    "task_desc":"place tray with keys on coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_33C7UALJVOPFT64VB0CJRX6JWL981W",
                    "high_descs":[
                        "turn around and walk over to the front of the coffee table in between the sofa and the coffee table",
                        "grab the keys off of the coffee table",
                        "move forwards to the end of the room while maneuvering around the coffee table, once you're at the end of the room turn right to face the dining room table",
                        "place the keys down on the plate towards the center of the dining table",
                        "pick the keys up off of the dining table",
                        "turn around and walk back over to the back side of the coffee table",
                        "place the plate down on the coffee table there"
                    ],
                    "task_desc":"place a plate with keys on it on top of the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_35K3O9HUAE4NSM8UV2D4896Z8YOEF0",
                    "high_descs":[
                        "Turn around and walk over to the right side of the wooden coffee table.",
                        "Pick up the set of keys off of the coffee table.",
                        "Turn left and walk towards the wall, then turn right and walk forward, hang a right and walk up to the round table.",
                        "Put the set of keys on the rightmost plate that is on the table.",
                        "Pick up the plate with the keys on it off of the round table.",
                        "Walk back over to the coffee table.",
                        "Put the plate with the keys on it on the coffee table."
                    ],
                    "task_desc":"Put a plate with keys on it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Plate",
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190908_122604_076897/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and walk to the side of the brown table closer to the red sofa.",
                        "Pickup the keys from the table.",
                        "Turn around and face the red sofa.",
                        "Put the keys on the sofa to the right of the newspaper."
                    ],
                    "task_desc":"Move the keys from the brown table to the red sofa."
                },
                {
                    "high_descs":[
                        "Turn around and walk left around the side of the coffee table to the side near the couch.",
                        "Pick up the set of keys on the coffee table.",
                        "Turn around and face the couch.",
                        "Place the keys on the couch to the right of the newspaper."
                    ],
                    "task_desc":"Place a set of keys on a couch."
                },
                {
                    "high_descs":[
                        "Walk around to the coffee table on the sofa's side.",
                        "Grab keys from the table.",
                        "Look at the red sofa behind you.",
                        "Put the keys on the sofa."
                    ],
                    "task_desc":"Move keys from the table to the sofa."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        }
    }
}