{
    "scene_name":"FloorPlan203",
    "trials":{
        "train/pick_two_obj_and_place-Laptop-None-Ottoman-203/trial_T20190907_034519_385647/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3HVVDCPGTH9NW7LOUF56VUTENIVTYX",
                    "high_descs":[
                        "Go straight and to the left to in between the wall and the coffee table, face the coffee table.",
                        "Take the lap top from the coffee table.",
                        "Turn to the right.",
                        "Put the lap top on the right side of the foot stool.",
                        "Turn left, go straight to the couch, move left to face the left couch cushion.",
                        "Take the lap top from the left couch cushion.",
                        "Turn around, go straight, turn left, go towards the foot stool.",
                        "Put the lap top on the left side of the foot stool"
                    ],
                    "task_desc":"Put 2 lap tops on a foot stool",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Laptop"
            ]
        },
        "train/pick_two_obj_and_place-Laptop-None-Ottoman-203/trial_T20190907_034427_986385/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AJNQ2PBD07FKE_3HPZF4IVNPA6AQJD8TAG6KTAZOWYC4",
                    "high_descs":[
                        "turn around, before the couch turn right, after the table turn left and once to right of table turn left.",
                        "pick up the laptop off of the table.",
                        "turn to the right with your laptop. ",
                        "head forward and then take a left in front of the chair. ",
                        "when facing the couch to the right close the other laptop ",
                        "pick up the other laptop.",
                        "take a right after table and right again, turn back around to face the ottoman  ",
                        "put the laptop down on ottoman "
                    ],
                    "task_desc":"moving the laptop. ",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Laptop"
            ]
        },
        "train/pick_two_obj_and_place-Laptop-None-Ottoman-203/trial_T20190907_034356_767031/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_3SNVL38CI79BQLUW4E9PXCEZ1NZCKR",
                    "high_descs":[
                        "Go around the blue sofa to its front. ",
                        "Close the black laptop further back and pick it up.",
                        "Turn around to go to the arm chair with foot rest.",
                        "Place the laptop on the foot rest. ",
                        "Turn around and go back to the blue sofa. ",
                        "Close and pick up the other laptop on the sofa.",
                        "Turn around to go back to the arm chair.",
                        "Place the laptop on the foot rest next to the other laptop. "
                    ],
                    "task_desc":"Move the laptops from the sofa to the foot rest.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3BDCF01OG0BZDUDJL63F93JXTCQLYH",
                    "high_descs":[
                        "Turn left to face the wall, walk until reach the end of the couch, turn right, walk to the ottoman, turn right.  Walk along the couch until the last section where two laptops and a credit card are placed.",
                        "Close the laptop that is farther away from you, closest to the red blanket.  Pick it up.",
                        "Turn around, walk to the wall, turn left towards the chair and ottoman.",
                        "Place the laptop on the right side of the ottoman, with the opening facing the wall.",
                        "Turn around, walk to the fireplace, turn right towards the couch, walk to the couch.",
                        "Close the laptop in front of you and pick it up.",
                        "Turn around, walk to the wall, turn left and walk to the ottoman.",
                        "Place the laptop on the left side of the ottoman, next to the other one, with the opening end facing you."
                    ],
                    "task_desc":"Close and move both laptops from the couch to the ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Ottoman",
                "Sofa",
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Plate-CoffeeTable-203/trial_T20190907_203410_039885/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1OWHPMKE7YAGL_337RC3OW08JI90IEGVGV24F3BW6VL2",
                    "high_descs":[
                        "Go forward to the dining table, then hang a left and go to the table with the plant on it. ",
                        "Pick up the pencil that is on the table. ",
                        "Turn to the right and go to the dining table. ",
                        "Put the pencil on the gray plate that is on the dining table. ",
                        "Pick up the gray plate that is on the dining table. ",
                        "Turn left, go forward past the couch, then turn left and go to the table that is in front of the couch. ",
                        "Put the plate on the table to the right of the white vase."
                    ],
                    "task_desc":"Put a plate and pencil on a table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_34S6N1K2ZY0DRZNUB6ZRN3OU3GYHLZ",
                    "high_descs":[
                        "Move to the end table to the right of the fire place",
                        "Pick up a pencil from the end table",
                        "Move to the dining table to the right of you",
                        "Put the pencil on a plate on the table",
                        "Pick up a plate from the table with the pencil",
                        "Move to the coffee table to the left of the fire place",
                        "Place the plate on the coffee table"
                    ],
                    "task_desc":"Put a plate with a pen on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3OCHAWUVGR1ZTJ5RVA5CBPZ927LKX3",
                    "high_descs":[
                        "Go forward, turn left at the table, move forward, then turn right to face the table with a plant on it.",
                        "Pick up the pencil on the table, to the left of the keys.",
                        "Turn right, move forward, then turn left to face the table.",
                        "Put the pencil on the plate, on the table.",
                        "Pick up the plate from the table.",
                        "Turn left, go forward, turn left, then go forward to face the table in front of the couch.",
                        "Put the plate on the table, to the right of the vase."
                    ],
                    "task_desc":"Put a plate with a pencil on it on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Plate-CoffeeTable-203/trial_T20190907_211333_922716/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3M81GAB8A30ERJ0L3JXRIEKQI95BQR",
                    "high_descs":[
                        "Walk towards the wall, then turn left and walk across the room to the small black table that is against the wall to the right of the fireplace.",
                        "Pick up the pencil that is closest to the keys on the small black table.",
                        "Turn left and walk over to the couch, then turn left again and walk across the room, hang a left and walk up to the large wooden table.",
                        "Put the pencil on the grey plate that is on the large wooden table next to the two white vases.",
                        "Pick up the grey plate with the pencil on it.",
                        "Turn left and walk towards the fire place, then turn left and walk up to coffee table.",
                        "Put the grey plate with the pencil on it on the coffee table just below the watch."
                    ],
                    "task_desc":"Put a grey plate with a pencil on it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PGS1Q1XAY79I_39KFRKBFIQC7JFGGYYJ71KNROICYOU",
                    "high_descs":[
                        "Walk in the direction of the door, hang a left at the stairs, walk toward the dining room table, hang a left toward the direction the fireplace, stop at the brown table to the right of the fireplace.",
                        "Pick up the middle pencil on the brown table.",
                        "Turn around and walk to the dining room table at the end with the two white vases and brown tray.",
                        "Place the pencil inside the tray.",
                        "Pick up the tray with the pencil in it.",
                        "Turn towards your left and walk in the direction of the fireplace, hang a left at the front of the purple couch, turn toward the table with drawers across from the front of the couch.",
                        "Place the tray at the left front of the table with drawers and in front of the wrist watch and remote control."
                    ],
                    "task_desc":"Pick up a pencil, place it in a tray, move the tray to the table in front of the couch",
                    "votes":[
                        1,
                        1,
                        0,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3X73LLYYQ4V3FZQFNJF60VSJ8JJHN2",
                    "high_descs":[
                        "Turn to the left and go across the room, then left again to find the small table along the wall.",
                        "Pick up the pencil from the short side of the table.",
                        "Carry the pencil and turn around, then left at the dining table.",
                        "Place the pencil on the plate that is in the middle of the table.",
                        "Pick up the plate from the middle of the table. ",
                        "Carry the plate and pencil and turn to the left and then the right to find the coffee table.",
                        "Place the plate and pencil on the coffee table."
                    ],
                    "task_desc":"Move a plate and pencil to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Plate"
            ]
        },
        "train/pick_and_place_with_movable_recep-TissueBox-Plate-DiningTable-203/trial_T20190907_104230_556185/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_30MVJZJNHPUEH3HBA9ZMU7DEFYWJ9N",
                    "high_descs":[
                        "Turn around, walk across the space between sofa and coffee table",
                        "Grab the plate on the table",
                        "Turn right, walk to the black table, turn right, and turn left, walk to the window, turn right, facing the dining table",
                        "Put the plate down on the table behind the bowl",
                        "Grab the tissue box on the right",
                        "Put it in the plate on the side"
                    ],
                    "task_desc":"Move the plate from the coffee table to the dining table, put the tissue box in the plate",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2WKZI3JQCE3Z6_3CP1TO84PWIVAKHR0YGDJAMVSSA52H",
                    "high_descs":[
                        "Turn left and move to the couch, turn left again and move to the chair, turn right and move to the center of the coffee table, turn left to face the coffee table.",
                        "Pick up the dish on the coffee table.",
                        "Turn right and move past the couch, turn right and move to the wooden floor, turn left before the kitchen table, move forward all the way to the wall, turn right and move to the middle of the kitchen table, turn right and move to the table.",
                        "Place the plate on the center of the kitchen table to the left of the bowl.",
                        "Pick up the box of tissue on the right.",
                        "Place the box of tissue on its end on the plate on the table."
                    ],
                    "task_desc":"Put a box of tissue on its end on the plate on the kitchen table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2DN53DIE3049T_3SEPORI8WQGIM1WKK1G8EWCO5J4AZ2",
                    "high_descs":[
                        "Cross the room and go to the couch ",
                        "Get the plate off the coffee table",
                        "Turn around, cross the room, and take the plate to the kitchen table behind you",
                        "Set the plate down on the kitchen table",
                        "Get a box of tissues off the table",
                        "Set the box of tissues on the plate with the tissues facing your left"
                    ],
                    "task_desc":"Get a plate from the coffee table",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox",
                "Plate"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Ottoman-203/trial_T20190908_123712_283630/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2KAGFQU28JY43_3NC5L260MRD94DLJPGG0DL0DCVUFOV",
                    "high_descs":[
                        "Turn to your left and go to the black end table on the wall, across from the couch. ",
                        "Pick up the keys that are behind the white vase, on the black end table. ",
                        "Turn around and go through the living room, to the purple ottoman. ",
                        "Place the keys on the left side of the cell phone, on the ottoman."
                    ],
                    "task_desc":"Put the keys on the ottoman.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3UJ1CZ6IZKGW08KNQLK0BEJ1KQJS5M",
                    "high_descs":[
                        "Turn left, go forward toward the wall, then turn right, step forward and then turn left to face the small table.",
                        "Pick up the keys on the table.",
                        "Turn around and go right, go around the coffee table and go straight to go to the chair with the ottoman.",
                        "Put the keys on the ottoman, to the left of the cell phone."
                    ],
                    "task_desc":"Move the keys to the ottoman.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A14IPKOBOPID9H_317HQ483IAJBWJNXP9M81TD02DHINA",
                    "high_descs":[
                        "Turn left and go to the end of the sofa, then turn right then left to face the table",
                        "Pick up the keys from the table",
                        "Turn around and go to the chair then turn right and go to the fireplace and go around the coffee table and head to the ottoman",
                        "Put the keys on the ottoman"
                    ],
                    "task_desc":"Move the keys from the table to the ottoman",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CreditCard",
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-Ottoman-203/trial_T20190908_140430_032812/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3CFJTT4SXWHMTYVA925J5WRA2Y4I7R",
                    "high_descs":[
                        "turn right, walk forward, turn right before the purple chair, walk past purple chair and ottoman, turn left, take a couple steps, turn right, take a few steps, turn right to face coffee table",
                        "pick up the keys that are on the coffee table",
                        "turn right, walk towards purple ottoman",
                        "put the keys on the purple ottoman"
                    ],
                    "task_desc":"move keys from coffee table to ottoman",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AO33H4GL9KZX9_3QFUFYSY91650KB16W1RZNU8V4TF4K",
                    "high_descs":[
                        "Turn right to go to the living and go around to the other side of the coffee table. ",
                        "Pick up the keys on the coffee table.",
                        "Turn right to to the the foot rest of the arm chair. ",
                        "Place the key on the right from corner of the foot rest."
                    ],
                    "task_desc":"Move the keys on the table to the foot rest ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3X87C8JFV92LTU3LAD839PESGMQQSH",
                    "high_descs":[
                        "Turn right and walk all the way to the purple chair. Then turn right and walk around the outside of the coffee table to the back side.",
                        "Pick up the keys on the coffee table.",
                        "Turn right and walk to the ottoman.",
                        "Place the keys on the ottoman in the front right corner."
                    ],
                    "task_desc":"Place a set of keys on an ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-203/trial_T20190909_060210_354107/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2Z43TA0WZ0EG0_31Z0PCVWUN6C2CBL3E4NJ3TJDNU7TN",
                    "high_descs":[
                        "Turn left and head towards The blue chair in front of the blue ottoman with the newspaper on top of it.",
                        "Pick up the keys from the cushion of the blue chair.",
                        "Turn left and then right to go behind the blue chair towards the tall lamp.",
                        "Turn the tall lamp on next to the box."
                    ],
                    "task_desc":"Pick up the keys and then turn the lamp on behind the blue chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_36DSNE9QZ8PP9F7F867LSJS55ABJOI",
                    "high_descs":[
                        "Turn around and walk into the living room, turning left again to face the arm chair and ottoman",
                        "Pick up the keys from the arm chair",
                        "Turn left and walk around behind the arm chair to the floor lamp",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Examine the keys under the light of the floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_388U7OUMFASL4MY9EQEJ49IEHOR0R3",
                    "high_descs":[
                        "turn to the left and at the staircase turn to the left and move forward to the chair with the ottoman in front of it, move around the chair to face the ottoman that is in front of the chair",
                        "pick up the set of keys that is sitting on the chair",
                        "turn to the left and go around to the back of the chair to the tall lamp in the corner",
                        "turn on the lamp"
                    ],
                    "task_desc":"examine a set of keys by the light of the tall lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "CreditCard",
                "KeyChain"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-203/trial_T20190909_060050_754328/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3KB8R4ZV1HYVZJS5WVHWPM0Q6J6BGX",
                    "high_descs":[
                        "Turn to the left and then right. Turn left and left to face the coffee table.",
                        "Pick up the keys from the short side of the coffee table.",
                        "Carry the keys and turn left and right to move past the coffee table. Turn right behind the chair to find the lamp in the corner.",
                        "Hold the keys and turn on the lamp."
                    ],
                    "task_desc":"Locate keys and turn on the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_3QY5DC2MXUB4HI5GL2S9CRS2UPDUFY",
                    "high_descs":[
                        "walk through living room to face coffee table",
                        "pick up set of keys from table",
                        "walk around couch to face floor lamp",
                        "turn on floor lamp"
                    ],
                    "task_desc":"turn on floor lamp while holding set of keys",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3W2LOLRXLE6NHC5DIJO1NTXNVMPKRL",
                    "high_descs":[
                        "Turn left and walk around the inside of the couch to the side of the coffee table closest to the fireplace.",
                        "Pick up the keys.",
                        "Walk left around the coffee table and blue chair, then veer right to the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at a set of keys by the light of a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-CoffeeTable-203/trial_T20190906_190100_142881/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AUTYWXILTACCR_32UTUBMZ7JD6WRW2PIR1O1JYY2BVBX",
                    "high_descs":[
                        "Turn around and walk to the coffee table on your right.",
                        "Pick up a phone from the coffee table.",
                        "Turn around and walking to the dining table on your right.",
                        "Place the phone in a bowl on the table.",
                        "Pick up the bowl from the table.",
                        "Turn around and walk back to the coffee table.",
                        "Place the bowl on the coffee table."
                    ],
                    "task_desc":"Place a bowl with a phone in it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_34FNN24DCPQLB5AYTJN8SEN06OP5YF",
                    "high_descs":[
                        "Turn right towards the ottoman, turn right towards the middle of the table, and then turn left to face the cellphones on the table.",
                        "Pick up the cellphone that is closest to you.",
                        "Turn right, walk past the sofa, turn right towards the table.",
                        "Place the cellphone in the gray bowl on the table.",
                        "Pick up the bowl.",
                        "Turn around, walk towards the sofa, make a right towards the table.",
                        "Place the bowl on the table."
                    ],
                    "task_desc":"Place the cellphone in a bowl on the table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3H8DHMCCWCSLVD0A4A40HIWHLQWDKI",
                    "high_descs":[
                        "Move to the coffee table.",
                        "Pick up the phone next to the computer on the coffee table.",
                        "Bring the phone to the dining table. ",
                        "Put the phone in the bowl on the dining table.",
                        "Pick up the bowl with phone on dining table. ",
                        "Bring the bowl with phone to the coffee table.",
                        "Put the bowl with phone on the coffee table next to the computer. "
                    ],
                    "task_desc":"Put a phone in a bowl on the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CellPhone"
            ]
        },
        "train/pick_and_place_with_movable_recep-CellPhone-Bowl-CoffeeTable-203/trial_T20190906_190025_596359/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFU00NU09CFXE_3FIJLY1B6XLJ4OBM884Y1ZL1RB0FPA",
                    "high_descs":[
                        "Turn and cross the room until you get to the stairs, turn right again and move through the kitchen to the head of the table. ",
                        "Pick the cell phone up from the table. ",
                        "Carry the cell phone to the other end of the table.",
                        "Place the phone in the grey bowl on the table. ",
                        "Pick up the bowl with the phone in it from the table. ",
                        "Move along side the kitchen table to the living room and end standing between the sofa and the coffee table. ",
                        "Place the bowl with the cell phone in it on the coffee table to the left of the laptop."
                    ],
                    "task_desc":"Move a cell phone in a bowl to the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3WMOAN2SREE8X0LZS8WAFWJSFSDVNC",
                    "high_descs":[
                        "turn right and walk to the end of the stairs, then turn right again and walk over to the dining table",
                        "grab the cellphone off of the dining table",
                        "walk around to the other side of the dining table",
                        "place the cellphone in a bowl",
                        "pick up the bowl with the cellphone in it",
                        "move to the left side of the dining table and face turn to face the same direction, then walk forwards across the room to the coffee table on your left",
                        "place the bowl down on the coffee table"
                    ],
                    "task_desc":"place a bowl with a cellphone in it down on the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3XUHV3NRVNFZPAK9JJJK6ESXGR15H3",
                    "high_descs":[
                        "Turn right and walk around the stairs to the closest short side of the kitchen table.",
                        "Take the cell phone off the table.",
                        " Walk around the table to the other short side.",
                        "Place the cell phone in the bowl on the table.",
                        "Pick up the bowl.",
                        "Walk forward and after the couch veer left to the coffee table.",
                        "Place the bowl on the table to the left of the laptop."
                    ],
                    "task_desc":"Put a bowl with a cell phone in it on a coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "CoffeeTable",
                "CellPhone"
            ]
        },
        "train/look_at_obj_in_light-CreditCard-None-FloorLamp-203/trial_T20190909_052719_823536/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_3300DTYQT58KJBY39IOYK8ADF3SEQV",
                    "high_descs":[
                        "look down and turn left then walk straight towards the stairs and turn left and walk straight towards the chair and turn right and walk straight towards the couch and turn right",
                        "pick up the credit card behind the book on the couch",
                        "turn right then walk straight towards the chair then turn left and walk straight then turn right again and walk straight to the wall and turn right and walk to the lamp and look up",
                        "turn the lamp on"
                    ],
                    "task_desc":"Pick up a credit card and view it in the light of the lamp",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ASP32QB28TEZU_3IXEICO795ATYCXGK4ZVDPTNIC36TG",
                    "high_descs":[
                        "Turn around walk towards couch, turn left walk towards chair, turn right, walk to couch",
                        "Pick up the credit card on the right side of the couch",
                        "Turn right, walk towards wall, turn right after chair, walk towards the box on the floor",
                        "Turn on the floor lamp"
                    ],
                    "task_desc":"Retrieve on credit card from couch, turn on floor lamp behind chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A255A9FFZD8PQW_3RYC5T2D76KOS32TVBT9JAJMPWSRPQ",
                    "high_descs":[
                        "Turn to the left and go forward to the couch. Turn to the left once then right and walk around it make another right to face the couch. ",
                        "Pick up the credit card from the couch.",
                        "Turn to the right and walk forward. Go around the chair and go forward. Turn right to face the lamp. ",
                        "Use the credit card to turn on the lamp. "
                    ],
                    "task_desc":"Turn on a lamp with a credit card. ",
                    "votes":[
                        0,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_two_obj_and_place-Bowl-None-CoffeeTable-203/trial_T20190907_153529_699181/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3Y9N9SS8L1SFZFS3J4C10WFFBSMD3W",
                    "high_descs":[
                        "Turn left and cross the room to the black table that is sitting along the right wall",
                        "Pick up the bowl that is sitting on the shelf",
                        "Turn left and head to the brown table that is sitting in the middle of the room",
                        "Place the bowl on the table in front of the laptop that is on the right.",
                        "Turn to the right and walk to the black table, then hang a right and cross the room, at the wall take a left and walk to the dining table",
                        "Pick up the bowl that is sitting on the dining table",
                        "Turn left and take a few steps the hang a right and cross the room, take a left after the black table against the wall and walk to the brown table in the middle of the room",
                        "Place the bowl on the table to the right of the bowl that is already sitting there"
                    ],
                    "task_desc":"Place bowls on a table",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl"
            ]
        },
        "train/pick_two_obj_and_place-RemoteControl-None-Ottoman-203/trial_T20190906_182910_532448/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AO33H4GL9KZX9_30IQTZXKANNXGTYNRHVUS5K0OI0X0D",
                    "high_descs":[
                        "Go around the sofa and the arm chair and get to the other side of the coffee table. ",
                        "Pick up the remote on the table.",
                        "Turn right and go to the arm chair and the foot rest. ",
                        "Place the remote between the phone and the newspaper.",
                        "Turn around and go around the table and the sofa to face the left side of the sofa.",
                        "Pick up the remote on the sofa seat.",
                        "Go around the coffee table back to the arm chair.",
                        "Place the remote on the foot rest behind the phone next to the first remote. "
                    ],
                    "task_desc":"Put both remotes on the foot rest. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A203C9REA20IT3_3QL2OFSM99ZCYRFZ1R15P4V2SV3CNG",
                    "high_descs":[
                        "Turn around and head to the far end of the coffee table",
                        "Pick up the remote on the coffee table",
                        "Turn to the right",
                        "set the remote down between the newspaper and the phone closest to you on the foot stool",
                        "Turn around and walk past the fireplace, turn right and go to the left side of the couch with the red jacket on it.",
                        "Pick up the remote that's on the couch",
                        "go back to the foot stool",
                        "set the remote down on the foot stool"
                    ],
                    "task_desc":"Put both the remotes on the foot stool",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl"
            ]
        },
        "train/pick_and_place_simple-Newspaper-None-Ottoman-203/trial_T20190908_190823_442359/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3FTF2T8WLU988C38DG7IKJROC3CW9I",
                    "high_descs":[
                        "Turn left and take a step then turn left and walk to the chair then take a step to your left and walk just past the chair then turn right and walk to the table to the left of the chair at the head of the table where the newspaper is.",
                        "Pick up the newspaper that's in front of you.",
                        "Turn around and walk to the wall then turn left and walk to the couch then turn right and walk to the fireplace then turn left and walk to the coffee table then turn right and walk to the wall then turn left and walk to the ottoman.",
                        "Put the newspaper on the right edge of the ottoman near the bottom right corner."
                    ],
                    "task_desc":"Put a newspaper on the ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3KV0LJBBH5CI705G3V1H26PRKN5MR5",
                    "high_descs":[
                        "Turn left and walk up to the stairs, then hang a left and walk across the room to the far side of the large wooden table.",
                        "Pick up the newspaper off of the large wooden table.",
                        "Make your way to the purple chair with the foot stool in front of it.",
                        "Put the newspaper on the right side of the foot stool."
                    ],
                    "task_desc":"Move a newspaper to a foot stool.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A24RGLS3BRZ60J_3X66WABAJZ9QWOOSH22Q732EIOJ3GI",
                    "high_descs":[
                        "Turn around and move across the room, and face the table on the right.",
                        "Pick up the newspaper from the left corner.",
                        "Carry the newspaper and turn to the left. Turn right to go in the next room. Move forward past the furniture and then left to see the ottoman and chair.",
                        "Place the newspaper on the ottoman, to the right side."
                    ],
                    "task_desc":"Move a newspaper to the ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper",
                "Pillow"
            ]
        },
        "train/pick_and_place_simple-Newspaper-None-Ottoman-203/trial_T20190908_173724_161102/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_34Q075JO104XBHZSGWZ4YI01DM710A",
                    "high_descs":[
                        "Turn around and move to the other room with the blue couch.",
                        "Pick up the newspaper from the blue chair.",
                        "Hold the newspaper and turn to the right then the left and face the blue chair on the left.",
                        "Place the newspaper on the blue ottoman."
                    ],
                    "task_desc":"Move the newspaper from the chair to ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_39LOEL67OVWB39IAY4Q2FQLGU4V83U",
                    "high_descs":[
                        "Walk over to the purple chair behind you.",
                        "Pick up the newspaper off of the seat of the purple chair.",
                        "Walk over to the front of the foot stool that is in front of the purple chair.",
                        "Place the newspaper on the right side of the foot stool."
                    ],
                    "task_desc":"Move a newspaper to a foot stool.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3FE2ERCCZ0ZLVQAD3JC5PFEHE5WPOV",
                    "high_descs":[
                        "Turn around and cross the room to face the purple chair with the newspaper on it.",
                        " Pick the newspaper up from the chair.",
                        "Turn to the right and then the left to face the ottoman.",
                        "Put the newspaper down on the ottoman."
                    ],
                    "task_desc":"Put a newspaper on an ottoman.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Newspaper"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Ottoman-203/trial_T20190908_110606_176017/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_3LWJHTCVCFDCPPYZ4T842QVDRX1FQU",
                    "high_descs":[
                        "Move forward, head around the corner to the right, to the side side of the coffee table with the computer on it.",
                        "Pick up the computer on the coffee table. ",
                        "Bring the computer forward to the purple ottoman.",
                        "Put the computer on the ottoman, to the right of the keys. "
                    ],
                    "task_desc":"Put a computer on the ottoman. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AISNLDPD2DFEG_3OVHNO1VE9SO5XLU0JWR5J4WKNGZD7",
                    "high_descs":[
                        "Turn right, go to the wall, turn left, go forward, turn right at the couch, go forward, turn left and go to the coffee table",
                        "Close the laptop on the coffee table and pick it up",
                        "Go to the chair on the other side of the coffee table",
                        "Put the laptop on the leg rest in front of the chair"
                    ],
                    "task_desc":"Bring the laptop to the leg rest",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3C6FJU71TTKAH9MBQSKX1CZI0T6UYK",
                    "high_descs":[
                        "Turn right, hang a left at the wall, turn right at the couch and turn left at the fireplace to walk to the wooden coffee table ahead.",
                        "Close the lid of the laptop computer and pick it up from the table.",
                        "Turn right, hang a left at the wall and walk to the ottoman of the black chair ahead.",
                        "Put the laptop computer on the right side of the ottoman near the chair."
                    ],
                    "task_desc":"Place a laptop computer on an ottoman.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Ottoman",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Ottoman-203/trial_T20190908_110656_971485/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_38BQUHLA9ZRFAND0B3KD8BKM9X2OM9",
                    "high_descs":[
                        "Turn around, move to the computer on the coffee table.",
                        "Pick up the computer on the coffee table.",
                        "Bring the computer to the ottoman on the other side of the coffee table.",
                        "Put the computer down on the ottoman, left of the phone. "
                    ],
                    "task_desc":"Put a computer on the ottoman. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3DHE4R9OCZ21B6S9D2OLOTXMC6QG2J",
                    "high_descs":[
                        "Turn around and go to the end of the coffee table, behind you. ",
                        "Shut the laptop closed and pick it up from the coffee table. ",
                        "Go to the ottoman in front of you, on the other side of the coffee table. ",
                        "Place the laptop on the ottoman, to the left of the cell phone. "
                    ],
                    "task_desc":"Put the laptop on the ottoman. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3OS4RQUCRC6PLJWALBBE710E5XMBF0",
                    "high_descs":[
                        "Turn right and take one step then turn right and walk to the table.",
                        "Close the laptop and then pick up the laptop from the table. ",
                        "Turn right and take one step then turn left and walk to the purple chair. ",
                        "Put the laptop down to the left of the red cell phone on the purple chair."
                    ],
                    "task_desc":"Move the laptop to the chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Laptop"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-CoffeeTable-203/trial_T20190908_140937_602898/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A17TKHT8FEVH0R_3KMS4QQVK5HQEM04ROO764J4SR8KF6",
                    "high_descs":[
                        "Go straight and stop at the black end table",
                        "Grab a pencil off of the table",
                        "Turn right and stop at the dinner table",
                        "Put the pencil in the bowl on the table",
                        "Grab the bowl off of the table",
                        "Turn left and go to the coffee table",
                        "Put the bowl down on the table"
                    ],
                    "task_desc":"Putting a bowl with a pencil in it on the coffee table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3N4BPTXIOBJFX4XUMDJ6S4K72DZUKP",
                    "high_descs":[
                        "Turn left, turn right walk straight then face the drawer on your right",
                        "Pick up the second pencil from the plant on top of the drawer",
                        "Turn right walk straight then turn left on the table",
                        "Put the pencil in the bowl",
                        "Pick up the bowl with pencil on the table",
                        "turn right walk straight then head to the center table on you right",
                        "Put the bowl with pencil on the center table"
                    ],
                    "task_desc":"Put the bowl with pencil on the center table",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_36ZN444YTUPTE4N9QOMLGID5SOIION",
                    "high_descs":[
                        "walk into the living room, face the side table on the right with a plant",
                        "pick up the right pencil from the side table",
                        "turn right, walk to face the dining room table",
                        "place the pencil into the bowl on the table",
                        "pick up the bowl from the dining room table",
                        "walk into the living room, face the coffee table",
                        "put the bowl on the coffee table to the left of the white vase"
                    ],
                    "task_desc":"put a bowl and pencil on the living room coffee table",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "train/pick_and_place_with_movable_recep-Pencil-Bowl-CoffeeTable-203/trial_T20190908_140741_719621/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_3OVR4I9USSA2R91AKCCLBMYM2624Q3",
                    "high_descs":[
                        "Turn right, hang a left at the stairs, cross the room and turn right just before the chair to face the dining table.",
                        "Pick up the pencil from the right corner of the table.",
                        "Turn around, hang a right at the wall, head right towards the window and turn right at the window to face the dining table.",
                        "Put the pencil inside of the gray bowl to the right of the vase on the table.",
                        "Pick up the bowl with the pencil inside of it from the table.",
                        "Turn around, head left along the wall, turn right at the edge of the couch, and turn left around the arm of the couch to walk to the wooden coffee table on the right.",
                        "Put the bowl with the pencil to the right of the laptop computer on the coffee table."
                    ],
                    "task_desc":"Place a bowl with a pencil on a table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3RXCAC0YIUGCXLUYTJXMYKAPYIQG8I",
                    "high_descs":[
                        "Turn right, hang a left at the stairs and walk to the wooden table on the right.",
                        "Pick up the pencil from the corner of the table.",
                        "Turn around, take a right at the wall and walk to the table on the right.",
                        "Put the pencil inside the black bowl to the right of the vase.",
                        "Pick up the bowl with the pencil from the table.",
                        "Turn around, walk around the table to the left, take a right at the couch and walk to the wooden coffee table.",
                        "Put the bowl with the pencil on the coffee table to the right of the laptop."
                    ],
                    "task_desc":"Place a bowl with a pencil on a table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A30M9SZYJKFDS9_3Z4XG4ZF4BINJ7POITXQM6AK1VZ8XP",
                    "high_descs":[
                        "turn to the right go forward turn to the right face a dinner table",
                        "pick up the pencil that is on top of the dinner table",
                        "turn around to the right go to the right around the dinner table ",
                        "put the pencil inside the blue bowl that is on top of the table",
                        "pick up the blue bowl from the dinner table",
                        "turn to the right go left turn to the right go left towards a brown coffee table",
                        "put the blue table on top of the coffee table"
                    ],
                    "task_desc":"move a blue bowl with a pencil in it from a dinner table to a coffee table ",
                    "votes":[
                        1,
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl",
                "Pencil"
            ]
        },
        "valid_seen/pick_and_place_with_movable_recep-TissueBox-Plate-DiningTable-203/trial_T20190909_141915_002879/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3A0VPWPASCO9J_3DPNQGW4LOW1W2WS9V964VXT85B46U",
                    "high_descs":[
                        "Go across the room to the side of the coffee table closest to the window.",
                        "Pick up the plate on the coffee table.",
                        "Go across the room to the dining table on the side by the windows.",
                        "Set the plate down on the table.",
                        "Pick up the box of tissues on the table.",
                        "Put the box on tissues on the plate."
                    ],
                    "task_desc":"Put a plate with tissues on it onto the dining table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3PZDLQMM0W2G95Q6F83LXGS5KEYC28",
                    "high_descs":[
                        "walk towards couch, turn left, walk towards ottoman, walk past ottoman, turn right after coffee table, stop and face coffee table in front of wall",
                        "pick up the dish that is on the coffee table",
                        "turn left, walk around coffee table, walk past on left side of couch, walk in to kitchen, turn left, turn right to go around table, stop to turn and face table on the right",
                        "put dish on to table",
                        "pick up the tissue box that is on the table",
                        "put tissue box on to dish that is on the table"
                    ],
                    "task_desc":"take a dish to the table to put tissue box on it",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AD0NVUGLDYDYN_3YOH7BII0CO7PU0WVV4UN42OMN3KV8",
                    "high_descs":[
                        "walk to the sofa, turn left, walk to the wall, turn around to the coffee table",
                        "Grab the plate on the coffee table",
                        "Turn left, walk across the room to the dining table by the window",
                        "put the plate down on the table",
                        "grab the tissue box near the window",
                        "put the tissue box in the plate"
                    ],
                    "task_desc":"Grab the plate from coffee table, put it on dining table, put the tissue box in it",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "TissueBox",
                "Plate"
            ]
        }
    }
}