{
    "scene_name":"FloorPlan213",
    "trials":{
        "train/pick_and_place_simple-KeyChain-None-ArmChair-213/trial_T20190907_001843_465170/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_33LK57MYLWMMMXIE112ZZW6UQUBZSW",
                    "high_descs":[
                        "Turn around and walk to the sofa chair in the end",
                        "Take the key chain on the sofa chair",
                        "Turn around and walk straight, turn right to the brown sofa chairs",
                        "Put the key chain on the right sofa chairs"
                    ],
                    "task_desc":"Move the key chain on the pink sofa chair to the brown sofa chair on the right",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A320QA9HJFUOZO_37C0GNLMHIKEWYFL26AZ7ZRZKOS6D8",
                    "high_descs":[
                        "Turn around and walk over to the red chair past the couch",
                        "Pick up the keys from the chair",
                        "Turn around and walk over to the right most wicker arm chair",
                        "Place the keys on the chair"
                    ],
                    "task_desc":"Put the keys on the wicker chair",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1HKHM4NVAO98H_3SKRO2GZ748R3IKYOHK5GGV8WPYK1W",
                    "high_descs":[
                        "walk over to the red chair on the left",
                        "pick the keys up off of the red chair",
                        "walk over to the brown right chair",
                        "place the keys on the brown right chair"
                    ],
                    "task_desc":"keys need to end up on the right side brown chair",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_simple-KeyChain-None-ArmChair-213/trial_T20190907_001825_048110/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_338JKRMM29GWVGWQEFA1EP8J83LHA0",
                    "high_descs":[
                        "Move to the red couch. ",
                        "Pick up the keys from the couch. ",
                        "Bring the keys to the chairs in the corner. ",
                        "Put the keys on the middle chair. "
                    ],
                    "task_desc":"Put the keys on the middle chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3JBT3HLQFBJP952M9KY54R1J3GFPZT",
                    "high_descs":[
                        "Turn left, head towards the single sofa, turn right, heads towards the middle of the table on your right, and then turn left to face the long sofa. ",
                        "Pick up the keys on the left side of the long sofa.",
                        "Turn left and head towards the single brown chair on your left.",
                        "Place the keys on the chair."
                    ],
                    "task_desc":"Relocate the keys from the pink sofa to the brown sofa.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3C81THYYSBGVD_3LBXNTKX0UCFCNM0RDENLGLTQAE9XW",
                    "high_descs":[
                        "Turn left and then right, then turn left to face the red couch.",
                        "Pick up the keys that are on the couch.",
                        "Turn left, then left around the table, then right to face the brown chair.",
                        "Place the keys on the brown couch."
                    ],
                    "task_desc":"Move the keys from the red couch to the brown couch.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Box-DiningTable-213/trial_T20190909_161753_482457/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_32SVAV9L3I0PMXBPV2AGBHRBK5BA36",
                    "high_descs":[
                        "Turn around and walk to the side of the wooden coffee table to the left.",
                        "Pick up the watch in front of the laptop computer on the table.",
                        "Turn right and walk to the red couch.",
                        "Put the watch inside the cardboard box on the right side of the couch.",
                        "Pick up the box with the watch inside from the couch.",
                        "Turn left, hang a left at the red chair and turn around to face the red chair.",
                        "Put the box with the watch inside on the chair."
                    ],
                    "task_desc":"Place a box with a watch on a chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20FCMWP43CVIU_33M4IA01QJST1C4KH23QDN5PR4FXRG",
                    "high_descs":[
                        "walk to face coffee table",
                        "pick up watch from coffee table",
                        "walk to face couch with box",
                        "put watch inside box on couch",
                        "pick up box from couch",
                        "walk to face red chair",
                        "put box on chair"
                    ],
                    "task_desc":"put box with watch on chair",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3SBEHTYCWQU58IRBWBVJI9B76EFYI8",
                    "high_descs":[
                        "Turn around and move forward, then turn left to go to the coffee table.",
                        "Pick up the watch on the coffee table.",
                        "Turn right and go to the sofa ahead.",
                        "Put the watch in the box on the sofa.",
                        "Pick up the box from the sofa.",
                        "Turn left and go to the red chair adjacent to the sofa.",
                        "Put the box on the red chair."
                    ],
                    "task_desc":"Put a box with a watch it on the red chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Watch",
                "Chair"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Box-DiningTable-213/trial_T20190909_161552_523960/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CY7IOJ9YH136_3QUO65DNQXFYNVI9K5BZZL1GMYCUO8",
                    "high_descs":[
                        "turn left, go to red chair with black statue",
                        "pick up watch in front of watch from red chair",
                        "go to red couch to the right with box",
                        "place watch in box on red couch",
                        "pick up box with watch from couch",
                        "go to red chair with black statue to the left",
                        "place box with watch to the right of black statue on red chair"
                    ],
                    "task_desc":"place box with watch on red chair ",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2JBNDG0U9IA6I_3QXNC7EIPLMF0M2NK9EXDOIKBB490Q",
                    "high_descs":[
                        "Turn left and walk straight to the red color chair and face it",
                        "Pick up the watch from the chair seat cushion",
                        "Turn right and walk straight slightly then face left to the red sofa",
                        "Place the watch in the box on the sofa seat cushion",
                        "Pick up the box with the watch inside",
                        "Turn left and walk straight slightly then turn to face the red chair on your right",
                        "Place the box on the chair seat cushion next to the statue"
                    ],
                    "task_desc":"Put a box with watch inside on the chair ",
                    "votes":[
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3AMW0RGHOGT3D5A124CSAQECPOYNP8",
                    "high_descs":[
                        "turn left, walk forward to the pink chair",
                        "pick up the watch that is on the chair",
                        "turn right, walk a few steps, turn left to face couch",
                        "put the watch in to the box on the couch",
                        "pick up the box that is on the couch",
                        "turn left, walk forward a few steps, turn right to face chair",
                        "put the box on the chair"
                    ],
                    "task_desc":"put a box with a watch in it on a chair",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Watch"
            ]
        },
        "train/look_at_obj_in_light-CreditCard-None-FloorLamp-213/trial_T20190909_144511_768997/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2871R3LEPWMMK_31LVTDXBLA1Y1INV3J022TA2KVQRL9",
                    "high_descs":[
                        "Turn right, cross the room and walk to the wooden coffee table on the right.",
                        "Pick up the red credit card from the right side of the table.",
                        "Turn left, hang a right at the chairs and walk to the tall lamp in the corner to the left.",
                        "Turn on the tall lamp."
                    ],
                    "task_desc":"Examine a credit card by the light of a tall lamp.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_31UV0MXWNT376UHRL9QM7CDEB975IV",
                    "high_descs":[
                        "Turn right, go to the coffee table, turn right to face the watch on the coffee table.",
                        "Pick up the red credit card on the coffee table. ",
                        "Turn left, bring the card to the lamp in the right corner of the room.",
                        "Turn on the lamp. "
                    ],
                    "task_desc":"Examine a credit card by the light of the lamp in the corner. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36A780ODXBDEH_3UJ1CZ6IZKGW08KNQLK0BEJ1K7A5SO",
                    "high_descs":[
                        "Turn right and move to the coffee table in the middle of the room.",
                        "Pick up the red credit card on the right side of the coffee table.",
                        "turn left and move around the coffee table to the floor lamp in the corner of the room.",
                        "Turn on the stand lamp and inspect the credit card."
                    ],
                    "task_desc":"Take the red credit card from the coffee table and turn on the floor lamp.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-Dresser-213/trial_T20190908_081801_821508/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_3LKC68YZ3DK3UALGJX1JGN2BDHZOWM",
                    "high_descs":[
                        "Turn around and take one step, then turn left and walk across the room",
                        "Pick up the keys on the edge of the table. ",
                        "Turn around and walk across the room, then turn right and walk across the room, then turn right. ",
                        "Place the keys in the empty box on the couch. ",
                        "Pick up the box on the couch. ",
                        "Turn right and take two steps, then turn left and walk to the end of the coffee table, then turn left and walk across the room. ",
                        "Put the box down on the table in front of the television. "
                    ],
                    "task_desc":"To put the keys in a box. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A36DK84J5YJ942_3RWE2M8QWKRS4ZKJPB8LU3T2M3IN09",
                    "high_descs":[
                        "move to the TV stand to the right of the door",
                        "pick up keys from the stand",
                        "move to the left couch to the left of the door",
                        "put the keys in a box",
                        "pick up the box from the couch",
                        "move to the TV stand to the right of the door",
                        "put the box on the TV stand"
                    ],
                    "task_desc":"Put a box with keys on the TV stand.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3RXCAC0YIU64CW80XB85XYQN4P78G8",
                    "high_descs":[
                        "Turn right, proceed to dresser.",
                        "Pick up keys from dresser.",
                        "Turn around, proceed across room.  Turn right, proceed to wall.  Turn right, face couch.",
                        "Place keys in empty box on couch.",
                        "Pick up box with keys in them from the couch.",
                        "Turn right, turn left, proceed to dresser across room.",
                        "Place box with keys on dresser in front of television."
                    ],
                    "task_desc":"Put keys in box, move keys and box to dresser.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_and_place_with_movable_recep-KeyChain-Box-Dresser-213/trial_T20190908_190207_387917/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A24RGLS3BRZ60J_3NL0RFNU0I48VHHHBZ37EE2B9JWK4I",
                    "high_descs":[
                        "Turn around and face the red couch on the right.",
                        "Pick up the keys from the edge of the right side of the couch.",
                        "Raise the keys in the air.",
                        "Place the keys inside the box on the right side of the couch.",
                        "Pick up the box from the right side of the couch.",
                        "Carry the box and turn around, then to the left to find the TV.",
                        "Place the box on the table in front of the TV, to the left side."
                    ],
                    "task_desc":"Move keys and a box to a table.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3YOH7BII0CO7PU0WVV4UN42OM31KV2",
                    "high_descs":[
                        "Turn to the left",
                        "Head to the pink couch",
                        "Take the keys from the couch",
                        "Put the keys in the white box on the couch",
                        "Take the white box from the couch",
                        "Turn around, head to the entertainment center",
                        "Put the box on the entertainment center in front of the TV"
                    ],
                    "task_desc":"Put the keys from the couch in the white box, put the box in front of the TV",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AIICJA0A5J8NF_33LK57MYLWMMMXIE112ZZW6UR8DSZK",
                    "high_descs":[
                        "Walk to the pink sofa. ",
                        "Pick up the keys on the sofa. ",
                        "Look at the box on the sofa. ",
                        "Place the keys in the box on the sofa. ",
                        "Pick up the box off of the sofa. ",
                        "Turn to the right, walk to the entertainment center. ",
                        "Place the box next to the statue on the entertainment center. "
                    ],
                    "task_desc":"Put the keys in the box on the entertainment center. ",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "KeyChain"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Drawer-213/trial_T20190909_020407_284128/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CPNA5L0J834N_3570Y55XZSARCRLG6NVGXXYRRTDGY8",
                    "high_descs":[
                        "look at the wall then turn to the right and turn around turn to the left and walk forward towards the red chair",
                        "pick up credit card from chair ",
                        "turn right and walk to the wall behind you turn to the left and walk to the dresser",
                        "open the dresser drawer and put the card in close the drawer",
                        "turn to the left and walk towards the black table ",
                        "pick up the credit card from the table ",
                        "turn right and walk towards the wall behind you then turn right at the rug ",
                        "open the drawer and put the second card in close the drawer"
                    ],
                    "task_desc":"pick up the credit cards and place them in the drawer",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "RemoteControl",
                "Box",
                "CreditCard",
                "Book"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Drawer-213/trial_T20190909_020235_777494/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AFPMG8TLP1TND_354P56DE9NUBNCY6EEZX9YXXB5ZS74",
                    "high_descs":[
                        "turn right then walk straight then turn right then walk straight then turn left towards the couch",
                        "pick up the credit card off of the couch",
                        "look up and turn right towards the drawer",
                        "open the drawer and put the credit card inside and close the drawer",
                        "turn around and walk straight to the wall then turn right and right again towards the couch",
                        "pick up the credit card next to the laptop",
                        "turn right then walk straight then turn left and walk straight to the desk drawer",
                        "open the drawer and put the credit card inside next to the other credit card"
                    ],
                    "task_desc":"clean up credit cards and put them into the drawer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_two_obj_and_place-CreditCard-None-Drawer-213/trial_T20190909_020320_565413/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1CPNA5L0J834N_3ATTHHXXWDFG8D11RF9HZV4Y4ZDXIB",
                    "high_descs":[
                        "turn left then turn right and walk towards the door turn left at the lap top",
                        "look down at the credit card on the dresser and pick it up",
                        "turn right then at the end of the dresser turn right again then turn around back towards the dresser",
                        "Open the middle drawer and place the credit card inside",
                        "close the drawer and turn right then turn back to the dresser walk forward turn left",
                        "pick up another credit card from the dresser",
                        "turn left walk forward and then turn right at the end of the dresser",
                        "open the drawer and place the second credit card in and close it. "
                    ],
                    "task_desc":"to place all credit cards inside the middle drawer of the dresser",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AFPMG8TLP1TND_3DBQWDE4Y9PZKVSIIP3ECK9VXZIN5S",
                    "high_descs":[
                        "turn left then walk straight then turn right and walk straight then turn right towards the computer desk",
                        "pick up the credit card on the desk",
                        "turn right walk straight then turn right again and then turn right again and look down at the floor",
                        "open the drawer on the desk and put the credit card inside and close the drawer",
                        "turn right then turn right again and walk straight then turn left and walk towards the wall and turn left towards the desk",
                        "pick up the credit card on the desk",
                        "turn left and walk straight then turn right and walk straight and look down at the floor",
                        "open the drawer on the desk and put the credit card next to the other credit card in the drawer"
                    ],
                    "task_desc":"put away and clean up credit cards inside the desk drawer",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CreditCard"
            ]
        },
        "train/pick_two_obj_and_place-Box-None-CoffeeTable-213/trial_T20190906_200820_481009/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A002160837SWJFPIAI7L7_33LK57MYLWMMMXIE112ZZW6UQ04SZU",
                    "high_descs":[
                        "Turn around and get to the desk with the TV on it.",
                        "Pick up the cardboard box.",
                        "Turn back around and turn left to face the table.",
                        "Place the box on top of the table.",
                        "Turn right then go right again.",
                        "Pick up the box that's in the chair.",
                        "Turn right and go back to the table.",
                        "Place the box on the table behind the statue."
                    ],
                    "task_desc":"Place 2 cardboard boxes on the table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "train/pick_and_place_simple-Watch-None-CoffeeTable-213/trial_T20190909_010823_096862/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_32UTUBMZ7JNEHGI0LQGIPN30TU9VBD",
                    "high_descs":[
                        "Turn around, then turn left and cross the room, at the red chair take a right and cross the room to the long TV stand with all the drawers",
                        "Pick up the watch that is sitting on the tv stand",
                        "Turn around and head forward, turn left one you get to the coffee table so that you are facing the coffee table.",
                        "Place the watch on the coffee table to the right of the statue"
                    ],
                    "task_desc":"Place a watch on a coffee table",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TUUIV61CR0C7_392CY0QWG4IPABDR747C2K70B0QI4R",
                    "high_descs":[
                        "Turn completely around and walk straight to where the rug begins, turn left and walk to the next corner of the rug.  Turn right and walk across the room to the buffet on the far wall.",
                        "Pick up the watch on the top front of the buffet.",
                        "Turn completely around and walk back across the room until you are halfway past the coffee table.  Turn to your left so you are facing the coffee table. ",
                        "Place the watch on the coffee table to the right of the statue."
                    ],
                    "task_desc":"Move the watch from the buffet to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3FQ5JJ512OF22EDLPC7KE9SDULINKA",
                    "high_descs":[
                        "Turn around and go forward, then turn left to go around the chair, then turn right just past the coffee table, then go straight to the counter ahead.",
                        "Pick up the watch on the counter.",
                        "Turn around and go straight, then turn left to face the coffee table.",
                        "Place the watch on the coffee table."
                    ],
                    "task_desc":"Move the watch to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_and_place_simple-Watch-None-CoffeeTable-213/trial_T20190909_010748_137974/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_37M28K1J0T407BDEYN23RO80GPHAJC",
                    "high_descs":[
                        "Walk across the room, then hang a right and walk over to the pink chair.",
                        "Pick up the watch off of the seat of the pink chair.",
                        "Turn right and walk forward, then hang a right and walk up to the coffee table.",
                        "Put the watch on the middle front edge of the coffee table."
                    ],
                    "task_desc":"Move a watch to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TUUIV61CR0C7_3A1PQ49WVK88MH5OE46P4AZIZ4G1HL",
                    "high_descs":[
                        "Move forward to the brown chairs, turn right and approach the red chairs.",
                        "Pick up the watch from the red chair on the left.",
                        "Turn around and face the coffee table.",
                        "Place the watch on the coffee table."
                    ],
                    "task_desc":"Move the watch from the red chair to the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3R19ZA45J8915_3T3IWE1XG9EM8UG0ZDDTJUAEI9WQT6",
                    "high_descs":[
                        "Walk forward, then make a right once you reach the end of the coffee table and walk up to the red chair. ",
                        "Pick up the watch that is sitting on the red chair. ",
                        "Turn right, walk a few steps, then turn right again and walk up to the coffee table. ",
                        "Place the watch down on the coffee table. "
                    ],
                    "task_desc":"Move a watch to the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-CreditCard-Box-Dresser-213/trial_T20190908_174345_546124/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_3DUZQ9U6SP55DDD404DWEQTY3PYVSY",
                    "high_descs":[
                        "turn around, walk to the sofa chair",
                        "grab the credit car on the chair",
                        "turn right, walk to the sofa ",
                        "put the credit card in the box on the sofa",
                        "grab the box on the sofa",
                        "turn around, walk to the tv cabinet",
                        "put the box on the cabinet"
                    ],
                    "task_desc":"put the credit card in the box, move it to the tv cabinet",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3MMN5BL1W2LI39YGWXB4JM29KFL3MT",
                    "high_descs":[
                        "Turn around and walk to the red chair ahead.",
                        "Pick up the red credit card from the middle of the chair cushion.",
                        "Turn right, cross the room and turn left before the end of the red couch to face it.",
                        "Put the credit card in the box in between two yellow pillows on the couch.",
                        "Pick up the box with the credit card inside from the couch.",
                        "Turn around, hang a left at the coffee table and walk to the television.",
                        "Put the box with the credit card to the left of the statue on the desk near the television."
                    ],
                    "task_desc":"Place a box and a credit card on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3WR9XG3T66SK02AXS5EYA9XP3R674T",
                    "high_descs":[
                        "Turn around and go to the pink arm chair behind to the left of the couch. ",
                        "Pick up the credit card in the center of the cushion, on the pink chair. ",
                        "Turn to your right and walk to the end of the pink couch. ",
                        "Place the credit card in the cardboard box, on the couch, between the two pillows. ",
                        "Pick up the card board box containing the credit card that is on the couch, between the two pillows. ",
                        "Turn to your right and go to the middle of the dresser across from you. ",
                        "Place the box containing the credit card on the dresser, to the left of the trophy, in front of the TV. "
                    ],
                    "task_desc":"Place a cardboard box, containing a credit card box, on the dresser, by the trophy. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "CreditCard"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Box-CoffeeTable-213/trial_T20190907_100715_338052/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A36DK84J5YJ942_37C0GNLMHIKEWYFL26AZ7ZRZLJ9D6N",
                    "high_descs":[
                        "Move to the arm chair closet to the cat tree.",
                        "Pick up a watch from the arm chair.",
                        "Move around to the front of the arm chair.",
                        "Place the watch inside the box on the arm chair.",
                        "Pick up the box from the arm chair.",
                        "Move to the coffee table in front of the couch.",
                        "Place the box on the coffee table."
                    ],
                    "task_desc":"Put a box with a watch inside it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3HHRAGRYXBMSIE88QMRR23U0FTM9OF",
                    "high_descs":[
                        "Turn around and take a step forward, then turn right and walk up to the wall, turn right again to face the red chair.",
                        "Pick up the watch that is closest to you off of the seat of the red chair. ",
                        "Turn right and walk around to the front of the red chair that you picked the watch up off of.",
                        "Put the watch into the cardboard box that is on the seat of the red chair.",
                        "Pick up the cardboard box with the watch in it.",
                        "Turn right and begin walking across the room, then hang a right and walk up to the wooden coffee table.",
                        "Place the cardboard box with the watch inside onto the coffee table to the right of the book."
                    ],
                    "task_desc":"Put a cardboard box with a watch inside on a coffee table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A20C7ZLLE41JUO_3VAR3R6G1SIS49PYLULD27ZPVV7O8O",
                    "high_descs":[
                        "Turn around and get between the cat tree and red chair, standing next to the wall on your left and the right arm of the red chair in front of you.",
                        "Pick up the watch from off the chair that is on the right hand side closer to you.",
                        "Walk around the red chair nearest the cat tree to stand in front of it.",
                        "Put the watch into the white box that is on the red chair.",
                        "Pick up the white box with the watch in it.",
                        "Turn around and walk to the low wooden coffee table that is in front of the red sofa, sitting on the rug.",
                        "Put the white box on the coffee table, in between a book and a watch."
                    ],
                    "task_desc":"Put a white box with one watch in it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        0
                    ]
                },
                {
                    "assignment_id":"A1AKL5YH9NLD2V_38BQUHLA9ZH7PYR2FVVW7P0KF49OMX",
                    "high_descs":[
                        "Walk to the left side of the pink chair with two watches on it.",
                        "Pick up the watch closest to the edge from the pink chair.",
                        "Walk to the front of the pink chair with a box on it.",
                        "Place the watch in the box.",
                        "Pick up the box from the pink chair.",
                        "Turn around and walk to the wooden table with a book on it.",
                        "Place the box next to the book on the wooden table."
                    ],
                    "task_desc":"Place a box with a watch in it next to the book on the wooden table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book",
                "Box",
                "Watch"
            ]
        },
        "train/pick_and_place_with_movable_recep-Watch-Box-CoffeeTable-213/trial_T20190907_100736_457719/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_378XPAWRUFUWRB7AKXSME19Y9AHAIS",
                    "high_descs":[
                        "Turn left and walk over to the side of the wooden coffee table closest to the couch.",
                        "Pick up the closest watch off of the coffee table.",
                        "Turn right and begin walking across the room, then turn right again and walk up to the pink chair.",
                        "Put the watch into the cardboard box that is on the seat of the chair.",
                        "Pick up the cardboard box with the watch inside of it.",
                        "Turn right and walk back over to the coffee table.",
                        "Place the cardboard box with the watch inside of it onto the coffee table to the right of the set of keys."
                    ],
                    "task_desc":"Put a cardboard box with a watch inside of it on the coffee table.",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_3GD6L00D3VEMT6K19TXLVTNCLG7M1P",
                    "high_descs":[
                        "turn to the left, make a left at the pink coach and move forward to the coffee table on the left and face the coffee table",
                        "pick up the watch on the front edge of the table",
                        "turn around and face the pink chair with a white box sitting on it",
                        "put the watch inside of the white box",
                        "pick up the white box with the watch inside of it",
                        "turn to the right and move to face the coffee table on the right",
                        "put the white box with the watch inside on the coffee table to the right of the set of keys"
                    ],
                    "task_desc":"put a box with a watch inside on the coffee table",
                    "votes":[
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2CT57W84KXX25_3M0BCWMB8YDJBGW7FSWXA32C63KWB0",
                    "high_descs":[
                        "Turn to the left, walk to the pink couch, turn to the coffee table. ",
                        "Pick up the watch closest to the edge of the coffee table. ",
                        "Walk to the pink chair. ",
                        "Put the watch in the box on the chair. ",
                        "Pick up the box from the chair.",
                        "Walk to the couch, turn to the coffee table.",
                        "Put the box on the coffee table. "
                    ],
                    "task_desc":"Put the box with the watch on the coffee table. ",
                    "votes":[
                        1,
                        0,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_36PW28KO42DKB65OOE2VTMB6HL4AEL",
                    "high_descs":[
                        "Turn to your left and walk to the coffee table.",
                        "Pick up wrist watch from the coffee table.",
                        "Walk toward the red chair and stand in front of it.",
                        "Put the watch in the box sitting on the red chair.",
                        "Pick up the box from the chair.",
                        "Turn right and walk back to the coffee table.",
                        "Set the box on the coffee table."
                    ],
                    "task_desc":"Put the watch in a box on the coffee table.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3PGS1Q1XAY79I_39GHHAVOMI8DKXBZTE3VDZ2YUKD4J0",
                    "high_descs":[
                        "While facing the small black table against the wall, turn and walk towards the door, hang a left and walk to the long side of the coffee table nearest the pink couch.",
                        "Pick up the wrist watch on the side of the table that is closest to the couch.",
                        "Turn towards your right and walk to the pink chair with a box on it at the left of the couch as you are facing the couch.",
                        "Place the watch in the back right corner of the box.",
                        "Pick up the box from the chair.",
                        "Turn and walk to the long side of the coffee table nearest the pink couch.",
                        "Place the box on the table to the right of the keys."
                    ],
                    "task_desc":"Put a wrist watch in a box, place the box on the coffee table",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box",
                "Watch"
            ]
        },
        "train/look_at_obj_in_light-KeyChain-None-FloorLamp-213/trial_T20190908_203732_806577/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1DMXEJGJY02E1_3JCG6DTRV671VP2AM1UHD3FP4G5QQV",
                    "high_descs":[
                        "Turn right, walk past the coffee table, then turn right and go to the chair on your left.",
                        "Pick up the keys on the chair.",
                        "Turn right and go to the lamp in the corner.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at keys using the lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1GVTH5YS3WOK0_3LEIZ60CDMG4HIMFSV28I114ZJEZ94",
                    "high_descs":[
                        "Turn right, head towards the table, and then turn right towards the left chair in front of you.",
                        "Pick up the set of keys on the chair.",
                        "Turn right towards the lamp at the corner of the room.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a set of keys at the light of a tall lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3XC1O3LBOV33W8EPB0GG1MRIEIYLTY",
                    "high_descs":[
                        "Move to the opposite side of the room to the far left tan chair that the keys are sitting on top of ",
                        "Pick up the keys that are on top of the chair",
                        "Carry the keys across the room to the large floor lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Carry keys while turning on a lamp",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "valid_seen/pick_two_obj_and_place-Box-None-CoffeeTable-213/trial_T20190906_200927_069627/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3WJEQKOXABJLR5BCCQ7GM2SCRKTA1A",
                    "high_descs":[
                        "Move across the room to the pink sofa.",
                        "Pick up the box that is on the sofa. ",
                        "Turn around and move forward to the long, short brown table. ",
                        "Put the box on the table on the right side of the computer.",
                        "Move across the room to the table that the TV is on. ",
                        "Pick up the box that is near the TV.",
                        "Move across the room to the long, short brown table.",
                        "Place the box on the table next to the other box."
                    ],
                    "task_desc":"Gather boxes to be placed on the coffee table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Box"
            ]
        },
        "valid_seen/look_at_obj_in_light-KeyChain-None-FloorLamp-213/trial_T20190908_203806_730562/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AD0NVUGLDYDYN_3CFVK00FWO2XUA3DFN8NQCZ4U9R6LA",
                    "high_descs":[
                        "turn around, walk to the red sofa,",
                        "grab the key chain on the sofa",
                        "turn around to the floor lamp",
                        "turn on the floor lamp"
                    ],
                    "task_desc":"grab the key chain from the sofa, turn on the floor lamp",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3SITXWYCNYQY0G1XPXSJCMGJFK0BXC",
                    "high_descs":[
                        "Turn around and walk across the room to the red armchair containing a key chain and an empty box.",
                        "Pick up the key chain from the armchair.",
                        "Turn around and stand in front of the floor lamp.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Examine a key chain by the light of a floor lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3U8YCDAGXSXD7WXB5302YXO7RCPQ0F",
                    "high_descs":[
                        "Turn around, head to the pink arm chair",
                        "Take the keys from the arm chair",
                        "Turn around, face the lamp",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Take the keys from the pink arm chair, turn on the lamp in the corner",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190907_001809_887455/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move to the back side of the table.",
                        "Pick up the keys on the table. ",
                        "Bring the keys to the chair with the book on it. ",
                        "Put the keys on the chair next to the book. "
                    ],
                    "task_desc":"Put the keys on the chair. "
                },
                {
                    "high_descs":[
                        "turn right and walk over to the living room table",
                        "grab the keys off of the living room table",
                        "turn around and walk over to the living room chairs",
                        "place the keys on the left chair"
                    ],
                    "task_desc":"place keys on the left chair in the living room"
                },
                {
                    "high_descs":[
                        "Walk across the room to the back side of the wooden coffee table.",
                        "Pick up the key ring off of the wooden coffee table from behind the laptop.",
                        "Turn to you right and walk over to the chair with the book in the seat.",
                        "Place the key ring onto the edge of the seat of the chair to the right of the book."
                    ],
                    "task_desc":"Place a key ring onto the seat of a chair."
                }
            ],
            "relative_objects":[
                "KeyChain"
            ]
        },
        "tests_seen/trial_T20190909_135430_613298/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "move right to the center table",
                        "pick up the watch on the table",
                        "turn around to the sofa",
                        "place the watch in the carton on the sofa",
                        "pick up the carton from the sofa",
                        "move left to the couch",
                        "place the carton on the couch"
                    ],
                    "task_desc":"place a carton with a watch in it on the couch"
                },
                {
                    "high_descs":[
                        "Turn around and walk to the right side of the coffee table, facing it.",
                        "Pick up the watch on the table.",
                        "Turn around and walk to the leftmost cushion of the red couch.",
                        "Place the watch in the leftmost box.",
                        "Pick up the box.",
                        "Walk left to the red chair and face it.",
                        "Place the box on the chair, to the left of the book."
                    ],
                    "task_desc":"Place a box with a watch in it on a chair."
                },
                {
                    "high_descs":[
                        "Turn around and take a small step to your right then turn left.",
                        "Pick up the watch that's in front of you.",
                        "Turn around and walk to the couch.",
                        "Put the watch in the box to the left of the other box on the couch.",
                        "Pick up the box with the watch in it.",
                        "Turn left and walk to the red chair then turn right to face it.",
                        "Put the box on the red chair."
                    ],
                    "task_desc":"Put a box with a watch in it on the chair."
                }
            ],
            "relative_objects":[
                "Box",
                "Watch"
            ]
        }
    }
}