{
    "scene_name":"FloorPlan325",
    "trials":{
        "tests_unseen/trial_T20190908_202146_854077/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and go over to the black dresser across the room.",
                        "Look down at the dresser.",
                        "Do a 270 degree rotation to the left. Walk straight. Go to the dresser.",
                        "Open the bottom drawer.",
                        "Close the drawer.",
                        "Turn all the way around.",
                        "Open the drawer again.",
                        "Close the drawer."
                    ],
                    "task_desc":"Check some of the dressers for their contents."
                },
                {
                    "high_descs":[
                        "Walk towards the left to face the dresser drawer",
                        "Pick up the yellow pencil at the top of the drawer.",
                        "walk to the right to face the dresser.",
                        "open the drawer and put the pencil in it.",
                        "walk closer to the dresser",
                        "pick up the yellow pencil at the top shelf",
                        "walk at the side of the dresser",
                        "open the drawer and put the pencil in it."
                    ],
                    "task_desc":"put the yellow pencil inside the drawer at the right."
                }
            ],
            "relative_objects":[
                "Pencil"
            ]
        },
        "tests_unseen/trial_T20190908_154427_989098/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk around to the far side of the bed.",
                        "Pick up the book off of the bed.",
                        "Turn left and walk over to the black dresser.",
                        "Open the leftmost lower cabinet door and put the book inside the cabinet, then close the door."
                    ],
                    "task_desc":"Move a book from the bed into a cabinet."
                },
                {
                    "high_descs":[
                        "Turn to the right and take one step, then turn to the left and take two steps, then turn to the right and take one step, then turn to the left and face the bed. ",
                        "Pick up the book on the edge of the bed. ",
                        "Turn to the left and take two steps, then look down.",
                        "Open the cabinet on the left side and put the book inside the cabinet."
                    ],
                    "task_desc":"Put the book away inside the cabinet."
                },
                {
                    "high_descs":[
                        "Circle around the white bed to the left and stop between the bed and the wall.",
                        "Pick up the brown book on the white bed.",
                        "Turn around and walk to the black cabinets.",
                        "Open the first cabinet door and place the book inside the cabinet closing the door behind it."
                    ],
                    "task_desc":"Pick up the brown book and put it in the black cabinet."
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Book"
            ]
        },
        "tests_unseen/trial_T20190908_113716_189822/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk out to right then head to the cabinet on your right",
                        "Pick up the yellow vase on the cabinet",
                        "Turn right walk straight to the shelf",
                        "Put the yellow vase on the second level of the shelf"
                    ],
                    "task_desc":"Put the yellow vase on the shelf"
                },
                {
                    "high_descs":[
                        "Turn right at the black bookcase and walk to the end of the black drawers to the right.",
                        "Pick up the golden vase from the black drawers. ",
                        "Turn left and walk to the black bookcase.",
                        "Put the golden vase on the black bookcase."
                    ],
                    "task_desc":"Pick up the golden vase and put it on the black bookcase."
                },
                {
                    "high_descs":[
                        "Turn around, walk forward to reach the black dresser on the opposite wall of the bed with the laptop on it.",
                        "Pick up the gold jar from the black dresser.",
                        "Turn around to walk to the black bookshelf.",
                        "Put the gold jar on the black bookshelf."
                    ],
                    "task_desc":"Move a gold jar to the black bookshelf."
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "tests_unseen/trial_T20190908_143542_788790/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to the left and walk across the room, then turn right to face the table.",
                        "Pick up the CD on the table. ",
                        "Turn around and take two steps, then turn right and walk across the room.",
                        "Put the CD down to the left of the red pen."
                    ],
                    "task_desc":"Move the CD to the table."
                },
                {
                    "high_descs":[
                        "Turn to your left and go to the dresser against the wall, across from you.",
                        "Pick up the CD closest to you on the dresser. ",
                        "Turn to your left and go past the other dresser on your right, to the bookshelf across the room.",
                        "Place the CD on the second shelf between the gold vase and the pen."
                    ],
                    "task_desc":"Put a CD on the book shelf. "
                },
                {
                    "high_descs":[
                        "Turn left, walk forward to the wall, then turn left towards the CD on the dresser.",
                        "Pick up the closest CD on the dresser.",
                        "Turn around, walk forward to the wall, then turn right and walk across the room to the set of shelves by the wall.",
                        "Put the CD on the middle shelf, to the right of the gold object."
                    ],
                    "task_desc":"Move a CD from a dresser to a shelf."
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "tests_unseen/trial_T20190908_143712_120384/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around then go right, pass the black dresser and turn left and head straight to the corner of the black night stand.",
                        "Grab the CD next to the pencil.",
                        "Turn around and pass the black night stand and bed, then turn right and go forward to the brown shelf with the gold pot.",
                        "Place the CD next on the shelf next to the gold pot."
                    ],
                    "task_desc":"Place the CD on the shelf next to the gold pot."
                },
                {
                    "high_descs":[
                        "turn around, take a step, turn left, walk to wall, turn right, walk forward, turn left between the bed and dresser, walk to the wall, turn right to face the dresser",
                        "pick up the CD that is on the dresser",
                        "turn right, walk two steps, turn left, walk across the room, turn right, walk across the room to the shelves",
                        "put the CD on the shelf"
                    ],
                    "task_desc":"move the CD from the dresser to the shelf"
                },
                {
                    "high_descs":[
                        "go to the end of the black dresser at the foot of the bed",
                        "pick up the disk from the dresser",
                        "take the disk to the book shelf",
                        "put the disk on the shelf"
                    ],
                    "task_desc":"take a disk from the dresser and put it on the shelf."
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "tests_unseen/trial_T20190907_091412_793531/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move to the right side of the large black dresser",
                        "Pick up the phone that is in a blue case sitting on top of the dresser",
                        "Carry the phone to the left side of the bed",
                        "Place the phone in front of the orange pillow that is on top of the bed"
                    ],
                    "task_desc":"Move a phone from the dresser to the bed"
                },
                {
                    "high_descs":[
                        "Move to the left side of the dresser. ",
                        "Pick up the cell phone from the dresser.",
                        "Turn around and approach the bed from the side without a night stand.",
                        "Place the cell phone on to the right side of the bed."
                    ],
                    "task_desc":"Place a cell phone onto the bed."
                },
                {
                    "high_descs":[
                        "Go to the dresser, across from the bed.",
                        "Pick up the cell phone from the dresser, to the left of the pencil.",
                        "Turn around, then go left, move forward, then turn right, move forward, then turn right to face the bed.",
                        "Place the cell phone on the bed , to the right of the nearest pillow."
                    ],
                    "task_desc":"Put the cell phone on the bed."
                },
                {
                    "high_descs":[
                        "walk towards the bed, turn right, walk towards dresser, turn left, turn right to face dresser",
                        "pick up the phone that is on the dresser",
                        "turn around, walk forward, turn right at bed, walk forward, turn right to face bed",
                        "put phone on to the bed"
                    ],
                    "task_desc":"move phone from dresser to the bed"
                },
                {
                    "high_descs":[
                        "Move to stand between the bed and dresser, facing the center of the dresser. ",
                        "Pick up the cell phone from the dresser.",
                        "Turn around and move to the other side of the bed, so you're standing near the pillow where the largest section of white sheet is showing.",
                        "Place the cell phone on the bed between the pillow and pink blanket."
                    ],
                    "task_desc":"Move the cell phone to the bed. "
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "tests_unseen/trial_T20190906_222422_671955/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around then go left to reach the desk.",
                        "Close the laptop and pick it up.",
                        "Turn left then right and face the bed.",
                        "Place the laptop on the bed between the two pillows."
                    ],
                    "task_desc":"Place the laptop on the bed."
                },
                {
                    "high_descs":[
                        "Turn right and walk towards the bed, then turn right again and walk around the bed to the middle of the large dresser.",
                        "Close the lid of the laptop on the large dresser and pick it up.",
                        "Turn around and take a step forward, then turn left and begin walking across the room, then hang a right and walk over to the side of the bed.",
                        "Place the closed laptop on the bed in between the two pillows. "
                    ],
                    "task_desc":"Place a closed laptop on a bed."
                }
            ],
            "relative_objects":[
                "Pillow",
                "Laptop"
            ]
        },
        "tests_unseen/trial_T20190918_204713_327023/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn around and walk ahead a few steps, then face the dresser on the left.",
                        "Pick up the laptop.",
                        "Turn around and walk around the bed until you get near the headboard.",
                        "Put the laptop on the left side of the frontmost book."
                    ],
                    "task_desc":"Put a laptop on a bed."
                },
                {
                    "high_descs":[
                        "Turn right and move past the bed and face the dresser in the corner of the room.",
                        "Close the lid of the laptop and pick up the laptop from the top of the dresser.",
                        "Turn right, move toward the green rubbish bin, then turn right and move to the light switch on the wall. Turn right and face the head of the bed.",
                        "Place the laptop near the edge of the bed between the two books."
                    ],
                    "task_desc":"Place a closed laptop on the bed."
                },
                {
                    "high_descs":[
                        "Turn right and head towards the dresser to your right.",
                        "Close the lid of the laptop on the dresser and pick it up.",
                        "Turn right, head towards the edge of the bed, turn right and head towards the middle of the bed to your right.",
                        "Place the computer on the bed."
                    ],
                    "task_desc":"Place the laptop from the dresser on the bed."
                }
            ],
            "relative_objects":[
                "Laptop"
            ]
        },
        "tests_unseen/trial_T20190908_143639_799222/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Walk around the bed to the dresser.",
                        "Grab the CD from the dresser.",
                        "Walk back around the bed to the shelf.",
                        "Place the CD on the top shelf."
                    ],
                    "task_desc":"Move a CD from the dresser to the shelf."
                },
                {
                    "high_descs":[
                        "Turn around and walk to the foot of the bed, then turn to the dresser on your right. ",
                        "Pick up the CD on the back of the dresser, to the left of the vase.",
                        "Turn to your right and go to the dresser, then turn to your right again and go to the book shelf across the room. ",
                        "Place the CD on the top, left shelf of the book shelf. "
                    ],
                    "task_desc":"Place a CD on the book shelf. "
                },
                {
                    "high_descs":[
                        "Turn left and walk ahead, and then left again to the center of the dresser.",
                        "Pick up the CD on the dresser.",
                        "Turn around and walk ahead and slightly left to the cabinet on the far wall with the yellow object in it.",
                        "Place the CD on the shelf above the yellow item, in approximately the same location."
                    ],
                    "task_desc":"Place a CD on a shelf."
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "tests_unseen/trial_T20190906_231911_356083/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn to the right and move across the room towards the bed. Past the bed turn left then move to the night stand.",
                        "Pick up the red pen from the night stand.",
                        "Turn around and go towards dresser, turn right and go across room to the tall dresser.",
                        "Open second drawer from bottom put pen inside drawer and close drawer.",
                        "Go forward then turn left to face tall dresser. ",
                        "Pick up the pen in the shelf beside the golden bowl.",
                        "Turn around and face dresser from left side.",
                        "Open second drawer from bottom put pen inside drawer and close drawer."
                    ],
                    "task_desc":"Put the red pen from the night stand in the dresser with the other pen on the dresser."
                }
            ],
            "relative_objects":[
                "Pen"
            ]
        },
        "tests_unseen/trial_T20190907_091432_072885/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Go forward and stand at the dresser.",
                        "Pick up the phone from the dresser.",
                        "Turn around and go to the head of the bed.",
                        "Put the phone on the bed."
                    ],
                    "task_desc":"Put the phone on the bed."
                },
                {
                    "high_descs":[
                        "Walk straight, turn right to face the drawer, walk straight to the drawer.",
                        "Pick up the phone on top of the drawer.",
                        "Turn around to face the bed, turn left to walk toward the waste bin, turn right to walk alongside the bed and turn right to face the bed.",
                        "Place the phone on the bed."
                    ],
                    "task_desc":"Place the phone the bed."
                },
                {
                    "high_descs":[
                        "Walk towards the blue cell phone on the dresser on the right.",
                        "Pick up the blue cell phone from the dresser.",
                        "Turn around and walk to the left side of the bed.",
                        "Put the cell phone on the bed, to the right of the closest pillow."
                    ],
                    "task_desc":"Place a blue cell phone on the bed."
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Bed"
            ]
        },
        "tests_unseen/trial_T20190908_154504_288885/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Turn left, head to the foot of the bed",
                        "Take the book from the bed",
                        "Turn around, open the door to the cabinet",
                        "Put the book in the cabinet, close the door"
                    ],
                    "task_desc":"Take the book from the bed, put it in the cabinet"
                },
                {
                    "high_descs":[
                        "Turn left and walk to the middle of the foot of the bed then turn right to face it when you get there.",
                        "Pick up the book that's entitled \"The Falconer\".",
                        "Turn around and take a small step to your left.",
                        "Open the cabinet door that's the second door from the left and put the book down there before closing the door."
                    ],
                    "task_desc":"Put a book in a cabinet."
                },
                {
                    "high_descs":[
                        "Turn to your left and go to the center of the foot of the bed, to your right. ",
                        "Pick up the book to the left of the orange pillow, on the bed. ",
                        "Turn around so that you are in front of the black dresser behind you. ",
                        "Place the book inside the right cabinet door, on the left side of the dresser. "
                    ],
                    "task_desc":"Put a book in the dresser. "
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Dresser",
                "Book"
            ]
        },
        "tests_unseen/trial_T20190907_163131_241971/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Go around the bed to the black drawers under the mirror. ",
                        "Pick up the phone with the blue case on the right of the notebook.",
                        "Turn around the go to the bed. ",
                        "Place the phone with blue case on the bed in front of the pillows. ",
                        "Turn around and go back to the black drawers.",
                        "Pick up the phone with blue case on the left side of the drawers.",
                        "Turn around and go back to the bed.",
                        "Place the phone to the right of the first phone. "
                    ],
                    "task_desc":"Move the phones from the drawers to the bed. "
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "tests_unseen/trial_T20190908_113832_021708/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Cross the room and face the brown dresser with the vase on it.",
                        "Pick the vase up from the dresser.",
                        "Go right and face the book shelves in the corner.",
                        "Put the vase on the shelf."
                    ],
                    "task_desc":"Put a vase on a shelf."
                },
                {
                    "high_descs":[
                        "Walk over to the dresser across the room that is below a mirror on the wall.",
                        "Pick up the golden vase off of the dresser.",
                        "Turn right and walk over to the wooden shelving unit.",
                        "Put the golden vase on the bottom shelf of the wooden shelving unit."
                    ],
                    "task_desc":"Move a golden vase to a wooden shelving unit."
                },
                {
                    "high_descs":[
                        "Go across the room to the dresser that is underneath the mirror hanging on the wall. ",
                        "Pick up the gold vase on the right side of the dresser, between the cell phone and the pencil. ",
                        "Turn to your right and go to the wooden shelf across from you.",
                        "Place the gold vase on the middle of the second shelf. "
                    ],
                    "task_desc":"Put the gold vase on the shelf. "
                }
            ],
            "relative_objects":[
                "Vase"
            ]
        },
        "tests_unseen/trial_T20190908_154411_041403/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "take two steps to the right",
                        "pick up the book that is on the bed",
                        "turn right, walk forward to the dresser",
                        "put book in dresser cabinet"
                    ],
                    "task_desc":"move book from bed to cabinet"
                },
                {
                    "high_descs":[
                        "Move just slightly over to the right.",
                        "Pick up the book that is on the bed. ",
                        "Turn to the right, walk to the end of the bed, turn left then turn right to face the entertainment center. ",
                        "Place the book in the cabinet that is the third cabinet from the left and close the door."
                    ],
                    "task_desc":"Move a book to inside of a cabinet."
                },
                {
                    "high_descs":[
                        "Go to the bed",
                        "Pick up a book from the bed",
                        "Go to the dresser",
                        "Place the book in the dresser"
                    ],
                    "task_desc":"Move a book to a dresser"
                }
            ],
            "relative_objects":[
                "Cabinet",
                "Book"
            ]
        }
    }
}