{
    "scene_name":"FloorPlan321",
    "trials":{
        "train/pick_two_obj_and_place-CD-None-SideTable-321/trial_T20190912_051931_742211/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AU34T9OMHN4Z4_317HQ483IA93BU1ZT1XR07TY87CINW",
                    "high_descs":[
                        "Turn around and move to the trash can to the left of the desk",
                        "Pick up the cd from inside the trash can",
                        "Turn right and move to the small table between the chair and the bed",
                        "Put the CD to the right of the lamp",
                        "Move to the chair to the left of the nightstand",
                        "Pick up the CD to the left of the lap top",
                        "Move to the table to the right of the chair",
                        "Put the CD on the left most corner of the nightstand"
                    ],
                    "task_desc":"Moving 2 CDs to the nightstand",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_two_obj_and_place-CD-None-SideTable-321/trial_T20190908_075144_817104/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AU34T9OMHN4Z4_3RU7GD8VPRAS8TG8ES4X8Y4GHJUSP7",
                    "high_descs":[
                        "Turn right towards the brown chair",
                        "Pick up the CD from the chair",
                        "Turn to the table on the right between the chair and the bed",
                        "Place the CD on the table",
                        "Turn around and go to the table and turn right to face the clock and tissues",
                        "Pick up the CD from behind the pencil on the table",
                        "Turn around and go to the table between the chair and the bed",
                        "Put the CD to the right of the lamp"
                    ],
                    "task_desc":"Moving 2 cd's to a table beside the bed",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Bed-321/trial_T20190908_231504_321117/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_30IQTZXKANX51IKLNPKBTR42I220XJ",
                    "high_descs":[
                        "turn right, walk to the desk, turn right, take two steps, turn left, take a step, turn right, walk to chair",
                        "pick up the phone that is on the chair",
                        "turn right, walk to the bed, turn right, take a few steps, turn left, take a few steps, turn left to face the bed",
                        "put the phone on to the bed"
                    ],
                    "task_desc":"move the phone from the chair to the bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3MLUEOP3CCLXL_38BQUHLA9ZRFAND0B3KD8BKM912OMH",
                    "high_descs":[
                        "Turn to the right and walk to the desk then take a right and head to the arm chair in the left corner of the room",
                        "Pick up the black cell phone that is sitting on the chair",
                        "Turn right and walk to the bed then make another right and go to the desk, at the desk make a left then turn left to face the end of the bed",
                        "Place the cell phone on the bed in front of the laptop"
                    ],
                    "task_desc":"Place a cell phone on a bed",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2KAGFQU28JY43_3IXQG4FA2WPGK95XIPBMX5E323J9B6",
                    "high_descs":[
                        "Turn to your right and go to the desk, then turn right again and walk past the desk, and to the chair in the corner of the room to the left of you. ",
                        "Pick up the cell phone near the edge of the seat on the chair. ",
                        "Turn to your right and go to the bed, then turn to your right again and go to the end of the bed, turn left and turn around so that you are facing the head of the bed. ",
                        "Place the cell phone on the bed, in front of the computer on the right. "
                    ],
                    "task_desc":"Put the cell phone on the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Bed",
                "Chair"
            ]
        },
        "train/pick_and_place_simple-Pillow-None-ArmChair-321/trial_T20190908_104920_763828/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A2A4UAFZ5LW71K_33PPO7FECY62A7WK0F855O16OAYIDD",
                    "high_descs":[
                        "turn around, walk to the table, turn right to face the bed",
                        "pick up the pillow that is on the bed",
                        "turn right, take a few steps, turn right, walk forward, turn right to face chair",
                        "put the pillow on the chair"
                    ],
                    "task_desc":"move pillow from bed to chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_3XC1O3LBOVDBHX0N785X28BK8ZALT5",
                    "high_descs":[
                        "Turn around and turn right at the side table to face the bed.",
                        "Pick up the purple pillow to the left of the book with the red circle on the bed.",
                        "Turn right, hang a right at the table and face the chair on the right.",
                        "Put the pillow on the left side of the cushion on the chair."
                    ],
                    "task_desc":"Place a pillow on a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A028LRDJB7ZB_3U5NZHP4LUTB39OQZ6HF56HG2FHPHY",
                    "high_descs":[
                        "Turn left on then walk towards the side table then face the bed on your right",
                        "Pick up the pillow near you on the bed",
                        "Turn right then head to the couch on your right",
                        "Put the pillow on the couch beside the cd"
                    ],
                    "task_desc":"Put the pillow from the bed to the couch",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "Bed",
                "Chair"
            ]
        },
        "train/pick_and_place_simple-Pillow-None-ArmChair-321/trial_T20190908_104935_443304/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3F7G1FSFWQPLE_340UGXU9D1STDFR6LHXDUDVOIB3UV8",
                    "high_descs":[
                        "Turn right and walk over to the small black table, then turn right to face the bed.",
                        "Pick up the closest purple pillow off of the bed.",
                        "Walk over to the chair in the corner of the room behind you.",
                        "Place the purple pillow on the left side of the seat of the chair."
                    ],
                    "task_desc":"Move a purple pillow to the seat of a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3PMBY0YE2AUZUEX3WP7H8PKLKJCC9Z",
                    "high_descs":[
                        "Walk to the table, then turn right and walk across the room, then turn right to face the bed. ",
                        "Pick up the pillow that is closest to the edge of the bed. ",
                        "Turn around and walk to the chair. ",
                        "Place the pillow on the chair. "
                    ],
                    "task_desc":"To put the pillow on the chair. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1SX8IVV82M0LW_3TPWUS5F8CSA6AABP0H9M9SWIK9WCL",
                    "high_descs":[
                        "Walk to the bed on the left side.",
                        "Pick up the nearest purple pillow off the bed.",
                        "Walk to the seat on the left.",
                        "Place the pillow on the seat."
                    ],
                    "task_desc":"Move a pillow from the bed to the seat.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Pillow"
            ]
        },
        "train/pick_and_place_simple-Pillow-None-ArmChair-321/trial_T20190908_104900_888704/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1ELPYAFO7MANS_3HOSI13XH2FL2WGY817UERLTW4WDDA",
                    "high_descs":[
                        "Turn around and veer left to the end of the bed.",
                        "Pick up the maroon cushion on the bed, the one closest to you.",
                        "Turn left and then go ahead, veering right to the chair in the corner.",
                        "Place the cushion on the chair."
                    ],
                    "task_desc":"Place a cushion on a chair.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A6U2C66WQ7QQN_3J88R45B2JP8PZO54AZ18S5AQ57PXY",
                    "high_descs":[
                        "Turn around, head to the bed",
                        "Take the brown pillow from the bed",
                        "Turn around, head to the chair in the corner",
                        "put the pillow in the chair"
                    ],
                    "task_desc":"Take the pillow from the bed, put it in the chair",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A12HZGOZQD5YK7_3OLQQLKKNVG3XOUQES4PN7YR10SEJG",
                    "high_descs":[
                        "Turn around, then turn left and go to the end of the bed.",
                        "Pick up the cushion next to the book.",
                        "Turn left, go across the room and turn left towards the chair.",
                        "Put the cushion on the chair."
                    ],
                    "task_desc":"Put a cushion on the chair.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "Chair"
            ]
        },
        "train/pick_two_obj_and_place-CD-None-Drawer-321/trial_T20190908_051554_943566/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3C81THYYSBGVD_3VNXK88KKFZN8YH5RYD5XVO8BHKV9U",
                    "high_descs":[
                        "Turn around, then face the black table to your right.",
                        "Take the CD from the black table in front of you.",
                        "Turn around in a circle, face the black table in front of you.",
                        "Open the black table drawer in front of you, place the CD inside the black table and close the cabinet.",
                        "Turn left and face the grey couch on your right.",
                        "Take the CD off the grey couch in front of you.",
                        "Turn right, then left and head towards the black table in front of you.",
                        "Open the black table drawer in front of you, place the CD inside and close the drawer."
                    ],
                    "task_desc":"Put CD's away in black table.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CD"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-ArmChair-321/trial_T20190906_200534_135586/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_36WLNQG782RPUGAGUS2ROXVCY3FBE6",
                    "high_descs":[
                        "Move to the brown table.",
                        "Pick up the phone from the table. ",
                        "Bring the phone to the chair in the corner. ",
                        "Put the phone down on the chair. "
                    ],
                    "task_desc":"Put the phone down on the chair. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2TOL27LWBR7XG_3EICBYG647DGF1OEMT9DWXEMLTWJCL",
                    "high_descs":[
                        "Turn left and go to the desk on the left.",
                        "Pick up the cell phone that is on the desk next to the keys.",
                        "Turn right and walk to the chair in the corner of the room by the window.",
                        "Put the cell phone on the left corner of the chair closest to you."
                    ],
                    "task_desc":"Move the cell phone from the desk to the chair.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1VAL7L9L79IN0_3WS1NTTKE1TGG772RNP8MYKTJYH0F7",
                    "high_descs":[
                        "Turn around and walk to the wooden table to your right.",
                        "Pick up the cell phone on the wooden table.",
                        "Turn to your right and walk to the brown lounge chair",
                        "Place the cell phone on the brown lounge chair."
                    ],
                    "task_desc":"Place the cell phone on the brown lounge chair.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "tests_seen/trial_T20190908_231519_766442/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Make a left to to walk to the black side table next to the bed.",
                        "Pick up the smartphone on the black table.",
                        "Make a right and stand next to the bed.",
                        "Put the smartphone down on the bed."
                    ],
                    "task_desc":"Move the smartphone from the black side table to the bed."
                },
                {
                    "high_descs":[
                        "Hang a left at the bed and walk to the black side table ahead.",
                        "Pick up the black cell phone from the left side of the table.",
                        "Turn around, hang a left at the wooden table and walk to the end of the bed on the left.",
                        "Put the cell phone on the bed to the right of the laptop computer near the edge."
                    ],
                    "task_desc":"Place a cell phone on a bed."
                },
                {
                    "high_descs":[
                        "Walk forward towards the bed, then turn left and walk up to the bedside table. ",
                        "Pick up the cell phone that is sitting on the bedside table. ",
                        "Turn around completely, walk to the trash bin, turn left, walk a few steps, then turn left to face the foot of the bed. ",
                        "Place the cell phone down on the bed, to the right of the laptop. "
                    ],
                    "task_desc":"Move a cell phone to the bed. "
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "tests_seen/trial_T20190907_121849_514225/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move to the middle of the bed in front of you",
                        "Pick up a pillow from the bed.",
                        "Move to the arm chair in the left corner to the left of you,",
                        "Place the pillow on the arm chair.",
                        "Move to the foot of the bed to your right.",
                        "Pick up the second pillow from the bed.",
                        "Move to the arm chair to the left of you.",
                        "Place the pillow on the arm chair next to the other one."
                    ],
                    "task_desc":"Move the purple pillows to the arm chair from the bed."
                }
            ],
            "relative_objects":[
                "Pillow"
            ]
        }
    }
}