{
    "scene_name":"FloorPlan302",
    "trials":{
        "train/pick_and_place_simple-Laptop-None-Bed-302/trial_T20190908_112426_055221/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"ADXRJFEHIDXRE_38BQUHLA9ZRFAND0B3KD8BKM9WTMOW",
                    "high_descs":[
                        "Walk over to the plant on the window sill and turn right to face the desk.",
                        "Close the laptop on the desk and pick it up.",
                        "Turn around and walk over to the bed.",
                        "Put the laptop on the bed to the right of the cell phone."
                    ],
                    "task_desc":"Move the laptop from the desk to the bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3U088ZLJVNKQCIFVDKOPR8QV9VM0W6",
                    "high_descs":[
                        "Go right to cross the room and then turn right to face the end of the desk.",
                        "Close the computer and pick it up from the desk.",
                        "Turn around and face the bed.",
                        "Put the computer down on the bed to the right of the phone."
                    ],
                    "task_desc":"Put a computer down on a bed.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A98E8M4QLI9RS_3TK8OJTYM4CGLAJA4VYJK78PATQPVK",
                    "high_descs":[
                        "move forward across the room and turn right before the bed, go forward to the wall between the night stand and the desk, turn to the right to face the desk",
                        "close the lid on the lap top that is on the desk and pick up the lap top off of the desk",
                        "turn around to face the bed",
                        "put the lap top on to the bed to the left of the night stand"
                    ],
                    "task_desc":"put a closed lap top on to the bed",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Bed-302/trial_T20190908_112436_878411/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3EQHHY4HQVJTA3BWVLQJM00YWF0G51",
                    "high_descs":[
                        "Move a bit to the left, then walk up to the window and turn right to face the side of the desk.",
                        "Close the laptop that is on the desk and pick it up.",
                        "Turn around to face the bed.",
                        "Place the laptop down to the right of the book that is on the bed. "
                    ],
                    "task_desc":"Move a laptop to the bed. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3VNL7UK1XIAPH5QRLX2Z7V60B3NFTT",
                    "high_descs":[
                        "turn left, take two steps, turn right, walk towards small table, turn right to face the desk",
                        "shut the computer that is on the desk, pick it up",
                        "turn right, walk forward, turn right to face the bed",
                        "put the computer on the bed"
                    ],
                    "task_desc":"move computer from desk to the bed",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1ELPYAFO7MANS_3FE7TXL1LLESOVMNGYTXI71OIS72Q6",
                    "high_descs":[
                        "Walk ahead to the left side of the desk.",
                        "Close the laptop lid and pick up the laptop.",
                        "Turn around and face the bed.",
                        "Put the laptop on the bed to the left of the cushion."
                    ],
                    "task_desc":"Place a laptop on a bed.",
                    "votes":[
                        1,
                        1,
                        0
                    ]
                }
            ],
            "relative_objects":[
                "Pillow",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Laptop-None-Bed-302/trial_T20190908_112452_253912/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1NWXL4QO30M8U_31JLPPHS2XLEO15Q5LFYCCBG96E3O1",
                    "high_descs":[
                        "Turn around and take two steps then turn right and walk across the room, then turn right to face the table. ",
                        "Close the laptop on the table then pick it up. ",
                        "Turn to the right and take one step, then turn to the right and face the bed. ",
                        "Put the laptop down on the edge of the bed."
                    ],
                    "task_desc":"Move the laptop to the bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2871R3LEPWMMK_34QN5IT0T2IFMHJDFH8JDSN9RP080I",
                    "high_descs":[
                        "Turn around, hang a right at the small dresser, walk to the wall and turn right to face the wooden desk.",
                        "Close the lid of the laptop computer and pick it up from the desk.",
                        "Turn right and walk to the bed on the right side.",
                        "Put the laptop computer on the bed to the right of the purple pillow."
                    ],
                    "task_desc":"Put a laptop computer on a bed.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2A4UAFZ5LW71K_3HL8HNGX48S6XQHDNRXIGV5OHX69FB",
                    "high_descs":[
                        "turn around, walk forward, turn right before the bed, walk to the wall between desk and small table, turn right to face desk",
                        "close the computer that is on the desk, pick it up",
                        "turn right, take a few steps, turn right to face the bed",
                        "put the computer on the bed"
                    ],
                    "task_desc":"move computer from the desk to the bed",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bed",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Desk-302/trial_T20190908_032804_340464/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3SFPSMFRSRTB3_3DOCMVPBTQVVPVCQQHAJ5FPFUUFNN2",
                    "high_descs":[
                        "Turn around, walk to area between desk and nightstand.",
                        "Pick up pencil from the window sill, to the right of the potted plant.",
                        "Turn left and head to the desk.",
                        "Place the pencil on the desk, diagonally, to the left of the brown box and the light line."
                    ],
                    "task_desc":"Move a pencil from the window sill to the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A272X64FOZFYLB_3TXWC2NHN277G601X380M841C4OS92",
                    "high_descs":[
                        "Turn around and walk forward to the plant by the window.",
                        "Pick up the pencil which is to the right of the plant.",
                        "Turn around and walk to the alarm clock on the right side of the desk.",
                        "Put the pencil on the desk, to the left of the alarm clock."
                    ],
                    "task_desc":"Move a pencil from a window sill to a desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3FTOP5WARI5WL9TYADGT1WCLDHVJ0F",
                    "high_descs":[
                        "Turn around, then go straight to approach the windowsill.",
                        "Pick up the pencil, to the right of the plant in the windowsill.",
                        "Turn around, go straight, then turn left to face the desk.",
                        "Put the pencil on the desk, to the left of the clock."
                    ],
                    "task_desc":"Put a pencil on the desk.",
                    "votes":[
                        1,
                        0,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Book",
                "Laptop"
            ]
        },
        "train/pick_and_place_simple-Pencil-None-Desk-302/trial_T20190908_032739_677771/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3MLUEOP3CCLXL_3NVC2EB65TGIXQNUF0ZFDHPGTY13Y3",
                    "high_descs":[
                        "Turn around and head forward, at the night stand take a right and cross the room to the potted plant sitting in the window sill ",
                        "Pick up the pencil that is sitting on the window sill in front of the potted plant",
                        "Turn around and take a step, then turn left and walk to the desk",
                        "Place the pencil on the desk to the left of the sunlight marks"
                    ],
                    "task_desc":"Place a pencil on a desk",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3PPTZCWALT1A9H319XDU4WRT9KHQZI",
                    "high_descs":[
                        "Turn around and go right to cross the room to face the plant in the window.",
                        "Pick the pencil up from in front of the plant.",
                        "Turn and go right to face the desk.",
                        "Put the pencil down on the right side of the desk."
                    ],
                    "task_desc":"Put a pencil on a desk.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A2ALWT2BUSXD83_3ZWFC4W1UXO4G1R1L08N6ULGT1PFRK",
                    "high_descs":[
                        "Turn around and walk to the window.",
                        "Pick up the pencil on the windowsill",
                        "Walk to the desk on your right.",
                        "Place the pencil on the right side desk."
                    ],
                    "task_desc":"Place a pencil on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Pencil",
                "Desk"
            ]
        },
        "train/pick_two_obj_and_place-Book-None-Desk-302/trial_T20190906_181127_765377/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3HL2LL0LEPZT8_3SUWZRL0M1UJO4TLY1LJDH9JII5E6H",
                    "high_descs":[
                        "Turn left, go to the bed.",
                        "Pick up the book next to the stuffed animal on the bed.",
                        "Turn around, go to the right side of the desk.",
                        "Put the book to the left of the vase on the desk.",
                        "Turn around, go to the safe, turn right to the bed.",
                        "Pick up the book on the bed.",
                        "Turn right, go to the right side of the desk.",
                        "Put the book to the right of the vase on the desk."
                    ],
                    "task_desc":"Put the books on the desk.",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A16184N1RO5OJV_3634BBTX0RBRN2OIVDEES2KP658IFL",
                    "high_descs":[
                        "Turn around and walk to the right to go to the bed. ",
                        "Pick up a book near the stuffed animal on the bed. ",
                        "Turn around and go to the yellow desk on the other side of the wall. ",
                        "Put the book on the desk near the first bowl. ",
                        "Walk to the right, turn right  near the door, walk straight to the white cabinet and face the bed. ",
                        "Grab another book from on top of the bed. ",
                        "Walk to the right, turn left and turn right to go back to the yellow desk. ",
                        "Put The book to the right of the first book on the desk. "
                    ],
                    "task_desc":"Put 2 books side by side near the bowl on the yellow desk. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Desk",
                "Book"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Safe-302/trial_T20190908_122723_141074/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AM2KK02JXXW48_33LKR6A5KHBYRQWJEYNEIT26AUF1TR",
                    "high_descs":[
                        "Turn right, go to the table with the phone.",
                        "Pick up the phone on the table. ",
                        "Bring the phone to the safe next to the bed. ",
                        "Put the phone in the safe next to the bed. "
                    ],
                    "task_desc":"Put a phone in the safe next to the bed. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F7G1FSFWQPLE_3OVHNO1VE9SO5XLU0JWR5J4WKMUZDJ",
                    "high_descs":[
                        "Turn right and walk up to the wooden end table with the lamp on it.",
                        "Pick up the phone off of the end table.",
                        "Turn right and walk forward, then hang a left and walk up to the small white safe on the ground.",
                        "Open the safe and put the phone inside, then close the safe."
                    ],
                    "task_desc":"Put a phone in a safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1MKCTVKE7J0ZP_3PJ71Z61R7TF7BN5GSIXRT1UGNJ19Y",
                    "high_descs":[
                        "Turn right to face the nightstand with the lamp on it.",
                        "Pick up the cell phone from the nightstand.",
                        "Turn right and move forward, then turn left to go to the safe next to the bed.",
                        "Put the cell phone in the safe."
                    ],
                    "task_desc":"Put a cell phone inside of the safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Safe",
                "CellPhone",
                "Bed"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Safe-302/trial_T20190908_122757_136508/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A6U2C66WQ7QQN_3AMYWKA6YEDDLKS8ONDWJFN0JWEO6O",
                    "high_descs":[
                        "Turn around, head to the night stand",
                        "Take the white cell phone from the night stand",
                        "Head to the left, open the white safe",
                        "Put the cell phone in the safe, close the door to the safe"
                    ],
                    "task_desc":"Put the white cell phone in the safe",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3MD9PLUKKL5XR9C7PDAU1OGQYQLZNQ",
                    "high_descs":[
                        "Turn around and go left and then turn left to face the night stand with the phone on it.",
                        "Pick the phone up from the night stand.",
                        "Go left and then right and face the white safe on the floor in front of the bed.",
                        "Put the phone in the safe and shut it."
                    ],
                    "task_desc":"Put a phone in a safe.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3UF6XXFFRR237_3SKRO2GZ74IZO76WKP9MH2FARG41KZ",
                    "high_descs":[
                        "go to the night stand",
                        "pick up the phone from the stand",
                        "take the phone to the safe on the floor",
                        "put the phone in the safe"
                    ],
                    "task_desc":"take the phone from the nightstand and put it in the safe.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Safe-302/trial_T20190908_122741_565733/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3R19ZA45J8915_3FE7TXL1LLESOVMNGYTXI71OISIQ25",
                    "high_descs":[
                        "Turn around, walk up to the window, then turn right to face the desk.",
                        "Pick up the cell phone that is sitting on the desk.",
                        "Turn right, walk to the nightstand, then turn right again and walk up to the safe that is on the floor. ",
                        "Place the cell phone in the safe and close the door."
                    ],
                    "task_desc":"Move a cell phone to the safe. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AM2KK02JXXW48_3NJM2BJS4ZXKM1DADE3EUFK0PN9PCM",
                    "high_descs":[
                        "Turn around, move to the window shelf, turn right to face the side of the table in front of the window shelf. ",
                        "Pick up the phone on the window shelf. ",
                        "Turn right, go to the lamp past the bed, turn right, go to the safe on the other side of the bed.",
                        "Open up the safe and put the phone inside, close the safe. "
                    ],
                    "task_desc":"Secure a phone inside a safe. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1NWXL4QO30M8U_3ZDAD0O1T446HRHCLR8LD267F8MTX1",
                    "high_descs":[
                        "Turn around and walk across the room, then turn to the right to face the table.",
                        "Pick up the cell phone that is on the table. ",
                        "Turn to the right and walk across the room, then turn to the right. ",
                        "Open the cupboard that is to the left of the bed and place the cell phone inside."
                    ],
                    "task_desc":"Put away the cell phone in the bedside table. ",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Drawer-302/trial_T20190907_235412_132976/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3UF6XXFFRR237_3HQUKB7LNIVB5344KLKTVBVNM78HHR",
                    "high_descs":[
                        "walk over to the side of the nightstand",
                        "pick up the phone from the stand",
                        "walk the phone around to the other side of the stand",
                        "place the phone in the bottom drawer of the nightstand"
                    ],
                    "task_desc":"take the phone from the top of the nightstand and place it in the drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A3F51C49T9A34D_3LRKMWOKB8YTHY1G7MNT8ETQTE7Z2H",
                    "high_descs":[
                        "turn to the right and take a few steps and turn to the right and go between the night stand and the desk and turn to the left facing the night stand",
                        "pick up the smart phone from the bed",
                        "turn to the left and go past clear the bed and turn to the left and take a few steps forward and turn to the right and take a few steps and turn to the right facing a night stand",
                        "open the bottom drawer of the night stand and put the phone in it and close the drawer"
                    ],
                    "task_desc":"Place a smart phone in the bottom drawer of a night stand",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3Z7VU45IP1YMSDJKOINF3VJL18O1ZX",
                    "high_descs":[
                        "Turn around then move straight to the night stand to the right of the bed",
                        "Pick up the phone sitting on top of the night stand",
                        "Carry the phone to the other night stand to the right of the bedroom door",
                        "Place the phone in the bottom drawer of the nightstand then close the drawer"
                    ],
                    "task_desc":"Move a phone to the night stand drawer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "AlarmClock",
                "CellPhone"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Drawer-302/trial_T20190907_235359_470335/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3SFPSMFRSRTB3_33SA9F9TR0BHIJ8RPJYNBB8X9FFEWU",
                    "high_descs":[
                        "Turn around, proceed to nightstand.",
                        "Pick up phone from left of cd.",
                        "Turn around to face same nightstand.",
                        "Open drawer of nightstand.  Put phone in drawer, all the way to the top, close the drawer."
                    ],
                    "task_desc":"Move a phone into a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3M1CVSFP63M989VTX5XVN30K0ZIQAP",
                    "high_descs":[
                        "Go right and the turn to the right again to face the small dresser with the disc on it.",
                        "Pick the phone up from the dresser.",
                        "Back up and stand to the side of the dresser.",
                        "Put the phone in the top drawer of the dresser and shut the drawer."
                    ],
                    "task_desc":"Put a phone in a dresser drawer.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3QBD8R3Z240RL82W9RV0LVJKTON4O3",
                    "high_descs":[
                        "Move to the night stand to the right of the bedroom door",
                        "Pick up the phone between the CD and the desk lamp on the night stand",
                        "Move while carrying the phone to face the night stand drawer",
                        "Place the phone inside of the drawer then close the drawer"
                    ],
                    "task_desc":"Move a phone to the drawer",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone",
                "Drawer"
            ]
        },
        "train/pick_and_place_simple-CellPhone-None-Drawer-302/trial_T20190907_235426_919624/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A3JZLYQ606HJJR_3K9FOBBF2K051V95E4U4SNLQP0RNLE",
                    "high_descs":[
                        "Move to the left side of the brown end table with the lamp that is directly in front you. ",
                        "Pick up the white cell phone that is on the top of the stand. ",
                        "Move back around to the front of the stand in front of you with the lamp. ",
                        "Open the top drawer. Place the cell phone inside. close the drawer. "
                    ],
                    "task_desc":"Move the cell phone from the top of an end table to the top drawer. ",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A38Z99XF4NDNH0_3KV0LJBBH52AMBJI7NC01K5PQ38MR7",
                    "high_descs":[
                        "Turn left then face the night stand where the phone is on top of the night stand",
                        "Pick up the phone on top of the night stand",
                        "Carry the phone to face the drawer of the wooden night stand",
                        "Place the phone inside of the drawer then shut the drawer"
                    ],
                    "task_desc":"Place a phone in the night stand drawer",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AJQGWGESKQT4Y_3VSOLARPKEQ3WPFM7O7ZE0WPKQM93S",
                    "high_descs":[
                        "Move to the left and turn to face the left side of the dresser with the phone on it.",
                        "Pick the phone up from the dresser.",
                        "Back up and turn to face the side of the dresser with the lamp.",
                        "Open the top drawer and put the phone in and shut the drawer."
                    ],
                    "task_desc":"Put a phone in a drawer.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/pick_two_obj_and_place-CellPhone-None-Safe-302/trial_T20190909_065455_263840/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1T643M1P572AA_3WJEQKOXABTTCUXA8YWXNOCEMC91AZ",
                    "high_descs":[
                        "turn left and move forward and turn left and face the dresser",
                        "pick up the phone",
                        "turn right and move forward and open the safe",
                        "open safe and put phone inside of it",
                        "turn around and move forward and then turn right and face the dresser",
                        "pick up the 2nd phone",
                        "turn right and move forward and then turn left and then head forwards to the safe",
                        "open the safe and put the 2nd phone inside"
                    ],
                    "task_desc":"pick up the first phone for the dresser and put it in the safe. Go back and pick up 2nd phone and put it in the safe too.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "CellPhone"
            ]
        },
        "train/look_at_obj_in_light-Bowl-None-DeskLamp-302/trial_T20190907_190751_819937/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"A1RLO9LNUJIW5S_3H0W84IWBNJCANR5QPOHOC0GHP6REO",
                    "high_descs":[
                        "Turn around and walk to the wall then turn right.",
                        "Pick up the clear bowl that's above another clear bowl.",
                        "Turn right and walk to the small night stand then take a step right so you're standing in front of the light.",
                        "Turn on the light."
                    ],
                    "task_desc":"Inspect a bowl by lamplight.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"AUTYWXILTACCR_3OS46CRSLIG0QFF7TRATDLX6LXU6VA",
                    "high_descs":[
                        "Walk forward and turn to the desk on your right.",
                        "Pick up the clear bowl to the bottom left of the phone on the desk.",
                        "Walk across the room to face the end table that has a lamp on it.",
                        "Turn the lamp on."
                    ],
                    "task_desc":"Examine a bowl in the light of a lamp.",
                    "votes":[
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"A1DMXEJGJY02E1_3R9WASFE22XDISDSVH20SXNF28ZFZK",
                    "high_descs":[
                        "Walk to the desk by the window.",
                        "Pick up the bowl in the middle of the desk.",
                        "Turn around and go to the table by the door.",
                        "Turn on the lamp."
                    ],
                    "task_desc":"Look at the bowl in the lamp light.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Bowl"
            ]
        },
        "valid_seen/pick_two_obj_and_place-Book-None-Desk-302/trial_T20190906_181233_363875/traj_data.json":{
            "tasks":[
                {
                    "assignment_id":"AOWW3URQNRJ6U_3WMOAN2SREE8X0LZS8WAFWJRD2PVN4",
                    "high_descs":[
                        "Turn around and face the dresser next to the bed on your left. ",
                        "Pick up the book on the dresser. ",
                        "Turn around and face the open space on the desk.",
                        "Place the book on to the desk in front of you.",
                        "Turn around and move to the bed behind you.",
                        "Pick up the book closest to you on the bed. ",
                        "Turn around and move back to the desk where the book is. ",
                        "Place that book behind the other book on the desk. "
                    ],
                    "task_desc":"Move books in the room over to the desk. ",
                    "votes":[
                        1,
                        1,
                        1
                    ]
                },
                {
                    "assignment_id":"ARL7HOWLEHNOP_336YQZE83YVLHOLKAGZXYJ0SVPOM51",
                    "high_descs":[
                        "Turn left, walk across the room, turn left, walk towards the bed, turn right, and walk towards the night stand.",
                        "Pick up the Deep Learning book from the top of the night stand.",
                        "Turn left, walk forward, then turn left and walk to the desk with the clock.",
                        "Place the Deep Learning book on the desk to the left of the clock.",
                        " Turn around, turn right, then walk towards the bed.",
                        "Pick up the book on the bed.",
                        "Turn around and walk towards the desk directly behind the Deep Learning book.",
                        "Place the book on top of the desk"
                    ],
                    "task_desc":"Put the books on the desk.",
                    "votes":[
                        1,
                        1
                    ]
                }
            ],
            "relative_objects":[
                "Book"
            ]
        },
        "tests_seen/trial_T20190908_100949_012440/traj_data.json":{
            "tasks":[
                {
                    "high_descs":[
                        "Move forward then turn left on the side of the desk",
                        "Pick up the pencil on the desk ",
                        "Turn right then walk forward head to the drawer at the end of the bed",
                        "Turn on the lamp"
                    ],
                    "task_desc":"Examine the pencil by the light"
                },
                {
                    "high_descs":[
                        "Take one step forward and then turn right to face the table. ",
                        "Pick up the pencil that is in the sunlight on the table. ",
                        "Turn to the right and walk across the room, then turn right and take one step, then turn left to face the table. ",
                        "Turn on the lamp. "
                    ],
                    "task_desc":"Look at the pencil in lamp light. "
                },
                {
                    "high_descs":[
                        "Turn right to face the desk. ",
                        "Pick up the pencil in front of the magazine. ",
                        "Turn right and walk to the drawers in front of you with the lamp on it. ",
                        "Turn the lamp on that's on the drawers. "
                    ],
                    "task_desc":"To pick up a pencil and turn the lamp on. "
                }
            ],
            "relative_objects":[
                "Pen",
                "Book",
                "AlarmClock",
                "Pencil",
                "KeyChain"
            ]
        }
    }
}